NCURSES-Programming-HOWTO.org
#+TITLE:  NCURSES Programming HOWTO
#+AUTHOR: ppadala
#+MAIL: ppadala@gmail.com
#+LANGUAGE: en
#+OPTIONS: H:5 num:nil html-postamble:nil html-style:nil html-scripts:nil
#+html_head: <link rel="stylesheet" type="text/css" href="worg-data/worg.css" /
#+STARTUP: showall


* Revision History

  - Revision 1.9     2005-06-20   Revised by: ppadala

    The license has been changed to the MIT-style license used by
    NCURSES. Note that the programs are also re-licensed under this.

  - Revision 1.8     2005-06-17   Revised by: ppadala

    Lots of updates. Added references and perl examples. Changes to
    examples. Many grammatical and stylistic changes to the
    content. Changes to NCURSES history.

  - Revision 1.7.1   2002-06-25   Revised by: ppadala

    Added a README file for building and instructions for building
    from source.

  - Revision 1.7     2002-06-25   Revised by: ppadala

    Added "Other formats" section and made a lot of fancy changes to
    the programs. Inlining of programs is gone.

  - Revision 1.6.1   2002-02-24   Revised by: ppadala

    Removed the old Changelog section, cleaned the makefiles

  - Revision 1.6     2002-02-16   Revised by: ppadala

    Corrected a lot of spelling mistakes, added ACS variables section

  - Revision 1.5     2002-01-05   Revised by: ppadala

    Changed structure to present proper TOC

  - Revision 1.3.1   2001-07-26   Revised by: ppadala

    Corrected maintainers paragraph, Corrected stable release number

  - Revision 1.3     2001-07-24   Revised by: ppadala

    Added copyright notices to main document (LDP license) and
    programs (GPL), Corrected =printw_example=.

  - Revision 1.2     2001-06-05   Revised by: ppadala

    Incorporated ravi's changes. Mainly to introduction, menu, form,
    justforfun sections

  - Revision 1.1     2001-05-22   Revised by: ppadala

    Added "a word about window" section, Added =scanw_example=.


  #+BEGIN_ITALIC
    This document is intended to be an "All in One" guide for
    programming with ncurses and its sister libraries. We graduate
    from a simple "Hello World" program to more complex form
    manipulation. No prior experience in ncurses is assumed. Send
    comments to [[mailto:ppadala@gmail.com][this address]]
  #+END_ITALIC

