NCURSES-Programming-HOWTO.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>NCURSES Programming HOWTO</title>
<!-- 2016-01-14 jue 17:14 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="ppadala" />
<link rel="stylesheet" type="text/css" href="worg-data/worg.css" /
</head>
<body>
<div id="content">
<h1 class="title">NCURSES Programming HOWTO</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Revision History</a></li>
<li><a href="#sec-2">1. Introduction</a>
<ul>
<li><a href="#sec-2-1">1.1. What is NCURSES?</a></li>
<li><a href="#sec-2-2">1.2. What we can do with NCURSES</a></li>
<li><a href="#sec-2-3">1.3. Where to get it</a>
<ul>
<li><a href="#sec-2-3-1"><i>Compiling the package</i></a></li>
<li><a href="#sec-2-3-2"><i>Using the RPM</i></a></li>
</ul>
</li>
<li><a href="#sec-2-4">1.4. Purpose/Scope of the document</a></li>
<li><a href="#sec-2-5">1.5. About the Programs</a></li>
<li><a href="#sec-2-6">1.6. Other Formats of the document</a>
<ul>
<li><a href="#sec-2-6-1">1.6.1. Readily available formats from tldp.org</a></li>
<li><a href="#sec-2-6-2">1.6.2. Building from source</a></li>
</ul>
</li>
<li><a href="#sec-2-7">1.7. Credits</a></li>
<li><a href="#sec-2-8">1.8. Wish List</a></li>
<li><a href="#sec-2-9">1.9. Copyright</a></li>
</ul>
</li>
<li><a href="#sec-3">2. Hello World !!!</a>
<ul>
<li><a href="#sec-3-1">2.1. Compiling With the NCURSES Library</a></li>
<li><a href="#sec-3-2">2.2. Dissection</a>
<ul>
<li><a href="#sec-3-2-1">2.2.1. About initscr()</a></li>
<li><a href="#sec-3-2-2">2.2.2. The mysterious refresh()</a></li>
<li><a href="#sec-3-2-3">2.2.3. About endwin()</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-4">3. The Gory Details</a></li>
<li><a href="#sec-5">4. Initialization                                                   </a>
<ul>
<li><a href="#sec-5-1">4.1. Initialization functions</a>
<ul>
<li><a href="#sec-5-1-1">4.1.1. <code>raw()</code> and <code>cbreak()</code></a></li>
<li><a href="#sec-5-1-2">4.1.2. <code>echo()</code> and <code>noecho()</code></a></li>
<li><a href="#sec-5-1-3">4.1.3. <code>keypad()</code></a></li>
<li><a href="#sec-5-1-4">4.1.4. <code>halfdelay()</code></a></li>
</ul>
</li>
<li><a href="#sec-5-2">4.2. Miscellaneous Initialization functions</a></li>
<li><a href="#sec-5-3">4.3. An Example</a></li>
</ul>
</li>
<li><a href="#sec-6">5. A Word about Windows</a></li>
<li><a href="#sec-7">6. Output functions</a>
<ul>
<li><a href="#sec-7-1">6.1. <code>addch()</code> class of functions</a></li>
<li><a href="#sec-7-2">6.2. <code>mvaddch()</code>, <code>waddch()</code> and <code>mvwaddch()</code></a></li>
<li><a href="#sec-7-3">6.3. <code>printw()</code> class of functions</a>
<ul>
<li><a href="#sec-7-3-1">6.3.1. <code>printw()</code> and <code>mvprintw</code></a></li>
<li><a href="#sec-7-3-2">6.3.2. <code>wprintw()</code> and <code>mvwprintw</code></a></li>
<li><a href="#sec-7-3-3">6.3.3. <code>vwprintw()</code></a></li>
<li><a href="#sec-7-3-4">6.3.4. A Simple printw example</a></li>
</ul>
</li>
<li><a href="#sec-7-4">6.4. <code>addstr()</code> class of functions</a></li>
<li><a href="#sec-7-5">6.5. A word of caution</a></li>
</ul>
</li>
<li><a href="#sec-8">7. Input functions</a>
<ul>
<li><a href="#sec-8-1">7.1. <code>getch()</code> class of functions</a></li>
<li><a href="#sec-8-2">7.2. <code>scanw()</code> class of functions</a>
<ul>
<li><a href="#sec-8-2-1">7.2.1. <code>scanw()</code> and <code>mvscanw</code></a></li>
<li><a href="#sec-8-2-2">7.2.2. <code>wscanw()</code> and <code>mvwscanw()</code></a></li>
<li><a href="#sec-8-2-3">7.2.3. <code>vwscanw()</code></a></li>
</ul>
</li>
<li><a href="#sec-8-3">7.3. <code>getstr()</code> class of functions</a></li>
<li><a href="#sec-8-4">7.4. Some examples</a></li>
</ul>
</li>
<li><a href="#sec-9">8. Attributes                                                       </a>
<ul>
<li><a href="#sec-9-1">8.1. The details</a></li>
<li><a href="#sec-9-2">8.2. <code>attron()</code> vs <code>attrset()</code></a></li>
<li><a href="#sec-9-3">8.3. <code>attr_get()</code></a></li>
<li><a href="#sec-9-4">8.4. <code>attr_</code> functions</a></li>
<li><a href="#sec-9-5">8.5. <code>wattr</code> functions</a></li>
<li><a href="#sec-9-6">8.6. <code>chgat()</code> functions</a></li>
</ul>
</li>
<li><a href="#sec-10">9. Windows                                                          </a>
<ul>
<li><a href="#sec-10-1">9.1. The basics</a></li>
<li><a href="#sec-10-2">9.2. Let there be a Window !!!</a></li>
<li><a href="#sec-10-3">9.3. Explanation</a></li>
<li><a href="#sec-10-4">9.4. The other stuff in the example</a></li>
<li><a href="#sec-10-5">9.5. Other Border functions</a></li>
</ul>
</li>
<li><a href="#sec-11">10. Colors                                                          </a>
<ul>
<li><a href="#sec-11-1">10.1. The basics</a></li>
<li><a href="#sec-11-2">10.2. Changing Color Definitions</a></li>
<li><a href="#sec-11-3">10.3. Color Content</a></li>
</ul>
</li>
<li><a href="#sec-12">11. Interfacing with the key board                                  </a>
<ul>
<li><a href="#sec-12-1">11.1. The Basics</a></li>
<li><a href="#sec-12-2">11.2. A Simple Key Usage example</a></li>
</ul>
</li>
<li><a href="#sec-13">12. Interfacing with the mouse</a>
<ul>
<li><a href="#sec-13-1">12.1. The Basics</a></li>
<li><a href="#sec-13-2">12.2. Getting the events</a></li>
<li><a href="#sec-13-3">12.3. Putting it all Together</a></li>
<li><a href="#sec-13-4">12.4. Miscellaneous Functions</a></li>
</ul>
</li>
<li><a href="#sec-14">13. Screen Manipulation</a>
<ul>
<li><a href="#sec-14-1">13.1. <code>getyx()</code> functions</a></li>
<li><a href="#sec-14-2">13.2. Screen Dumping</a></li>
<li><a href="#sec-14-3">13.3. Window Dumping</a></li>
</ul>
</li>
<li><a href="#sec-15">14. Miscellaneous features</a>
<ul>
<li><a href="#sec-15-1">14.1. <code>curs_set()</code></a></li>
<li><a href="#sec-15-2">14.2. Temporarily Leaving Curses mode</a></li>
<li><a href="#sec-15-3">14.3. <code>ACS_</code> variables</a></li>
</ul>
</li>
<li><a href="#sec-16">15. Other libraries</a></li>
<li><a href="#sec-17">16. Panel Library</a>
<ul>
<li><a href="#sec-17-1">16.1. The Basics</a></li>
<li><a href="#sec-17-2">16.2. Compiling With the Panels Library</a></li>
<li><a href="#sec-17-3">16.3. Panel Window Browsing</a></li>
<li><a href="#sec-17-4">16.4. Using User Pointers</a></li>
<li><a href="#sec-17-5">16.5. Moving and Resizing Panels</a></li>
<li><a href="#sec-17-6">16.6. Hiding and Showing Panels</a></li>
<li><a href="#sec-17-7">16.7. <code>panel_above()</code> and <code>panel_below()</code> Functions</a></li>
</ul>
</li>
<li><a href="#sec-18">17. Menus Library</a>
<ul>
<li><a href="#sec-18-1">17.1. The Basics</a></li>
<li><a href="#sec-18-2">17.2. Compiling With the Menu Library</a></li>
<li><a href="#sec-18-3">17.3. Menu Driver: The work horse of the menu system</a></li>
<li><a href="#sec-18-4">17.4. Menu Windows</a></li>
<li><a href="#sec-18-5">17.5. Scrolling Menus</a></li>
<li><a href="#sec-18-6">17.6. Multi Columnar Menus</a></li>
<li><a href="#sec-18-7">17.7. Multi Valued Menus</a></li>
<li><a href="#sec-18-8">17.8. Menu Options</a></li>
<li><a href="#sec-18-9">17.9. The useful User Pointer</a></li>
</ul>
</li>
<li><a href="#sec-19">18. Forms Library</a>
<ul>
<li><a href="#sec-19-1">18.1. The Basics</a></li>
<li><a href="#sec-19-2">18.2. Compiling With the Forms Library</a></li>
<li><a href="#sec-19-3">18.3. Playing with Fields</a>
<ul>
<li><a href="#sec-19-3-1">18.3.1. Fetching Size and Location of Field</a></li>
<li><a href="#sec-19-3-2">18.3.2. Moving the field</a></li>
<li><a href="#sec-19-3-3">18.3.3. Field Justification</a></li>
<li><a href="#sec-19-3-4">18.3.4. Field Display Attributes</a></li>
<li><a href="#sec-19-3-5">18.3.5. Field Option Bits</a></li>
<li><a href="#sec-19-3-6">18.3.6. Field Status</a></li>
<li><a href="#sec-19-3-7">18.3.7. Field User Pointer</a></li>
<li><a href="#sec-19-3-8">18.3.8. Variable-Sized Fields</a></li>
</ul>
</li>
<li><a href="#sec-19-4">18.4. Form Windows</a></li>
<li><a href="#sec-19-5">18.5. Field Validation</a>
<ul>
<li><a href="#sec-19-5-1"><code>TYPE_ALPHA</code></a></li>
<li><a href="#sec-19-5-2"><code>TYPE_ALNUM</code></a></li>
<li><a href="#sec-19-5-3"><code>TYPE_ENUM</code></a></li>
<li><a href="#sec-19-5-4"><code>TYPE_INTEGER</code></a></li>
<li><a href="#sec-19-5-5"><code>TYPE_NUMERIC</code></a></li>
<li><a href="#sec-19-5-6"><code>TYPE_REGEXP</code></a></li>
</ul>
</li>
<li><a href="#sec-19-6">18.6. Form Driver: The work horse of the forms system</a>
<ul>
<li><a href="#sec-19-6-1">18.6.1. Page Navigation Requests</a></li>
<li><a href="#sec-19-6-2">18.6.2. Inter-Field Navigation Requests</a></li>
<li><a href="#sec-19-6-3">18.6.3. Intra-Field Navigation Requests</a></li>
<li><a href="#sec-19-6-4">18.6.4. Scrolling Requests</a></li>
<li><a href="#sec-19-6-5">18.6.5. Editing Requests</a></li>
<li><a href="#sec-19-6-6">18.6.6. Order Requests</a></li>
<li><a href="#sec-19-6-7">18.6.7. Application Commands</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-20">19. Tools and Widget Libraries</a>
<ul>
<li><a href="#sec-20-1">19.1. CDK (Curses Development Kit)</a>
<ul>
<li><a href="#sec-20-1-1">19.1.1. Widget List</a></li>
<li><a href="#sec-20-1-2">19.1.2. Some Attractive Features</a></li>
<li><a href="#sec-20-1-3">19.1.3. Conclusion</a></li>
</ul>
</li>
<li><a href="#sec-20-2">19.2. The dialog</a></li>
<li><a href="#sec-20-3">19.3. Perl Curses Modules CURSES::FORM and CURSES::WIDGETS</a></li>
</ul>
</li>
<li><a href="#sec-21">20. Just For Fun !!!</a>
<ul>
<li><a href="#sec-21-1">20.1. The Game of Life</a></li>
<li><a href="#sec-21-2">20.2. Magic Square</a></li>
<li><a href="#sec-21-3">20.3. Towers of Hanoi</a></li>
<li><a href="#sec-21-4">20.4. Queens Puzzle</a></li>
<li><a href="#sec-21-5">20.5. Shuffle</a></li>
<li><a href="#sec-21-6">20.6. Typing Tutor</a></li>
</ul>
</li>
<li><a href="#sec-22">21. References</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Revision History</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Revision 1.9     2005-06-20   Revised by: ppadala

<p>
The license has been changed to the MIT-style license used by
NCURSES. Note that the programs are also re-licensed under this.
</p>
</li>

<li>Revision 1.8     2005-06-17   Revised by: ppadala

<p>
Lots of updates. Added references and perl examples. Changes to
examples. Many grammatical and stylistic changes to the
content. Changes to NCURSES history.
</p>
</li>

<li>Revision 1.7.1   2002-06-25   Revised by: ppadala

<p>
Added a README file for building and instructions for building
from source.
</p>
</li>

<li>Revision 1.7     2002-06-25   Revised by: ppadala

<p>
Added "Other formats" section and made a lot of fancy changes to
the programs. Inlining of programs is gone.
</p>
</li>

<li>Revision 1.6.1   2002-02-24   Revised by: ppadala

<p>
Removed the old Changelog section, cleaned the makefiles
</p>
</li>

<li>Revision 1.6     2002-02-16   Revised by: ppadala

<p>
Corrected a lot of spelling mistakes, added ACS variables section
</p>
</li>

<li>Revision 1.5     2002-01-05   Revised by: ppadala

<p>
Changed structure to present proper TOC
</p>
</li>

<li>Revision 1.3.1   2001-07-26   Revised by: ppadala

<p>
Corrected maintainers paragraph, Corrected stable release number
</p>
</li>

<li>Revision 1.3     2001-07-24   Revised by: ppadala

<p>
Added copyright notices to main document (LDP license) and
programs (GPL), Corrected <code>printw_example</code>.
</p>
</li>

<li>Revision 1.2     2001-06-05   Revised by: ppadala

<p>
Incorporated ravi's changes. Mainly to introduction, menu, form,
justforfun sections
</p>
</li>

<li>Revision 1.1     2001-05-22   Revised by: ppadala

<p>
Added "a word about window" section, Added <code>scanw_example</code>.
</p>
</li>
</ul>


<div class="italic">
<p>
This document is intended to be an "All in One" guide for
programming with ncurses and its sister libraries. We graduate
from a simple "Hello World" program to more complex form
manipulation. No prior experience in ncurses is assumed. Send
comments to <a href="mailto:ppadala@gmail.com">this address</a>
</p>

</div>
</div>
</div>
