NCURSES-Programming-HOWTO.html

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">1. Introduction</h2>
<div class="outline-text-2" id="text-2">
<p>
In the olden days of teletype terminals, terminals were away from
computers and were connected to them through serial cables. The
terminals could be configured by sending a series of bytes. All the
capabilities (such as moving the cursor to a new location, erasing
part of the screen, scrolling the screen, changing modes etc.) of
terminals could be accessed through these series of bytes. These
control sequences are usually called escape sequences, because they
start with an escape(0x1B) character. Even today, with proper
emulation, we can send escape sequences to the emulator and achieve
the same effect on a terminal window.
</p>

<p>
Suppose you wanted to print a line in color. Try typing this on your
console.
</p>

<div class="org-src-container">

<pre class="src src-sh">echo "^[[0;31;40mIn Color"
</pre>
</div>

<p>
The first character is an escape character, which looks like two
characters <code>^</code> and <code>[</code>. To be able to print it, you have to press
CTRL+V and then the ESC key. All the others are normal printable
characters.  You should be able to see the string "In Color" in
red. It stays that way and to revert back to the original mode type
this.
</p>

<div class="org-src-container">

<pre class="src src-sh">echo "^[[0;37;40m"
</pre>
</div>

<p>
Now, what do these magic characters mean? Difficult to comprehend?
They might even be different for different terminals. So the
designers of UNIX invented a mechanism named <code>termcap</code>. It is a file
that lists all the capabilities of a particular terminal, along with
the escape sequences needed to achieve a particular effect. In the
later years, this was replaced by <code>terminfo</code>. Without delving too
much into details, this mechanism allows application programs to
query the terminfo database and obtain the control characters to be
sent to a terminal or terminal emulator.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">1.1. What is NCURSES?</h3>
<div class="outline-text-3" id="text-2-1">
<p>
You might be wondering, what the import of all this technical
gibberish is. In the above scenario, every application program is
supposed to query the terminfo and perform the necessary stuff
(sending control characters etc.). It soon became difficult to
manage this complexity and this gave birth to 'CURSES'. Curses is a
pun on the name "cursor optimization". The Curses library forms a
wrapper over working with raw terminal codes, and provides highly
flexible and efficient API (Application Programming Interface). It
provides functions to move the cursor, create windows, produce
colors, play with mouse etc. The application programs need not
worry about the underlying terminal capabilities.
</p>

<p>
So what is NCURSES? NCURSES is a clone of the original System V
Release 4.0 (SVr4) curses. It is a freely distributable library,
fully compatible with older version of curses. In short, it is a
library of functions that manages an application's display on
character-cell terminals. In the remainder of the document, the
terms curses and ncurses are used interchangeably.
</p>

<p>
A detailed history of NCURSES can be found in the NEWS file from
the source distribution. The current package is maintained by
<a href="mailto:dickey@his.com">Thomas Dickey</a>. You can contact the maintainers at
<a href="mailto:bug-ncurses@gnu.org">bug-ncurses@gnu.org</a>.
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">1.2. What we can do with NCURSES</h3>
<div class="outline-text-3" id="text-2-2">
<p>
NCURSES not only creates a wrapper over terminal capabilities, but
also gives a robust framework to create nice looking UI (User
Interface)s in text mode. It provides functions to create windows
etc. Its sister libraries panel, menu and form provide an extension
to the basic curses library. These libraries usually come along
with curses. One can create applications that contain multiple
windows, menus, panels and forms.  Windows can be managed
independently, can provide 'scrollability' and even can be hidden.
</p>

<p>
Menus provide the user with an easy command selection option. Forms
allow the creation of easy-to-use data entry and display
windows. Panels extend the capabilities of ncurses to deal with
overlapping and stacked windows.
</p>

<p>
These are just some of the basic things we can do with ncurses. As
we move along, We will see all the capabilities of these libraries.
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">1.3. Where to get it</h3>
<div class="outline-text-3" id="text-2-3">
<p>
All right, now that you know what you can do with ncurses, you must
be rearing to get started. NCURSES is usually shipped with your
installation. In case you don't have the library or want to compile
it on your own, read on.
</p>
</div>

<div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><i>Compiling the package</i></h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
NCURSES can be obtained from
<a href="ftp://ftp.gnu.org/pub/gnu/ncurses/ncurses.tar.gz">ftp://ftp.gnu.org/pub/gnu/ncurses/ncurses.tar.gz</a> or any of the ftp
sites mentioned in <a href="http://www.gnu.org/order/ftp.html">http://www.gnu.org/order/ftp.html</a>.
</p>

<p>
Read the README and INSTALL files for details on to how to install
it.  It usually involves the following operations.
</p>

<div class="org-src-container">

<pre class="src src-sh">tar zxvf ncurses&lt;version&gt;.tar.gz  # unzip and untar the archive
cd ncurses&lt;version&gt;               # cd to the directory
./configure                             # configure the build according to your
                                        # environment
make                                    # make it
su root                                 # become root
make install                            # install it
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><i>Using the RPM</i></h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
NCURSES RPM can be found and downloaded from <a href="http://rpmfind.net">http://rpmfind.net</a>.
The RPM can be installed with the following command after becoming
root.
</p>

<div class="org-src-container">

<pre class="src src-sh">rpm -i &lt;downloaded rpm&gt;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4">1.4. Purpose/Scope of the document</h3>
<div class="outline-text-3" id="text-2-4">
<p>
This document is intended to be a "All in One" guide for
programming with ncurses and its sister libraries. We graduate from
a simple "Hello World" program to more complex form
manipulation. No prior experience in ncurses is assumed. The
writing is informal, but a lot of detail is provided for each of
the examples.
</p>
</div>
</div>
