NCURSES-Programming-HOWTO.org
** 1.5. About the Programs

   All the programs in the document are available in zipped form [[http://www.tldp.org/HOWTO/NCURSES-Programming-HOWTO/ncurses_programs.tar.gz][here]].
   Unzip and untar it. The directory structure looks like this.

   #+BEGIN_BLOCK
     [[file:ncurses_programs/][ncurses]]
        ┬
        ├────> [[file:ncurses_programs/JustForFun][JustForFun]]     – just for fun programs
        ├────> [[file:ncurses_programs/basics][basics]]         – basic programs
        ├────> [[file:ncurses_programs/demo][demo]]           – output files go into this directory after make
        │        ┬
        │        └──────> [[file:ncurses_programs/demo/exe][exe]] – exe files of all example programs
        ├────> [[file:ncurses_programs/forms][forms]]          – programs related to form library
        ├────> [[file:ncurses_programs/menus][menus]]          – programs related to menus library
        ├────> [[file:ncurses_programs/panels][panels]]         – programs related to panels library
        ├────> [[file:ncurses_programs/perl][perl]]           – perl equivalents of the examples (contributed
        │                            by Anuradha Ratnaweera)
        ├────> [[file:ncurses_programs/Makefile][Makefile]]       – the top level Makefile
        ├────> [[file:ncurses_programs/README][README]]         – the top level README file. contains instructions
        └────> [[file:ncurses_programs/COPYING][COPYING]]        – copyright notice
   #+END_BLOCK

   The individual directories contain the following files.

   #+BEGIN_BLOCK
     Description of files in each directory
     ––––––––––––––––––––––––––––––––––––––
     [[file:ncurses_programs/JustForFun][JustForFun]]
         ┬
         ├────> [[file:ncurses_programs/JustForFun/hanoi.c][=hanoi.c=]]   – The Towers of Hanoi Solver
         ├────> [[file:ncurses_programs/JustForFun/life.c][=life.c=]]    – The Game of Life demo
         ├────> [[file:ncurses_programs/JustForFun/magic.c][=magic.c=]]   – An Odd Order Magic Square builder
         ├────> [[file:ncurses_programs/JustForFun/queens.c][=queens.c=]]  – The famous N-Queens Solver
         ├────> [[file:ncurses_programs/JustForFun/shuffle.c][=shuffle.c=]] – A fun game, if you have time to kill
         └────> [[file:ncurses_programs/JustForFun/tt.c][=tt.c=]]      – A very trivial typing tutor

       [[file:ncurses_programs/basics][basics]]
         ┬
         ├────> [[file:ncurses_programs/basics/acs_vars.c][=acs_vars.c=]]            – ACS_ variables example
         ├────> [[file:ncurses_programs/basics/hello_world.c][=hello_world.c=]]         – Simple "Hello World" Program
         ├────> [[file:ncurses_programs/basics/init_func_example.c][=init_func_example.c=]]   – Initialization functions example
         ├────> [[file:ncurses_programs/basics/key_code.c][=key_code.c=]]            – Shows the scan code of the key pressed
         ├────> [[file:ncurses_programs/basics/mouse_menu.c][=mouse_menu.c=]]          – A menu accessible by mouse
         ├────> [[file:ncurses_programs/basics/other_border.c][=other_border.c=]]        – Shows usage of other border functions apa
         │                                 – rt from box()
         ├────> [[file:ncurses_programs/basics/printw_example.c][=printw_example.c=]]      – A very simple printw() example
         ├────> [[file:ncurses_programs/basics/scanw_example.c][=scanw_example.c=]]       – A very simple getstr() example
         ├────> [[file:ncurses_programs/basics/simple_attr.c][=simple_attr.c=]]         – A program that can print a c file with
         │                                 – comments in attribute
         ├────> [[file:ncurses_programs/basics/simple_color.c][=simple_color.c=]]        – A simple example demonstrating colors
         ├────> [[file:ncurses_programs/basics/simple_key.c][=simple_key.c=]]          – A menu accessible with keyboard UP, DOWN
         │                                 – arrows
         ├────> [[file:ncurses_programs/basics/temp_leave.c][=temp_leave.c=]]          – Demonstrates temporarily leaving curses mode
         ├────> [[file:ncurses_programs/basics/win_border.c][=win_border.c=]]          – Shows Creation of windows and borders
         └────> [[file:ncurses_programs/basics/with_chgat.c][=with_chgat.c=]]          – chgat() usage example

       [[file:ncurses_programs/forms][forms]]
         ┬
         ├────> [[file:ncurses_programs/forms/form_attrib.c][=form_attrib.c=]]     – Usage of field attributes
         ├────> [[file:ncurses_programs/forms/form_options.c][=form_options.c=]]    – Usage of field options
         ├────> [[file:ncurses_programs/forms/form_simple.c][=form_simple.c=]]     – A simple form example
         └────> [[file:ncurses_programs/forms/form_win.c][=form_win.c=]]        – Demo of windows associated with forms

       [[file:ncurses_programs/menus][menus]]
         ┬
         ├────> [[file:ncurses_programs/menus/menu_attrib.c][=menu_attrib.c=]]     – Usage of menu attributes
         ├────> [[file:ncurses_programs/menus/menu_item_data.c][=menu_item_data.c=]]  – Usage of =item_name()= etc.. functions
         ├────> [[file:ncurses_programs/menus/menu_multi_column.c][=menu_multi_column.c=]]    – Creates multi columnar menus
         ├────> [[file:ncurses_programs/menus/menu_scroll.c][=menu_scroll.c=]]     – Demonstrates scrolling capability of menus
         ├────> [[file:ncurses_programs/menus/menu_simple.c][=menu_simple.c=]]     – A simple menu accessed by arrow keys
         ├────> [[file:ncurses_programs/menus/menu_toggle.c][=menu_toggle.c=]]     – Creates multi valued menus and explains
         │                               – =REQ_TOGGLE_ITEM=
         ├────> [[file:ncurses_programs/menus/menu_userptr.c][=menu_userptr.c=]]    – Usage of user pointer
         └────> [[file:ncurses_programs/menus/menu_win.c][=menu_win.c=]]        – Demo of windows associated with menus

       [[file:ncurses_programs/panels][panels]]
         ┬
         ├────> [[file:ncurses_programs/panels/panel_browse.c][=panel_browse.c=]]    – Panel browsing through tab. Usage of user
         │                             – pointer
         ├────> [[file:ncurses_programs/panels/panel_hide.c][=panel_hide.c=]]      – Hiding and Un hiding of panels
         ├────> [[file:ncurses_programs/panels/panel_resize.c][=panel_resize.c=]]    – Moving and resizing of panels
         └────> [[file:ncurses_programs/panels/panel_simple.c][=panel_simple.c=]]    – A simple panel example

       [[file:ncurses_programs/perl][perl]]
         ┬
         └────> [[file:ncurses_programs/perl/][=01-10.pl=]]          – Perl equivalents of first ten example programs
   #+END_BLOCK

   There is a top level Makefile included in the main directory. It
   builds all the files and puts the ready-to-use exes in [[file:ncurses_programs/demo/exe][demo/exe]]
   directory. You can also do selective make by going into the
   corresponding directory.  Each directory contains a README file
   explaining the purpose of each c file in the directory.

   For every example, I have included path name for the file relative
   to the examples directory.

   If you prefer browsing individual programs, point your browser to
   [[http://tldp.org/HOWTO/NCURSES-Programming-HOWTO/ncurses_programs/]]

   All the programs are released under the same license that is used
   by ncurses (MIT-style). This gives you the ability to do pretty
   much anything other than claiming them as yours. Feel free to use
   them in your programs as appropriate.

