NCURSES-Programming-HOWTO.html

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5">1.5. About the Programs</h3>
<div class="outline-text-3" id="text-2-5">
<p>
All the programs in the document are available in zipped form <a href="http://www.tldp.org/HOWTO/NCURSES-Programming-HOWTO/ncurses_programs.tar.gz">here</a>.
Unzip and untar it. The directory structure looks like this.
</p>

<div class="block">
<p>
<a href="ncurses_programs/">ncurses</a>
   ┬
   ├────&gt; <a href="ncurses_programs/JustForFun">JustForFun</a>     – just for fun programs
   ├────&gt; <a href="ncurses_programs/basics">basics</a>         – basic programs
   ├────&gt; <a href="ncurses_programs/demo">demo</a>           – output files go into this directory after make
   │        ┬
   │        └──────&gt; <a href="ncurses_programs/demo/exe">exe</a> – exe files of all example programs
   ├────&gt; <a href="ncurses_programs/forms">forms</a>          – programs related to form library
   ├────&gt; <a href="ncurses_programs/menus">menus</a>          – programs related to menus library
   ├────&gt; <a href="ncurses_programs/panels">panels</a>         – programs related to panels library
   ├────&gt; <a href="ncurses_programs/perl">perl</a>           – perl equivalents of the examples (contributed
   │                            by Anuradha Ratnaweera)
   ├────&gt; <a href="ncurses_programs/Makefile">Makefile</a>       – the top level Makefile
   ├────&gt; <a href="ncurses_programs/README">README</a>         – the top level README file. contains instructions
   └────&gt; <a href="ncurses_programs/COPYING">COPYING</a>        – copyright notice
</p>

</div>

<p>
The individual directories contain the following files.
</p>

<div class="block">
<p>
Description of files in each directory
––––––––––––––––––––––––––––––––––––––
<a href="ncurses_programs/JustForFun">JustForFun</a>
    ┬
    ├────&gt; <a href="ncurses_programs/JustForFun/hanoi.c"><code>hanoi.c</code></a>   – The Towers of Hanoi Solver
    ├────&gt; <a href="ncurses_programs/JustForFun/life.c"><code>life.c</code></a>    – The Game of Life demo
    ├────&gt; <a href="ncurses_programs/JustForFun/magic.c"><code>magic.c</code></a>   – An Odd Order Magic Square builder
    ├────&gt; <a href="ncurses_programs/JustForFun/queens.c"><code>queens.c</code></a>  – The famous N-Queens Solver
    ├────&gt; <a href="ncurses_programs/JustForFun/shuffle.c"><code>shuffle.c</code></a> – A fun game, if you have time to kill
    └────&gt; <a href="ncurses_programs/JustForFun/tt.c"><code>tt.c</code></a>      – A very trivial typing tutor
</p>

<p>
<a href="ncurses_programs/basics">basics</a>
  ┬
  ├────&gt; <a href="ncurses_programs/basics/acs_vars.c"><code>acs_vars.c</code></a>            – ACS_ variables example
  ├────&gt; <a href="ncurses_programs/basics/hello_world.c"><code>hello_world.c</code></a>         – Simple "Hello World" Program
  ├────&gt; <a href="ncurses_programs/basics/init_func_example.c"><code>init_func_example.c</code></a>   – Initialization functions example
  ├────&gt; <a href="ncurses_programs/basics/key_code.c"><code>key_code.c</code></a>            – Shows the scan code of the key pressed
  ├────&gt; <a href="ncurses_programs/basics/mouse_menu.c"><code>mouse_menu.c</code></a>          – A menu accessible by mouse
  ├────&gt; <a href="ncurses_programs/basics/other_border.c"><code>other_border.c</code></a>        – Shows usage of other border functions apa
  │                                 – rt from box()
  ├────&gt; <a href="ncurses_programs/basics/printw_example.c"><code>printw_example.c</code></a>      – A very simple printw() example
  ├────&gt; <a href="ncurses_programs/basics/scanw_example.c"><code>scanw_example.c</code></a>       – A very simple getstr() example
  ├────&gt; <a href="ncurses_programs/basics/simple_attr.c"><code>simple_attr.c</code></a>         – A program that can print a c file with
  │                                 – comments in attribute
  ├────&gt; <a href="ncurses_programs/basics/simple_color.c"><code>simple_color.c</code></a>        – A simple example demonstrating colors
  ├────&gt; <a href="ncurses_programs/basics/simple_key.c"><code>simple_key.c</code></a>          – A menu accessible with keyboard UP, DOWN
  │                                 – arrows
  ├────&gt; <a href="ncurses_programs/basics/temp_leave.c"><code>temp_leave.c</code></a>          – Demonstrates temporarily leaving curses mode
  ├────&gt; <a href="ncurses_programs/basics/win_border.c"><code>win_border.c</code></a>          – Shows Creation of windows and borders
  └────&gt; <a href="ncurses_programs/basics/with_chgat.c"><code>with_chgat.c</code></a>          – chgat() usage example
</p>

<p>
<a href="ncurses_programs/forms">forms</a>
  ┬
  ├────&gt; <a href="ncurses_programs/forms/form_attrib.c"><code>form_attrib.c</code></a>     – Usage of field attributes
  ├────&gt; <a href="ncurses_programs/forms/form_options.c"><code>form_options.c</code></a>    – Usage of field options
  ├────&gt; <a href="ncurses_programs/forms/form_simple.c"><code>form_simple.c</code></a>     – A simple form example
  └────&gt; <a href="ncurses_programs/forms/form_win.c"><code>form_win.c</code></a>        – Demo of windows associated with forms
</p>

<p>
<a href="ncurses_programs/menus">menus</a>
  ┬
  ├────&gt; <a href="ncurses_programs/menus/menu_attrib.c"><code>menu_attrib.c</code></a>     – Usage of menu attributes
  ├────&gt; <a href="ncurses_programs/menus/menu_item_data.c"><code>menu_item_data.c</code></a>  – Usage of <code>item_name()</code> etc.. functions
  ├────&gt; <a href="ncurses_programs/menus/menu_multi_column.c"><code>menu_multi_column.c</code></a>    – Creates multi columnar menus
  ├────&gt; <a href="ncurses_programs/menus/menu_scroll.c"><code>menu_scroll.c</code></a>     – Demonstrates scrolling capability of menus
  ├────&gt; <a href="ncurses_programs/menus/menu_simple.c"><code>menu_simple.c</code></a>     – A simple menu accessed by arrow keys
  ├────&gt; <a href="ncurses_programs/menus/menu_toggle.c"><code>menu_toggle.c</code></a>     – Creates multi valued menus and explains
  │                               – <code>REQ_TOGGLE_ITEM</code>
  ├────&gt; <a href="ncurses_programs/menus/menu_userptr.c"><code>menu_userptr.c</code></a>    – Usage of user pointer
  └────&gt; <a href="ncurses_programs/menus/menu_win.c"><code>menu_win.c</code></a>        – Demo of windows associated with menus
</p>

<p>
<a href="ncurses_programs/panels">panels</a>
  ┬
  ├────&gt; <a href="ncurses_programs/panels/panel_browse.c"><code>panel_browse.c</code></a>    – Panel browsing through tab. Usage of user
  │                             – pointer
  ├────&gt; <a href="ncurses_programs/panels/panel_hide.c"><code>panel_hide.c</code></a>      – Hiding and Un hiding of panels
  ├────&gt; <a href="ncurses_programs/panels/panel_resize.c"><code>panel_resize.c</code></a>    – Moving and resizing of panels
  └────&gt; <a href="ncurses_programs/panels/panel_simple.c"><code>panel_simple.c</code></a>    – A simple panel example
</p>

<p>
<a href="ncurses_programs/perl">perl</a>
  ┬
  └────&gt; <a href="ncurses_programs/perl/"><code>01-10.pl</code></a>          – Perl equivalents of first ten example programs
</p>

</div>

<p>
There is a top level Makefile included in the main directory. It
builds all the files and puts the ready-to-use exes in <a href="ncurses_programs/demo/exe">demo/exe</a>
directory. You can also do selective make by going into the
corresponding directory.  Each directory contains a README file
explaining the purpose of each c file in the directory.
</p>

<p>
For every example, I have included path name for the file relative
to the examples directory.
</p>

<p>
If you prefer browsing individual programs, point your browser to
<a href="http://tldp.org/HOWTO/NCURSES-Programming-HOWTO/ncurses_programs/">http://tldp.org/HOWTO/NCURSES-Programming-HOWTO/ncurses_programs/</a>
</p>

<p>
All the programs are released under the same license that is used
by ncurses (MIT-style). This gives you the ability to do pretty
much anything other than claiming them as yours. Feel free to use
them in your programs as appropriate.
</p>
</div>
</div>
