NCURSES-Programming-HOWTO.org
** 1.6. Other Formats of the document

   This howto is also availabe in various other formats on the
   tldp.org site. Here are the links to other formats of this
   document.

*** 1.6.1. Readily available formats from tldp.org

    - [[http://www.ibiblio.org/pub/Linux/docs/HOWTO/other-formats/pdf/NCURSES-Programming-HOWTO.pdf][Acrobat PDF Format]]

    - [[http:/www.ibiblio.org/pub/Linux/docs/HOWTO/other-formats/ps/NCURSES-Programming-HOWTO.ps.gz][PostScript Format]]

    - [[http://www.ibiblio.org/pub/Linux/docs/HOWTO/other-formats/html/NCURSES-Programming-HOWTO-html.tar.gz][In Multiple HTML pages]]

    - [[http://www.ibiblio.org/pub/Linux/docs/HOWTO/other-formats/html_single/NCURSES-Programming-HOWTO.html][In One big HTML format]]

*** 1.6.2. Building from source

    If above links are broken or if you want to experiment with sgml
    read on.

    - Get both the source and the tar,gzipped programs, available at

      http://cvsview.tldp.org/index.cgi/LDP/howto/docbook/NCURSES-HOWTO/NCURSES-Programming-HOWTO.sgml

      http://cvsview.tldp.org/index.cgi/LDP/howto/docbook/NCURSES-HOWTO/ncurses_programs.tar.gz

    - Unzip =ncurses_programs.tar.gz= with

      #+BEGIN_SRC sh
        tar zxvf ncurses_programs.tar.gz
      #+END_SRC

    - Use jade to create various formats. For example if you just want
      to create the multiple html files, you would use

      #+BEGIN_SRC sh
        jade -t sgml -i html -d <path to docbook html stylesheet> NCURSES-Programming-HOWTO.sgml
      #+END_SRC

    - to get pdf, first create a single html file of the HOWTO with

      #+BEGIN_SRC sh
        jade -t sgml -i html -d <path to docbook html stylesheet> -V nochunks NCURSES-Programming-HOWTO.sgml > NCURSES-ONE-BIG-FILE.html
      #+END_SRC

    - then use htmldoc to get pdf file with

      #+BEGIN_SRC sh
        htmldoc --size universal -t pdf --firstpage p1 -f <output file name.pdf> NCURSES-ONE-BIG-FILE.html
      #+END_SRC

    - for ps, you would use

      #+BEGIN_SRC sh
        htmldoc --size universal -t ps --firstpage p1 -f <output file name.ps> NCURSES-ONE-BIG-FILE.html
      #+END_SRC


    See [[http://www.tldp.org/LDP/LDP-Author-Guide/][LDP Author guide]] for more details. If all else failes, mail me
    at [[mailto:ppadala@gmail.com][ppadala@gmail.com]]

** 1.7. Credits

   I thank [[mailto:sharath_1@usa.net][Sharath]] and Emre Akbas for helping me with few sections.
   The introduction was initially written by sharath.  I rewrote it
   with few excerpts taken from his initial work. Emre helped in
   writing printw and scanw sections.

   Perl equivalents of the example programs are contributed by
   [[mailto:Aratnaweera@virtusa.com][Anuradha Ratnaweera]].

   Then comes [[mailto:parimi@ece.arizona.edu][Ravi Parimi]], my dearest friend, who has been on this
   project before even one line was written.  He constantly bombarded
   me with suggestions and patiently reviewed the whole text. He also
   checked each program on Linux and Solaris.

** 1.8. Wish List

   This is the wish list, in the order of priority. If you have a wish
   or you want to work on completing the wish, mail [[mailto:ppadala@gmail.com][me]].

   - Add examples to last parts of forms section.

   - Prepare a Demo showing all the programs and allow the user to
     browse through description of each program. Let the user compile
     and see the program in action. A dialog based interface is
     preferred.

   - Add debug info. =_tracef=, =_tracemouse= stuff.

   - Working on two terminals simultaneously.

   - Add more stuff to miscellaneous section.

** 1.9. Copyright

   Copyright © 2001 by Pradeep Padala.

   Permission is hereby granted, free of charge, to any person
   obtaining a copy of this software and associated documentation
   files (the "Software"), to deal in the Software without
   restriction, including without limitation the rights to use, copy,
   modify, merge, publish, distribute, distribute with modifications,
   sublicense, and/or sell copies of the Software, and to permit
   persons to whom the Software is furnished to do so, subject to the
   following conditions:

   The above copyright notice and this permission notice shall be
   included in all copies or substantial portions of the Software.

   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
   NONINFRINGEMENT.  IN NO EVENT SHALL THE ABOVE COPYRIGHT HOLDERS BE
   LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
   SOFTWARE.

   Except as contained in this notice, the name(s) of the above
   copyright holders shall not be used in advertising or otherwise to
   promote the sale, use or other dealings in this Software without
   prior written authorization.

* 2. Hello World !!!

  Welcome to the world of curses. Before we plunge into the library
  and look into its various features, let's write a simple program and
  say hello to the world.

** 2.1. Compiling With the NCURSES Library

   To use ncurses library functions, you have to include ncurses.h in
   your programs. To link the program with ncurses the flag -lncurses
   should be added.

   #+BEGIN_EXAMPLE
     #include <ncurses.h>
     .
     .
     .

     compile and link: gcc <program file> -lncurses
   #+END_EXAMPLE

   [[file:ncurses_programs/basics/hello_world.c][*Example 1. The Hello World !!! Program*]]

   #+BEGIN_SRC c
     #include <ncurses.h>

     int main()
     {
       initscr();                      /* Start curses mode              */
       printw("Hello World !!!");      /* Print Hello World              */
       refresh();                      /* Print it on to the real screen */
       getch();                        /* Wait for user input            */
       endwin();                       /* End curses mode                */

       return 0;
     }
   #+END_SRC

** 2.2. Dissection

   The above program prints "Hello World !!!" to the screen and
   exits. This program shows how to initialize curses and do screen
   manipulation and end curses mode. Let's dissect it line by line.

*** 2.2.1. About initscr()

    The function initscr() initializes the terminal in curses mode. In
    some implementations, it clears the screen and presents a blank
    screen. To do any screen manipulation using curses package this
    has to be called first. This function initializes the curses
    system and allocates memory for our present window (called
    =stdscr=) and some other data-structures.  Under extreme cases
    this function might fail due to insufficient memory to allocate
    memory for curses library's data structures.

    After this is done, we can do a variety of initializations to
    customize our curses settings. These details will be explained
    [[@INIT][later]].

