NCURSES-Programming-HOWTO.html

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6">1.6. Other Formats of the document</h3>
<div class="outline-text-3" id="text-2-6">
<p>
This howto is also availabe in various other formats on the
tldp.org site. Here are the links to other formats of this
document.
</p>
</div>

<div id="outline-container-sec-2-6-1" class="outline-4">
<h4 id="sec-2-6-1">1.6.1. Readily available formats from tldp.org</h4>
<div class="outline-text-4" id="text-2-6-1">
<ul class="org-ul">
<li><a href="http://www.ibiblio.org/pub/Linux/docs/HOWTO/other-formats/pdf/NCURSES-Programming-HOWTO.pdf">Acrobat PDF Format</a>
</li>

<li><a href="http:/www.ibiblio.org/pub/Linux/docs/HOWTO/other-formats/ps/NCURSES-Programming-HOWTO.ps.gz">PostScript Format</a>
</li>

<li><a href="http://www.ibiblio.org/pub/Linux/docs/HOWTO/other-formats/html/NCURSES-Programming-HOWTO-html.tar.gz">In Multiple HTML pages</a>
</li>

<li><a href="http://www.ibiblio.org/pub/Linux/docs/HOWTO/other-formats/html_single/NCURSES-Programming-HOWTO.html">In One big HTML format</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-6-2" class="outline-4">
<h4 id="sec-2-6-2">1.6.2. Building from source</h4>
<div class="outline-text-4" id="text-2-6-2">
<p>
If above links are broken or if you want to experiment with sgml
read on.
</p>

<ul class="org-ul">
<li>Get both the source and the tar,gzipped programs, available at

<p>
<a href="http://cvsview.tldp.org/index.cgi/LDP/howto/docbook/NCURSES-HOWTO/NCURSES-Programming-HOWTO.sgml">http://cvsview.tldp.org/index.cgi/LDP/howto/docbook/NCURSES-HOWTO/NCURSES-Programming-HOWTO.sgml</a>
</p>

<p>
<a href="http://cvsview.tldp.org/index.cgi/LDP/howto/docbook/NCURSES-HOWTO/ncurses_programs.tar.gz">http://cvsview.tldp.org/index.cgi/LDP/howto/docbook/NCURSES-HOWTO/ncurses_programs.tar.gz</a>
</p>
</li>

<li>Unzip <code>ncurses_programs.tar.gz</code> with

<div class="org-src-container">

<pre class="src src-sh">tar zxvf ncurses_programs.tar.gz
</pre>
</div>
</li>

<li>Use jade to create various formats. For example if you just want
to create the multiple html files, you would use

<div class="org-src-container">

<pre class="src src-sh">jade -t sgml -i html -d &lt;path to docbook html stylesheet&gt; NCURSES-Programming-HOWTO.sgml
</pre>
</div>
</li>

<li>to get pdf, first create a single html file of the HOWTO with

<div class="org-src-container">

<pre class="src src-sh">jade -t sgml -i html -d &lt;path to docbook html stylesheet&gt; -V nochunks NCURSES-Programming-HOWTO.sgml &gt; NCURSES-ONE-BIG-FILE.html
</pre>
</div>
</li>

<li>then use htmldoc to get pdf file with

<div class="org-src-container">

<pre class="src src-sh">htmldoc --size universal -t pdf --firstpage p1 -f &lt;output file name.pdf&gt; NCURSES-ONE-BIG-FILE.html
</pre>
</div>
</li>

<li>for ps, you would use

<div class="org-src-container">

<pre class="src src-sh">htmldoc --size universal -t ps --firstpage p1 -f &lt;output file name.ps&gt; NCURSES-ONE-BIG-FILE.html
</pre>
</div>
</li>
</ul>


<p>
See <a href="http://www.tldp.org/LDP/LDP-Author-Guide/">LDP Author guide</a> for more details. If all else failes, mail me
at <a href="mailto:ppadala@gmail.com">ppadala@gmail.com</a>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7">1.7. Credits</h3>
<div class="outline-text-3" id="text-2-7">
<p>
I thank <a href="mailto:sharath_1@usa.net">Sharath</a> and Emre Akbas for helping me with few sections.
The introduction was initially written by sharath.  I rewrote it
with few excerpts taken from his initial work. Emre helped in
writing printw and scanw sections.
</p>

<p>
Perl equivalents of the example programs are contributed by
<a href="mailto:Aratnaweera@virtusa.com">Anuradha Ratnaweera</a>.
</p>

<p>
Then comes <a href="mailto:parimi@ece.arizona.edu">Ravi Parimi</a>, my dearest friend, who has been on this
project before even one line was written.  He constantly bombarded
me with suggestions and patiently reviewed the whole text. He also
checked each program on Linux and Solaris.
</p>
</div>
</div>

<div id="outline-container-sec-2-8" class="outline-3">
<h3 id="sec-2-8">1.8. Wish List</h3>
<div class="outline-text-3" id="text-2-8">
<p>
This is the wish list, in the order of priority. If you have a wish
or you want to work on completing the wish, mail <a href="mailto:ppadala@gmail.com">me</a>.
</p>

<ul class="org-ul">
<li>Add examples to last parts of forms section.
</li>

<li>Prepare a Demo showing all the programs and allow the user to
browse through description of each program. Let the user compile
and see the program in action. A dialog based interface is
preferred.
</li>

<li>Add debug info. <code>_tracef</code>, <code>_tracemouse</code> stuff.
</li>

<li>Working on two terminals simultaneously.
</li>

<li>Add more stuff to miscellaneous section.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-9" class="outline-3">
<h3 id="sec-2-9">1.9. Copyright</h3>
<div class="outline-text-3" id="text-2-9">
<p>
Copyright © 2001 by Pradeep Padala.
</p>

<p>
Permission is hereby granted, free of charge, to any person
obtaining a copy of this software and associated documentation
files (the "Software"), to deal in the Software without
restriction, including without limitation the rights to use, copy,
modify, merge, publish, distribute, distribute with modifications,
sublicense, and/or sell copies of the Software, and to permit
persons to whom the Software is furnished to do so, subject to the
following conditions:
</p>

<p>
The above copyright notice and this permission notice shall be
included in all copies or substantial portions of the Software.
</p>

<p>
THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
NONINFRINGEMENT.  IN NO EVENT SHALL THE ABOVE COPYRIGHT HOLDERS BE
LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.
</p>

<p>
Except as contained in this notice, the name(s) of the above
copyright holders shall not be used in advertising or otherwise to
promote the sale, use or other dealings in this Software without
prior written authorization.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">2. Hello World !!!</h2>
<div class="outline-text-2" id="text-3">
<p>
Welcome to the world of curses. Before we plunge into the library
and look into its various features, let's write a simple program and
say hello to the world.
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">2.1. Compiling With the NCURSES Library</h3>
<div class="outline-text-3" id="text-3-1">
<p>
To use ncurses library functions, you have to include ncurses.h in
your programs. To link the program with ncurses the flag -lncurses
should be added.
</p>

<pre class="example">
#include &lt;ncurses.h&gt;
.
.
.

compile and link: gcc &lt;program file&gt; -lncurses
</pre>

<p>
<a href="ncurses_programs/basics/hello_world.c"><b>Example 1. The Hello World !!! Program</b></a>
</p>

<div class="org-src-container">

<pre class="src src-c">#include &lt;ncurses.h&gt;

int main()
{
  initscr();                      /* Start curses mode              */
  printw("Hello World !!!");      /* Print Hello World              */
  refresh();                      /* Print it on to the real screen */
  getch();                        /* Wait for user input            */
  endwin();                       /* End curses mode                */

  return 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">2.2. Dissection</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The above program prints "Hello World !!!" to the screen and
exits. This program shows how to initialize curses and do screen
manipulation and end curses mode. Let's dissect it line by line.
</p>
</div>

<div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1">2.2.1. About initscr()</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
The function initscr() initializes the terminal in curses mode. In
some implementations, it clears the screen and presents a blank
screen. To do any screen manipulation using curses package this
has to be called first. This function initializes the curses
system and allocates memory for our present window (called
<code>stdscr</code>) and some other data-structures.  Under extreme cases
this function might fail due to insufficient memory to allocate
memory for curses library's data structures.
</p>

<p>
After this is done, we can do a variety of initializations to
customize our curses settings. These details will be explained
<a href="#INIT">later</a>.
</p>
</div>
</div>
