NCURSES-Programming-HOWTO.org
*** 2.2.2. The mysterious refresh()

    The next line =printw= prints the string "Hello World !!!" on to
    the screen. This function is analogous to normal =printf= in all
    respects except that it prints the data on a window called
    =stdscr= at the current (y,x) co-ordinates. Since our present
    co-ordinates are at 0,0 the string is printed at the left hand
    corner of the window.

    This brings us to that mysterious =refresh()=. Well, when we
    called =printw= the data is actually written to an imaginary
    window, which is not updated on the screen yet. The job of
    =printw= is to update a few flags and data structures and write
    the data to a buffer corresponding to =stdscr=. In order to show
    it on the screen, we need to call =refresh()= and tell the curses
    system to dump the contents on the screen.

    The philosophy behind all this is to allow the programmer to do
    multiple updates on the imaginary screen or windows and do a
    refresh once all his screen update is done. =refresh()= checks the
    window and updates only the portion which has been changed. This
    improves performance and offers greater flexibility too. But, it
    is sometimes frustrating to beginners.  A common mistake committed
    by beginners is to forget to call =refresh()= after they did some
    update through =printw()= class of functions. I still forget to
    add it sometimes :-)

*** 2.2.3. About endwin()

    And finally don't forget to end the curses mode. Otherwise your
    terminal might behave strangely after the program quits.
    =endwin()= frees the memory taken by curses sub-system and its
    data structures and puts the terminal in normal mode. This
    function must be called after you are done with the curses mode.

* 3. The Gory Details

  Now that we have seen how to write a simple curses program let's get
  into the details. There are many functions that help customize what
  you see on screen and many features which can be put to full use.

  Here we go...

* 4. Initialization                                                   <<@INIT>>

  We now know that to initialize curses system the function
  =initscr()= has to be called. There are functions which can be
  called after this initialization to customize our curses session. We
  may ask the curses system to set the terminal in raw mode or
  initialize color or initialize the mouse etc.. Let's discuss some of
  the functions that are normally called immediately after
  =initscr()=;

** 4.1. Initialization functions
*** 4.1.1. =raw()= and =cbreak()=

    Normally the terminal driver buffers the characters a user types
    until a new line or carriage return is encountered. But most
    programs require that the characters be available as soon as the
    user types them. The above two functions are used to disable line
    buffering. The difference between these two functions is in the
    way control characters like suspend (CTRL-Z), interrupt and quit
    (CTRL-C) are passed to the program.  In the =raw()= mode these
    characters are directly passed to the program without generating a
    signal. In the =cbreak()= mode these control characters are
    interpreted as any other character by the terminal driver. I
    personally prefer to use =raw()= as I can exercise greater control
    over what the user does.

*** 4.1.2. =echo()= and =noecho()=

    These functions control the echoing of characters typed by the
    user to the terminal. =noecho()= switches off echoing. The reason
    you might want to do this is to gain more control over echoing or
    to suppress unnecessary echoing while taking input from the user
    through the =getch()= etc. functions. Most of the interactive
    programs call =noecho()= at initialization and do the echoing of
    characters in a controlled manner.  It gives the programmer the
    flexibility of echoing characters at any place in the window
    without updating current (y,x) co-ordinates.

*** 4.1.3. =keypad()=

    This is my favorite initialization function. It enables the
    reading of function keys like F1, F2, arrow keys etc. Almost every
    interactive program enables this, as arrow keys are a major part
    of any User Interface. Do =keypad(stdscr, TRUE)= to enable this
    feature for the regular screen (stdscr). You will learn more about
    key management in later sections of this document.

*** 4.1.4. =halfdelay()=

    This function, though not used very often, is a useful one at
    times.  =halfdelay()= is called to enable the half-delay mode,
    which is similar to the =cbreak()= mode in that characters typed
    are immediately available to program. However, it waits for 'X'
    tenths of a second for input and then returns =ERR=, if no input
    is available. 'X' is the timeout value passed to the function
    =halfdelay()=. This function is useful when you want to ask the
    user for input, and if he doesn't respond with in certain time, we
    can do some thing else. One possible example is a timeout at the
    password prompt.

** 4.2. Miscellaneous Initialization functions

   There are few more functions which are called at initialization to
   customize curses behavior. They are not used as extensively as
   those mentioned above. Some of them are explained where
   appropriate.

