NCURSES-Programming-HOWTO.html

<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2">2.2.2. The mysterious refresh()</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
The next line <code>printw</code> prints the string "Hello World !!!" on to
the screen. This function is analogous to normal <code>printf</code> in all
respects except that it prints the data on a window called
<code>stdscr</code> at the current (y,x) co-ordinates. Since our present
co-ordinates are at 0,0 the string is printed at the left hand
corner of the window.
</p>

<p>
This brings us to that mysterious <code>refresh()</code>. Well, when we
called <code>printw</code> the data is actually written to an imaginary
window, which is not updated on the screen yet. The job of
<code>printw</code> is to update a few flags and data structures and write
the data to a buffer corresponding to <code>stdscr</code>. In order to show
it on the screen, we need to call <code>refresh()</code> and tell the curses
system to dump the contents on the screen.
</p>

<p>
The philosophy behind all this is to allow the programmer to do
multiple updates on the imaginary screen or windows and do a
refresh once all his screen update is done. <code>refresh()</code> checks the
window and updates only the portion which has been changed. This
improves performance and offers greater flexibility too. But, it
is sometimes frustrating to beginners.  A common mistake committed
by beginners is to forget to call <code>refresh()</code> after they did some
update through <code>printw()</code> class of functions. I still forget to
add it sometimes :-)
</p>
</div>
</div>

<div id="outline-container-sec-3-2-3" class="outline-4">
<h4 id="sec-3-2-3">2.2.3. About endwin()</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
And finally don't forget to end the curses mode. Otherwise your
terminal might behave strangely after the program quits.
<code>endwin()</code> frees the memory taken by curses sub-system and its
data structures and puts the terminal in normal mode. This
function must be called after you are done with the curses mode.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">3. The Gory Details</h2>
<div class="outline-text-2" id="text-4">
<p>
Now that we have seen how to write a simple curses program let's get
into the details. There are many functions that help customize what
you see on screen and many features which can be put to full use.
</p>

<p>
Here we go&#x2026;
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">4. Initialization                                                   <a id="INIT" name="INIT"></a></h2>
<div class="outline-text-2" id="text-5">
<p>
We now know that to initialize curses system the function
<code>initscr()</code> has to be called. There are functions which can be
called after this initialization to customize our curses session. We
may ask the curses system to set the terminal in raw mode or
initialize color or initialize the mouse etc.. Let's discuss some of
the functions that are normally called immediately after
<code>initscr()</code>;
</p>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">4.1. Initialization functions</h3>
<div class="outline-text-3" id="text-5-1">
</div><div id="outline-container-sec-5-1-1" class="outline-4">
<h4 id="sec-5-1-1">4.1.1. <code>raw()</code> and <code>cbreak()</code></h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
Normally the terminal driver buffers the characters a user types
until a new line or carriage return is encountered. But most
programs require that the characters be available as soon as the
user types them. The above two functions are used to disable line
buffering. The difference between these two functions is in the
way control characters like suspend (CTRL-Z), interrupt and quit
(CTRL-C) are passed to the program.  In the <code>raw()</code> mode these
characters are directly passed to the program without generating a
signal. In the <code>cbreak()</code> mode these control characters are
interpreted as any other character by the terminal driver. I
personally prefer to use <code>raw()</code> as I can exercise greater control
over what the user does.
</p>
</div>
</div>

<div id="outline-container-sec-5-1-2" class="outline-4">
<h4 id="sec-5-1-2">4.1.2. <code>echo()</code> and <code>noecho()</code></h4>
<div class="outline-text-4" id="text-5-1-2">
<p>
These functions control the echoing of characters typed by the
user to the terminal. <code>noecho()</code> switches off echoing. The reason
you might want to do this is to gain more control over echoing or
to suppress unnecessary echoing while taking input from the user
through the <code>getch()</code> etc. functions. Most of the interactive
programs call <code>noecho()</code> at initialization and do the echoing of
characters in a controlled manner.  It gives the programmer the
flexibility of echoing characters at any place in the window
without updating current (y,x) co-ordinates.
</p>
</div>
</div>

<div id="outline-container-sec-5-1-3" class="outline-4">
<h4 id="sec-5-1-3">4.1.3. <code>keypad()</code></h4>
<div class="outline-text-4" id="text-5-1-3">
<p>
This is my favorite initialization function. It enables the
reading of function keys like F1, F2, arrow keys etc. Almost every
interactive program enables this, as arrow keys are a major part
of any User Interface. Do <code>keypad(stdscr, TRUE)</code> to enable this
feature for the regular screen (stdscr). You will learn more about
key management in later sections of this document.
</p>
</div>
</div>

<div id="outline-container-sec-5-1-4" class="outline-4">
<h4 id="sec-5-1-4">4.1.4. <code>halfdelay()</code></h4>
<div class="outline-text-4" id="text-5-1-4">
<p>
This function, though not used very often, is a useful one at
times.  <code>halfdelay()</code> is called to enable the half-delay mode,
which is similar to the <code>cbreak()</code> mode in that characters typed
are immediately available to program. However, it waits for 'X'
tenths of a second for input and then returns <code>ERR</code>, if no input
is available. 'X' is the timeout value passed to the function
<code>halfdelay()</code>. This function is useful when you want to ask the
user for input, and if he doesn't respond with in certain time, we
can do some thing else. One possible example is a timeout at the
password prompt.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2">4.2. Miscellaneous Initialization functions</h3>
<div class="outline-text-3" id="text-5-2">
<p>
There are few more functions which are called at initialization to
customize curses behavior. They are not used as extensively as
those mentioned above. Some of them are explained where
appropriate.
</p>
</div>
</div>
