NCURSES-Programming-HOWTO.org
** 4.3. An Example

   Let's write a program which will clarify the usage of these
   functions.

   [[file:ncurses_programs/basics/init_func_example.c][*Example 2. Initialization Function Usage example*]]

   #+BEGIN_SRC c
     #include <ncurses.h>

     int main()
     {   int ch;

       initscr();                      /* Start curses mode                */
       raw();                          /* Line buffering disabled          */
       keypad(stdscr, TRUE);           /* We get F1, F2 etc..              */
       noecho();                       /* Don't echo() while we do getch   */

       printw("Type any character to see it in bold\n");
       ch = getch();                   /* If raw() hadn't been called
                                        * we have to press enter before it
                                        * gets to the program              */
       if(ch == KEY_F(1))              /* Without keypad enabled this will */
         printw("F1 Key pressed");     /*  not get to us either            */
                                       /* Without noecho() some ugly escape
                                        * charachters might have been printed
                                        * on screen                        */
       else
         {   printw("The pressed key is ");
             attron(A_BOLD);
             printw("%c", ch);
             attroff(A_BOLD);
         }
       refresh();                      /* Print it on to the real screen   */
       getch();                        /* Wait for user input              */
       endwin();                       /* End curses mode                  */

       return 0;
     }
   #+END_SRC

   This program is self-explanatory. But I used functions which aren't
   explained yet. The function =getch()= is used to get a character
   from user. It is equivalent to normal =getchar()= except that we
   can disable the line buffering to avoid <enter> after input. Look
   for more about =getch()= and reading keys in the [[@KEYS][key management
   section]]. The functions =attron= and =attroff= are used to switch
   some attributes on and off respectively. In the example I used them
   to print the character in bold. These functions are explained in
   detail later.

* 5. A Word about Windows

  Before we plunge into the myriad ncurses functions, let me clear few
  things about windows. Windows are explained in detail in following
  [[@WINDOWS][sections]]

  A Window is an imaginary screen defined by curses system. A window
  does not mean a bordered window which you usually see on Win9X
  platforms.  When curses is initialized, it creates a default window
  named =stdscr= which represents your 80x25 (or the size of window in
  which you are running) screen. If you are doing simple tasks like
  printing few strings, reading input etc., you can safely use this
  single window for all of your purposes. You can also create windows
  and call functions which explicitly work on the specified window.

  For example, if you call

  #+BEGIN_SRC c
    printw("Hi There !!!");
    refresh();
  #+END_SRC

  It prints the string on =stdscr= at the present cursor position.
  Similarly the call to =refresh()=, works on =stdscr= only.

  Say you have created [[@WINDOWS][windows]] then you have to call a function with a
  'w' added to the usual function.

  #+BEGIN_SRC c
    wprintw(win, "Hi There !!!");
    wrefresh(win);
  #+END_SRC

  As you will see in the rest of the document, naming of functions
  follow the same convention. For each function there usually are
  three more functions.

  #+BEGIN_SRC c
    printw(string);           /* Print on stdscr at present cursor position     */
    mvprintw(y, x, string);   /* Move to (y, x) then print string               */
    wprintw(win, string);     /* Print on window win at present cursor position */
                              /* in the window                                  */
    mvwprintw(win, y, x, string);  /* Move to (y, x) relative to window         */
                                   /* co-ordinates and then print               */
  #+END_SRC

  Usually the w-less functions are macros which expand to
  corresponding w-function with =stdscr= as the window parameter.

* 6. Output functions

  I guess you can't wait any more to see some action. Back to our
  odyssey of curses functions. Now that curses is initialized, let's
  interact with world.

  There are three classes of functions which you can use to do output
  on screen.

  1. =addch()= class: Print single character with attributes

  2. =printw()= class: Print formatted output similar to =printf()=

  3. =addstr()= class: Print strings


  These functions can be used interchangeably and it's a matter of
  style as to which class is used. Let's see each one in detail.

** 6.1. =addch()= class of functions

   These functions put a single character into the current cursor
   location and advance the position of the cursor. You can give the
   character to be printed but they usually are used to print a
   character with some attributes. Attributes are explained in detail
   in later [[@ATTRIB][sections]] of the document. If a character is associated
   with an attribute(bold, reverse video etc.), when curses prints the
   character, it is printed in that attribute.

   In order to combine a character with some attributes, you have two
   options:

   - By OR'ing a single character with the desired attribute
     macros. These attribute macros could be found in the header file
     =ncurses.h=. For example, you want to print a character ch(of
     type char) bold and underlined, you would call =addch()= as
     below.

     #+BEGIN_SRC c
       addch(ch | A_BOLD | A_UNDERLINE);
     #+END_SRC

   - By using functions like =attrset()=, =attron()=, =attroff()=.
     These functions are explained in the [[@ATTRIB][Attributes]] section.
     Briefly, they manipulate the current attributes of the given
     window.  Once set, the character printed in the window are
     associated with the attributes until it is turned off.


   Additionally, =curses= provides some special characters for
   character-based graphics. You can draw tables, horizontal or
   vertical lines, etc. You can find all avaliable characters in the
   header file =ncurses.h=. Try looking for macros beginning with
   =ACS_= in this file.

** 6.2. =mvaddch()=, =waddch()= and =mvwaddch()=

   =mvaddch()= is used to move the cursor to a given point, and then
   print.  Thus, the calls:

   #+BEGIN_SRC c
     move(row,col);    /* moves the cursor to rowth row and colth column */
     addch(ch);
   #+END_SRC

   can be replaced by

   #+BEGIN_SRC c
     mvaddch(row,col,ch);
   #+END_SRC

   =waddch()= is similar to =addch()=, except that it adds a character
   into the given window. (Note that =addch()= adds a character into
   the window =stdscr=.)

   In a similar fashion =mvwaddch()= function is used to add a
   character into the given window at the given coordinates.

   Now, we are familiar with the basic output function =addch()=. But,
   if we want to print a string, it would be very annoying to print it
   character by character. Fortunately, =ncurses= provides
   =printf=-like or =puts=-like functions.

