NCURSES-Programming-HOWTO.html

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3">4.3. An Example</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Let's write a program which will clarify the usage of these
functions.
</p>

<p>
<a href="ncurses_programs/basics/init_func_example.c"><b>Example 2. Initialization Function Usage example</b></a>
</p>

<div class="org-src-container">

<pre class="src src-c">#include &lt;ncurses.h&gt;

int main()
{   int ch;

  initscr();                      /* Start curses mode                */
  raw();                          /* Line buffering disabled          */
  keypad(stdscr, TRUE);           /* We get F1, F2 etc..              */
  noecho();                       /* Don't echo() while we do getch   */

  printw("Type any character to see it in bold\n");
  ch = getch();                   /* If raw() hadn't been called
                                   * we have to press enter before it
                                   * gets to the program              */
  if(ch == KEY_F(1))              /* Without keypad enabled this will */
    printw("F1 Key pressed");     /*  not get to us either            */
                                  /* Without noecho() some ugly escape
                                   * charachters might have been printed
                                   * on screen                        */
  else
    {   printw("The pressed key is ");
        attron(A_BOLD);
        printw("%c", ch);
        attroff(A_BOLD);
    }
  refresh();                      /* Print it on to the real screen   */
  getch();                        /* Wait for user input              */
  endwin();                       /* End curses mode                  */

  return 0;
}
</pre>
</div>

<p>
This program is self-explanatory. But I used functions which aren't
explained yet. The function <code>getch()</code> is used to get a character
from user. It is equivalent to normal <code>getchar()</code> except that we
can disable the line buffering to avoid &lt;enter&gt; after input. Look
for more about <code>getch()</code> and reading keys in the <a href="#KEYS">key management
section</a>. The functions <code>attron</code> and <code>attroff</code> are used to switch
some attributes on and off respectively. In the example I used them
to print the character in bold. These functions are explained in
detail later.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">5. A Word about Windows</h2>
<div class="outline-text-2" id="text-6">
<p>
Before we plunge into the myriad ncurses functions, let me clear few
things about windows. Windows are explained in detail in following
<a href="#WINDOWS">sections</a>
</p>

<p>
A Window is an imaginary screen defined by curses system. A window
does not mean a bordered window which you usually see on Win9X
platforms.  When curses is initialized, it creates a default window
named <code>stdscr</code> which represents your 80x25 (or the size of window in
which you are running) screen. If you are doing simple tasks like
printing few strings, reading input etc., you can safely use this
single window for all of your purposes. You can also create windows
and call functions which explicitly work on the specified window.
</p>

<p>
For example, if you call
</p>

<div class="org-src-container">

<pre class="src src-c">printw("Hi There !!!");
refresh();
</pre>
</div>

<p>
It prints the string on <code>stdscr</code> at the present cursor position.
Similarly the call to <code>refresh()</code>, works on <code>stdscr</code> only.
</p>

<p>
Say you have created <a href="#WINDOWS">windows</a> then you have to call a function with a
'w' added to the usual function.
</p>

<div class="org-src-container">

<pre class="src src-c">wprintw(win, "Hi There !!!");
wrefresh(win);
</pre>
</div>

<p>
As you will see in the rest of the document, naming of functions
follow the same convention. For each function there usually are
three more functions.
</p>

<div class="org-src-container">

<pre class="src src-c">printw(string);           /* Print on stdscr at present cursor position     */
mvprintw(y, x, string);   /* Move to (y, x) then print string               */
wprintw(win, string);     /* Print on window win at present cursor position */
                          /* in the window                                  */
mvwprintw(win, y, x, string);  /* Move to (y, x) relative to window         */
                               /* co-ordinates and then print               */
</pre>
</div>

<p>
Usually the w-less functions are macros which expand to
corresponding w-function with <code>stdscr</code> as the window parameter.
</p>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">6. Output functions</h2>
<div class="outline-text-2" id="text-7">
<p>
I guess you can't wait any more to see some action. Back to our
odyssey of curses functions. Now that curses is initialized, let's
interact with world.
</p>

<p>
There are three classes of functions which you can use to do output
on screen.
</p>

<ol class="org-ol">
<li><code>addch()</code> class: Print single character with attributes
</li>

<li><code>printw()</code> class: Print formatted output similar to <code>printf()</code>
</li>

<li><code>addstr()</code> class: Print strings
</li>
</ol>


<p>
These functions can be used interchangeably and it's a matter of
style as to which class is used. Let's see each one in detail.
</p>
</div>

<div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1">6.1. <code>addch()</code> class of functions</h3>
<div class="outline-text-3" id="text-7-1">
<p>
These functions put a single character into the current cursor
location and advance the position of the cursor. You can give the
character to be printed but they usually are used to print a
character with some attributes. Attributes are explained in detail
in later <a href="#ATTRIB">sections</a> of the document. If a character is associated
with an attribute(bold, reverse video etc.), when curses prints the
character, it is printed in that attribute.
</p>

<p>
In order to combine a character with some attributes, you have two
options:
</p>

<ul class="org-ul">
<li>By OR'ing a single character with the desired attribute
macros. These attribute macros could be found in the header file
<code>ncurses.h</code>. For example, you want to print a character ch(of
type char) bold and underlined, you would call <code>addch()</code> as
below.

<div class="org-src-container">

<pre class="src src-c">addch(ch | A_BOLD | A_UNDERLINE);
</pre>
</div>
</li>

<li>By using functions like <code>attrset()</code>, <code>attron()</code>, <code>attroff()</code>.
These functions are explained in the <a href="#ATTRIB">Attributes</a> section.
Briefly, they manipulate the current attributes of the given
window.  Once set, the character printed in the window are
associated with the attributes until it is turned off.
</li>
</ul>


<p>
Additionally, <code>curses</code> provides some special characters for
character-based graphics. You can draw tables, horizontal or
vertical lines, etc. You can find all avaliable characters in the
header file <code>ncurses.h</code>. Try looking for macros beginning with
<code>ACS_</code> in this file.
</p>
</div>
</div>

<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2">6.2. <code>mvaddch()</code>, <code>waddch()</code> and <code>mvwaddch()</code></h3>
<div class="outline-text-3" id="text-7-2">
<p>
<code>mvaddch()</code> is used to move the cursor to a given point, and then
print.  Thus, the calls:
</p>

<div class="org-src-container">

<pre class="src src-c">move(row,col);    /* moves the cursor to rowth row and colth column */
addch(ch);
</pre>
</div>

<p>
can be replaced by
</p>

<div class="org-src-container">

<pre class="src src-c">mvaddch(row,col,ch);
</pre>
</div>

<p>
<code>waddch()</code> is similar to <code>addch()</code>, except that it adds a character
into the given window. (Note that <code>addch()</code> adds a character into
the window <code>stdscr</code>.)
</p>

<p>
In a similar fashion <code>mvwaddch()</code> function is used to add a
character into the given window at the given coordinates.
</p>

<p>
Now, we are familiar with the basic output function <code>addch()</code>. But,
if we want to print a string, it would be very annoying to print it
character by character. Fortunately, <code>ncurses</code> provides
<code>printf</code>-like or <code>puts</code>-like functions.
</p>
</div>
</div>
