NCURSES-Programming-HOWTO.org
** 6.3. =printw()= class of functions

   These functions are similar to =printf()= with the added capability
   of printing at any position on the screen.

*** 6.3.1. =printw()= and =mvprintw=

    These two functions work much like =printf()=. =mvprintw()= can be
    used to move the cursor to a position and then print. If you want
    to move the cursor first and then print using =printw()= function,
    use =move()= first and then use =printw()= though I see no point
    why one should avoid using =mvprintw()=, you have the flexibility
    to manipulate.

*** 6.3.2. =wprintw()= and =mvwprintw=

    These two functions are similar to above two except that they
    print in the corresponding window given as argument.

*** 6.3.3. =vwprintw()=

    This function is similar to =vprintf()=. This can be used when
    variable number of arguments are to be printed.

*** 6.3.4. A Simple printw example

    [[file:ncurses_programs/basics/printw_example.c][*Example 3. A Simple printw example*]]

    #+BEGIN_SRC c
      #include <ncurses.h>              /* ncurses.h includes stdio.h            */
      #include <string.h>

      int main()
      {
        char mesg[]="Just a string";    /* message to be appeared on the screen  */
        int row,col;                    /* to store the number of rows and       *
                                         * the number of colums of the screen    */
        initscr();                      /* start the curses mode                 */
        getmaxyx(stdscr,row,col);       /* get the number of rows and columns    */
        mvprintw(row/2,(col-strlen(mesg))/2,"%s",mesg);
                                        /* print the message at the center of the screen */
        mvprintw(row-2,0,"This screen has %d rows and %d columns\n",row,col);
        printw("Try resizing your window(if possible) and then run this program again");
        refresh();
        getch();
        endwin();

        return 0;
      }
    #+END_SRC

    Above program demonstrates how easy it is to use =printw=. You
    just feed the coordinates and the message to be appeared on the
    screen, then it does what you want.

    The above program introduces us to a new function =getmaxyx()=, a
    macro defined in =ncurses.h=. It gives the number of columns and
    the number of rows in a given window. =getmaxyx()= does this by
    updating the variables given to it. Since =getmaxyx()= is not a
    function we don't pass pointers to it, we just give two integer
    variables.

** 6.4. =addstr()= class of functions

   =addstr()= is used to put a character string into a given
   window. This function is similar to calling =addch()= once for each
   character in a given string. This is true for all output
   functions. There are other functions from this family such as
   =mvaddstr(),mvwaddstr()= and =waddstr()=, which obey the naming
   convention of curses.(e.g. =mvaddstr()= is similar to the
   respective calls =move()= and then =addstr()=.) Another function of
   this family is =addnstr()=, which takes an integer parameter(say
   =n=) additionally. This function puts at most =n= characters into
   the screen. If =n= is negative, then the entire string will be
   added.

** 6.5. A word of caution

   All these functions take =y= co-ordinate first and then =x= in
   their arguments. A common mistake by beginners is to pass =x=, =y=
   in that order.  If you are doing too many manipulations of (y,x)
   co-ordinates, think of dividing the screen into windows and
   manipulate each one separately.  Windows are explained in the
   [[@WINDOWS][windows]] section.

* 7. Input functions

  Well, printing without taking input, is boring. Let's see functions
  which allow us to get input from user. These functions also can be
  divided into three categories.

  1. =getch()= class: Get a character

  2. =scanw()= class: Get formatted input

  3. =getstr()= class: Get strings

** 7.1. =getch()= class of functions

   These functions read a single character from the terminal. But
   there are several subtle facts to consider. For example if you
   don't use the function =cbreak()=, curses will not read your input
   characters contiguously but will begin read them only after a new
   line or an EOF is encountered. In order to avoid this, the
   =cbreak()= function must used so that characters are immediately
   available to your program. Another widely used function is
   =noecho()=. As the name suggests, when this function is set (used),
   the characters that are keyed in by the user will not show up on
   the screen. The two functions =cbreak()= and =noecho()= are typical
   examples of key management. Functions of this genre are explained
   in the [[@KEYS][key management section]].

** 7.2. =scanw()= class of functions

   These functions are similar to =scanf()= with the added capability
   of getting the input from any location on the screen.

*** 7.2.1. =scanw()= and =mvscanw=

    The usage of these functions is similar to that of =sscanf()=,
    where the line to be scanned is provided by =wgetstr()=
    function. That is, these functions call to =wgetstr()=
    function(explained below) and uses the resulting line for a scan.

*** 7.2.2. =wscanw()= and =mvwscanw()=

    These are similar to above two functions except that they read
    from a window, which is supplied as one of the arguments to these
    functions.

*** 7.2.3. =vwscanw()=

    This function is similar to =vscanf()=. This can be used when a
    variable number of arguments are to be scanned.

** 7.3. =getstr()= class of functions

   These functions are used to get strings from the terminal. In
   essence, this function performs the same task as would be achieved
   by a series of calls to =getch()= until a newline, carriage return,
   or end-of-file is received. The resulting string of characters are
   pointed to by =str=, which is a character pointer provided by the
   user.

