NCURSES-Programming-HOWTO.html

<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3">6.3. <code>printw()</code> class of functions</h3>
<div class="outline-text-3" id="text-7-3">
<p>
These functions are similar to <code>printf()</code> with the added capability
of printing at any position on the screen.
</p>
</div>

<div id="outline-container-sec-7-3-1" class="outline-4">
<h4 id="sec-7-3-1">6.3.1. <code>printw()</code> and <code>mvprintw</code></h4>
<div class="outline-text-4" id="text-7-3-1">
<p>
These two functions work much like <code>printf()</code>. <code>mvprintw()</code> can be
used to move the cursor to a position and then print. If you want
to move the cursor first and then print using <code>printw()</code> function,
use <code>move()</code> first and then use <code>printw()</code> though I see no point
why one should avoid using <code>mvprintw()</code>, you have the flexibility
to manipulate.
</p>
</div>
</div>

<div id="outline-container-sec-7-3-2" class="outline-4">
<h4 id="sec-7-3-2">6.3.2. <code>wprintw()</code> and <code>mvwprintw</code></h4>
<div class="outline-text-4" id="text-7-3-2">
<p>
These two functions are similar to above two except that they
print in the corresponding window given as argument.
</p>
</div>
</div>

<div id="outline-container-sec-7-3-3" class="outline-4">
<h4 id="sec-7-3-3">6.3.3. <code>vwprintw()</code></h4>
<div class="outline-text-4" id="text-7-3-3">
<p>
This function is similar to <code>vprintf()</code>. This can be used when
variable number of arguments are to be printed.
</p>
</div>
</div>

<div id="outline-container-sec-7-3-4" class="outline-4">
<h4 id="sec-7-3-4">6.3.4. A Simple printw example</h4>
<div class="outline-text-4" id="text-7-3-4">
<p>
<a href="ncurses_programs/basics/printw_example.c"><b>Example 3. A Simple printw example</b></a>
</p>

<div class="org-src-container">

<pre class="src src-c">#include &lt;ncurses.h&gt;              /* ncurses.h includes stdio.h            */
#include &lt;string.h&gt;

int main()
{
  char mesg[]="Just a string";    /* message to be appeared on the screen  */
  int row,col;                    /* to store the number of rows and       *
                                   * the number of colums of the screen    */
  initscr();                      /* start the curses mode                 */
  getmaxyx(stdscr,row,col);       /* get the number of rows and columns    */
  mvprintw(row/2,(col-strlen(mesg))/2,"%s",mesg);
                                  /* print the message at the center of the screen */
  mvprintw(row-2,0,"This screen has %d rows and %d columns\n",row,col);
  printw("Try resizing your window(if possible) and then run this program again");
  refresh();
  getch();
  endwin();

  return 0;
}
</pre>
</div>

<p>
Above program demonstrates how easy it is to use <code>printw</code>. You
just feed the coordinates and the message to be appeared on the
screen, then it does what you want.
</p>

<p>
The above program introduces us to a new function <code>getmaxyx()</code>, a
macro defined in <code>ncurses.h</code>. It gives the number of columns and
the number of rows in a given window. <code>getmaxyx()</code> does this by
updating the variables given to it. Since <code>getmaxyx()</code> is not a
function we don't pass pointers to it, we just give two integer
variables.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-7-4" class="outline-3">
<h3 id="sec-7-4">6.4. <code>addstr()</code> class of functions</h3>
<div class="outline-text-3" id="text-7-4">
<p>
<code>addstr()</code> is used to put a character string into a given
window. This function is similar to calling <code>addch()</code> once for each
character in a given string. This is true for all output
functions. There are other functions from this family such as
<code>mvaddstr(),mvwaddstr()</code> and <code>waddstr()</code>, which obey the naming
convention of curses.(e.g. <code>mvaddstr()</code> is similar to the
respective calls <code>move()</code> and then <code>addstr()</code>.) Another function of
this family is <code>addnstr()</code>, which takes an integer parameter(say
<code>n</code>) additionally. This function puts at most <code>n</code> characters into
the screen. If <code>n</code> is negative, then the entire string will be
added.
</p>
</div>
</div>

<div id="outline-container-sec-7-5" class="outline-3">
<h3 id="sec-7-5">6.5. A word of caution</h3>
<div class="outline-text-3" id="text-7-5">
<p>
All these functions take <code>y</code> co-ordinate first and then <code>x</code> in
their arguments. A common mistake by beginners is to pass <code>x</code>, <code>y</code>
in that order.  If you are doing too many manipulations of (y,x)
co-ordinates, think of dividing the screen into windows and
manipulate each one separately.  Windows are explained in the
<a href="#WINDOWS">windows</a> section.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">7. Input functions</h2>
<div class="outline-text-2" id="text-8">
<p>
Well, printing without taking input, is boring. Let's see functions
which allow us to get input from user. These functions also can be
divided into three categories.
</p>

<ol class="org-ol">
<li><code>getch()</code> class: Get a character
</li>

<li><code>scanw()</code> class: Get formatted input
</li>

<li><code>getstr()</code> class: Get strings
</li>
</ol>
</div>

<div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1">7.1. <code>getch()</code> class of functions</h3>
<div class="outline-text-3" id="text-8-1">
<p>
These functions read a single character from the terminal. But
there are several subtle facts to consider. For example if you
don't use the function <code>cbreak()</code>, curses will not read your input
characters contiguously but will begin read them only after a new
line or an EOF is encountered. In order to avoid this, the
<code>cbreak()</code> function must used so that characters are immediately
available to your program. Another widely used function is
<code>noecho()</code>. As the name suggests, when this function is set (used),
the characters that are keyed in by the user will not show up on
the screen. The two functions <code>cbreak()</code> and <code>noecho()</code> are typical
examples of key management. Functions of this genre are explained
in the <a href="#KEYS">key management section</a>.
</p>
</div>
</div>

<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2">7.2. <code>scanw()</code> class of functions</h3>
<div class="outline-text-3" id="text-8-2">
<p>
These functions are similar to <code>scanf()</code> with the added capability
of getting the input from any location on the screen.
</p>
</div>

<div id="outline-container-sec-8-2-1" class="outline-4">
<h4 id="sec-8-2-1">7.2.1. <code>scanw()</code> and <code>mvscanw</code></h4>
<div class="outline-text-4" id="text-8-2-1">
<p>
The usage of these functions is similar to that of <code>sscanf()</code>,
where the line to be scanned is provided by <code>wgetstr()</code>
function. That is, these functions call to <code>wgetstr()</code>
function(explained below) and uses the resulting line for a scan.
</p>
</div>
</div>

<div id="outline-container-sec-8-2-2" class="outline-4">
<h4 id="sec-8-2-2">7.2.2. <code>wscanw()</code> and <code>mvwscanw()</code></h4>
<div class="outline-text-4" id="text-8-2-2">
<p>
These are similar to above two functions except that they read
from a window, which is supplied as one of the arguments to these
functions.
</p>
</div>
</div>

<div id="outline-container-sec-8-2-3" class="outline-4">
<h4 id="sec-8-2-3">7.2.3. <code>vwscanw()</code></h4>
<div class="outline-text-4" id="text-8-2-3">
<p>
This function is similar to <code>vscanf()</code>. This can be used when a
variable number of arguments are to be scanned.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3">7.3. <code>getstr()</code> class of functions</h3>
<div class="outline-text-3" id="text-8-3">
<p>
These functions are used to get strings from the terminal. In
essence, this function performs the same task as would be achieved
by a series of calls to <code>getch()</code> until a newline, carriage return,
or end-of-file is received. The resulting string of characters are
pointed to by <code>str</code>, which is a character pointer provided by the
user.
</p>
</div>
</div>
