NCURSES-Programming-HOWTO.html

<div id="outline-container-sec-8-4" class="outline-3">
<h3 id="sec-8-4">7.4. Some examples</h3>
<div class="outline-text-3" id="text-8-4">
<p>
<a href="ncurses_programs/basics/scanw_example.c"><b>Example 4. A Simple scanw example</b></a>
</p>

<div class="org-src-container">

<pre class="src src-c">#include &lt;ncurses.h&gt;                     /* ncurses.h includes stdio.h           */
#include &lt;string.h&gt;

int main()
{
  char mesg[]="Enter a string: ";        /* message to be appeared on the screen */
  char str[80];
  int row,col;                           /* to store the number of rows and      *
                                          * the number of colums of the screen   */
  initscr();                             /* start the curses mode                */
  getmaxyx(stdscr,row,col);              /* get the number of rows and columns   */
  mvprintw(row/2,(col-strlen(mesg))/2,"%s",mesg);
                                /* print the message at the center of the screen */
  getstr(str);
  mvprintw(LINES - 2, 0, "You Entered: %s", str);
  getch();
  endwin();

  return 0;
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">8. Attributes                                                       <a id="ATTRIB" name="ATTRIB"></a></h2>
<div class="outline-text-2" id="text-9">
<p>
We have seen an example of how attributes can be used to print
characters with some special effects. Attributes, when set
prudently, can present information in an easy, understandable
manner. The following program takes a C file as input and prints the
file with comments in bold. Scan through the code.
</p>

<p>
<a href="ncurses_programs/basics/simple_attr.c"><b>Example 5. A Simple Attributes example</b></a>
</p>

<div class="org-src-container">

<pre class="src src-c">/* pager functionality by Joseph Spainhour" &lt;spainhou@bellsouth.net&gt; */
#include &lt;ncurses.h&gt;
#include &lt;stdlib.h&gt;

int main(int argc, char *argv[])
{
  int ch, prev, row, col;
  prev = EOF;
  FILE *fp;
  int y, x;

  if(argc != 2)
    {
      printf("Usage: %s &lt;a c file name&gt;\n", argv[0]);
      exit(1);
    }
  fp = fopen(argv[1], "r");
  if(fp == NULL)
    {
      perror("Cannot open input file");
      exit(1);
    }
  initscr();                               /* Start curses mode                    */
  getmaxyx(stdscr, row, col);              /* find the boundaries of the screeen   */
  while((ch = fgetc(fp)) != EOF)           /* read the file till we reach the end  */
    {
      getyx(stdscr, y, x);                 /* get the current curser position      */
      if(y == (row - 1))                   /* are we are at the end of the screen  */
        {
          printw("&lt;-Press Any Key-&gt;");     /* tell the user to press a key         */
          getch();
          clear();                         /* clear the screen                     */
          move(0, 0);                      /* start at the beginning of the screen */
        }
      if(prev == '/' &amp;&amp; ch == '*')         /* If it is / and * then only
                                            * switch bold on                       */
        {
          attron(A_BOLD);                  /* cut bold on                          */
          getyx(stdscr, y, x);             /* get the current curser position      */
          move(y, x - 1);                  /* back up one space */
          printw("%c%c", '/', ch);         /* The actual printing is done here     */
        }
      else
        printw("%c", ch);
      refresh();
      if(prev == '*' &amp;&amp; ch == '/')
        attroff(A_BOLD);                   /* Switch it off once we got *
                                            * and then /                           */
      prev = ch;
    }

  printw("&lt;-Press Any Key-&gt;");
  getch();

  endwin();                                /* End curses mode                      */
  fclose(fp);
  return 0;
}
</pre>
</div>

<p>
Don't worry about all those initialization and other crap.
Concentrate on the while loop. It reads each character in the file
and searches for the pattern <code>/*</code>. Once it spots the pattern, it
switches the BOLD attribute on with <code>attron()</code> . When we get the
pattern <code>*/</code> it is switched off by <code>attroff()</code> .
</p>

<p>
The above program also introduces us to two useful functions
<code>getyx()</code> and <code>move()</code>. The first function gets the co-ordinates of
the present cursor into the variables <code>y</code>, <code>x</code>. Since <code>getyx()</code> is a
macro we don't have to pass pointers to variables. The function
<code>move()</code> moves the cursor to the co-ordinates given to it.
</p>

<p>
The above program is really a simple one which doesn't do much. On
these lines one could write a more useful program which reads a C
file, parses it and prints it in different colors. One could even
extend it to other languages as well.
</p>
</div>

<div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1">8.1. The details</h3>
<div class="outline-text-3" id="text-9-1">
<p>
Let's get into more details of attributes. The functions
<code>attron()</code>, <code>attroff()</code>, <code>attrset()</code>, and their sister functions
<code>attr_get()</code> etc.. can be used to switch attributes on/off , get
attributes and produce a colorful display.
</p>

<p>
The functions <code>attron</code> and <code>attroff</code> take a bit-mask of attributes
and switch them on or off, respectively. The following video
attributes, which are defined in <code>&lt;curses.h&gt;</code> can be passed to
these functions.
</p>

<pre class="example">
A_NORMAL        Normal display (no highlight)
A_STANDOUT      Best highlighting mode of the terminal.
A_UNDERLINE     Underlining
A_REVERSE       Reverse video
A_BLINK         Blinking
A_DIM           Half bright
A_BOLD          Extra bright or bold
A_PROTECT       Protected mode
A_INVIS         Invisible or blank mode
A_ALTCHARSET    Alternate character set
A_CHARTEXT      Bit-mask to extract a character
COLOR_PAIR(n)   Color-pair number n
</pre>

<p>
The last one is the most colorful one :-) Colors are explained in
the <a href="#color">next sections</a>.
</p>

<p>
We can OR(|) any number of above attributes to get a combined
effect. If you wanted reverse video with blinking characters you
can use
</p>

<div class="org-src-container">

<pre class="src src-c">attron(A_REVERSE | A_BLINK);
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2">8.2. <code>attron()</code> vs <code>attrset()</code></h3>
<div class="outline-text-3" id="text-9-2">
<p>
Then what is the difference between <code>attron()</code> and <code>attrset()</code>?
attrset sets the attributes of window whereas attron just switches
on the attribute given to it. So <code>attrset()</code> fully overrides
whatever attributes the window previously had and sets it to the
new <code>attribute(s)</code>. Similarly <code>attroff()</code> just switches off the
<code>attribute(s)</code> given to it as an argument. This gives us the
flexibility of managing attributes easily.But if you use them
carelessly you may loose track of what attributes the window has
and garble the display. This is especially true while managing
menus with colors and highlighting. So decide on a consistent
policy and stick to it. You can always use <code>standend()</code> which is
equivalent to <code>attrset(A_NORMAL)</code> which turns off all attributes
and brings you to normal mode.
</p>
</div>
</div>

<div id="outline-container-sec-9-3" class="outline-3">
<h3 id="sec-9-3">8.3. <code>attr_get()</code></h3>
<div class="outline-text-3" id="text-9-3">
<p>
The function <code>attr_get()</code> gets the current attributes and color
pair of the window. Though we might not use this as often as the
above functions, this is useful in scanning areas of screen. Say we
wanted to do some complex update on screen and we are not sure what
attribute each character is associated with. Then this function can
be used with either <code>attrset</code> or <code>attron</code> to produce the desired
effect.
</p>
</div>
</div>
