NCURSES-Programming-HOWTO.org
** 8.4. =attr_= functions

   There are series of functions like =attr_set()=, =attr_on=
   etc.. These are similar to above functions except that they take
   parameters of type =attr_t=.

** 8.5. =wattr= functions

   For each of the above functions we have a corresponding function
   with 'w' which operates on a particular window. The above functions
   operate on =stdscr=.

** 8.6. =chgat()= functions

   The function =chgat()= is listed in the end of the man page
   =curs_attr=. It actually is a useful one. This function can be used
   to set attributes for a group of characters without moving. I mean
   it !!! without moving the cursor :-) It changes the attributes of a
   given number of characters starting at the current cursor location.

   We can give =-1= as the character count to update till end of
   line. If you want to change attributes of characters from current
   position to end of line, just use this.

   #+BEGIN_SRC c
     chgat(-1, A_REVERSE, 0, NULL);
   #+END_SRC

   This function is useful when changing attributes for characters
   that are already on the screen. Move to the character from which
   you want to change and change the attribute.

   Other functions =wchgat()=, =mvchgat()=, =mvwchgat()= behave
   similarly except that the w functions operate on the particular
   window. The mv functions first move the cursor then perform the
   work given to them. Actually chgat is a macro which is replaced by
   a =wchgat()= with =stdscr= as the window. Most of the "w-less"
   functions are macros.

   [[file:ncurses_programs/basics/with_chgat.c][*Example 6. Chgat() Usage example*]]

   #+BEGIN_SRC c
     #include <ncurses.h>

     int main(int argc, char *argv[])
     {   initscr();                      /* Start curses mode            */
       start_color();                    /* Start color functionality    */

       init_pair(1, COLOR_CYAN, COLOR_BLACK);
       printw("A Big string which i didn't care to type fully ");
       mvchgat(0, 0, -1, A_BLINK, 1, NULL);
       /*
        * First two parameters specify the position at which to start
        * Third parameter number of characters to update. -1 means till
        * end of line
        * Forth parameter is the normal attribute you wanted to give
        * to the charcter
        * Fifth is the color index. It is the index given during init_pair()
        * use 0 if you didn't want color
        * Sixth one is always NULL
        */
       refresh();
       getch();
       endwin();                         /* End curses mode              */
       return 0;
     }
   #+END_SRC

   This example also introduces us to the color world of curses.
   Colors will be explained in detail later. Use 0 for no color.

* 9. Windows                                                          <<@WINDOWS>>

  Windows form the most important concept in curses. You have seen the
  standard window =stdscr= above where all the functions implicitly
  operated on this window. Now to make design even a simplest GUI, you
  need to resort to windows. The main reason you may want to use
  windows is to manipulate parts of the screen separately, for better
  efficiency, by updating only the windows that need to be changed and
  for a better design. I would say the last reason is the most
  important in going for windows. You should always strive for a
  better and easy-to-manage design in your programs. If you are
  writing big, complex GUIs this is of pivotal importance before you
  start doing anything.

** 9.1. The basics

   A Window can be created by calling the function =newwin()=. It
   doesn't create any thing on the screen actually. It allocates
   memory for a structure to manipulate the window and updates the
   structure with data regarding the window like it's size, beginy,
   beginx etc.. Hence in curses, a window is just an abstraction of an
   imaginary window, which can be manipulated independent of other
   parts of screen. The function =newwin()= returns a pointer to
   structure =WINDOW=, which can be passed to window related functions
   like =wprintw()= etc.. Finally the window can be destroyed with
   =delwin()=. It will deallocate the memory associated with the
   =WINDOW= structure.

