NCURSES-Programming-HOWTO.html

<div id="outline-container-sec-9-4" class="outline-3">
<h3 id="sec-9-4">8.4. <code>attr_</code> functions</h3>
<div class="outline-text-3" id="text-9-4">
<p>
There are series of functions like <code>attr_set()</code>, <code>attr_on</code>
etc.. These are similar to above functions except that they take
parameters of type <code>attr_t</code>.
</p>
</div>
</div>

<div id="outline-container-sec-9-5" class="outline-3">
<h3 id="sec-9-5">8.5. <code>wattr</code> functions</h3>
<div class="outline-text-3" id="text-9-5">
<p>
For each of the above functions we have a corresponding function
with 'w' which operates on a particular window. The above functions
operate on <code>stdscr</code>.
</p>
</div>
</div>

<div id="outline-container-sec-9-6" class="outline-3">
<h3 id="sec-9-6">8.6. <code>chgat()</code> functions</h3>
<div class="outline-text-3" id="text-9-6">
<p>
The function <code>chgat()</code> is listed in the end of the man page
<code>curs_attr</code>. It actually is a useful one. This function can be used
to set attributes for a group of characters without moving. I mean
it !!! without moving the cursor :-) It changes the attributes of a
given number of characters starting at the current cursor location.
</p>

<p>
We can give <code>-1</code> as the character count to update till end of
line. If you want to change attributes of characters from current
position to end of line, just use this.
</p>

<div class="org-src-container">

<pre class="src src-c">chgat(-1, A_REVERSE, 0, NULL);
</pre>
</div>

<p>
This function is useful when changing attributes for characters
that are already on the screen. Move to the character from which
you want to change and change the attribute.
</p>

<p>
Other functions <code>wchgat()</code>, <code>mvchgat()</code>, <code>mvwchgat()</code> behave
similarly except that the w functions operate on the particular
window. The mv functions first move the cursor then perform the
work given to them. Actually chgat is a macro which is replaced by
a <code>wchgat()</code> with <code>stdscr</code> as the window. Most of the "w-less"
functions are macros.
</p>

<p>
<a href="ncurses_programs/basics/with_chgat.c"><b>Example 6. Chgat() Usage example</b></a>
</p>

<div class="org-src-container">

<pre class="src src-c">#include &lt;ncurses.h&gt;

int main(int argc, char *argv[])
{   initscr();                      /* Start curses mode            */
  start_color();                    /* Start color functionality    */

  init_pair(1, COLOR_CYAN, COLOR_BLACK);
  printw("A Big string which i didn't care to type fully ");
  mvchgat(0, 0, -1, A_BLINK, 1, NULL);
  /*
   * First two parameters specify the position at which to start
   * Third parameter number of characters to update. -1 means till
   * end of line
   * Forth parameter is the normal attribute you wanted to give
   * to the charcter
   * Fifth is the color index. It is the index given during init_pair()
   * use 0 if you didn't want color
   * Sixth one is always NULL
   */
  refresh();
  getch();
  endwin();                         /* End curses mode              */
  return 0;
}
</pre>
</div>

<p>
This example also introduces us to the color world of curses.
Colors will be explained in detail later. Use 0 for no color.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">9. Windows                                                          <a id="WINDOWS" name="WINDOWS"></a></h2>
<div class="outline-text-2" id="text-10">
<p>
Windows form the most important concept in curses. You have seen the
standard window <code>stdscr</code> above where all the functions implicitly
operated on this window. Now to make design even a simplest GUI, you
need to resort to windows. The main reason you may want to use
windows is to manipulate parts of the screen separately, for better
efficiency, by updating only the windows that need to be changed and
for a better design. I would say the last reason is the most
important in going for windows. You should always strive for a
better and easy-to-manage design in your programs. If you are
writing big, complex GUIs this is of pivotal importance before you
start doing anything.
</p>
</div>

<div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1">9.1. The basics</h3>
<div class="outline-text-3" id="text-10-1">
<p>
A Window can be created by calling the function <code>newwin()</code>. It
doesn't create any thing on the screen actually. It allocates
memory for a structure to manipulate the window and updates the
structure with data regarding the window like it's size, beginy,
beginx etc.. Hence in curses, a window is just an abstraction of an
imaginary window, which can be manipulated independent of other
parts of screen. The function <code>newwin()</code> returns a pointer to
structure <code>WINDOW</code>, which can be passed to window related functions
like <code>wprintw()</code> etc.. Finally the window can be destroyed with
<code>delwin()</code>. It will deallocate the memory associated with the
<code>WINDOW</code> structure.
</p>
</div>
</div>
