NCURSES-Programming-HOWTO.org
** 9.2. Let there be a Window !!!

   What fun is it, if a window is created and we can't see it. So the
   fun part begins by displaying the window. The function =box()= can
   be used to draw a border around the window. Let's explore these
   functions in more detail in this example.

   [[file:ncurses_programs/basics/win_border.c][*Example 7. Window Border example*]]

   #+BEGIN_SRC c
     #include <ncurses.h>

     WINDOW *create_newwin(int height, int width, int starty, int startx);
     void destroy_win(WINDOW *local_win);

     int main(int argc, char *argv[])
     { WINDOW *my_win;
       int startx, starty, width, height;
       int ch;

       initscr();                      /* Start curses mode                  */
       cbreak();                       /* Line buffering disabled, Pass on
                                        * everty thing to me                 */
       keypad(stdscr, TRUE);           /* I need that nifty F1               */

       height = 3;
       width = 10;
       starty = (LINES - height) / 2;  /* Calculating for a center placement */
       startx = (COLS - width) / 2;    /* of the window                      */
       printw("Press F1 to exit");
       refresh();
       my_win = create_newwin(height, width, starty, startx);

       while((ch = getch()) != KEY_F(1))
         {   switch(ch)
             {   case KEY_LEFT:
                 destroy_win(my_win);
                 my_win = create_newwin(height, width, starty,--startx);
                 break;
             case KEY_RIGHT:
               destroy_win(my_win);
               my_win = create_newwin(height, width, starty,++startx);
               break;
             case KEY_UP:
               destroy_win(my_win);
               my_win = create_newwin(height, width, --starty,startx);
               break;
             case KEY_DOWN:
               destroy_win(my_win);
               my_win = create_newwin(height, width, ++starty,startx);
               break;
             }
         }

       endwin();                       /* End curses mode                    */
       return 0;
     }

     WINDOW *create_newwin(int height, int width, int starty, int startx)
     { WINDOW *local_win;

       local_win = newwin(height, width, starty, startx);
       box(local_win, 0 , 0);          /* 0, 0 gives default characters
                                        * for the vertical and horizontal
                                        * lines                              */
       wrefresh(local_win);            /* Show that box                      */

       return local_win;
     }

     void destroy_win(WINDOW *local_win)
     {
       /* box(local_win, ' ', ' '); : This won't produce the desired
        * result of erasing the window. It will leave it's four corners
        * and so an ugly remnant of window.
        */
       wborder(local_win, ' ', ' ', ' ',' ',' ',' ',' ',' ');
       /* The parameters taken are
        * 1. win: the window on which to operate
        * 2. ls: character to be used for the left side of the window
        * 3. rs: character to be used for the right side of the window
        * 4. ts: character to be used for the top side of the window
        * 5. bs: character to be used for the bottom side of the window
        * 6. tl: character to be used for the top left corner of the window
        * 7. tr: character to be used for the top right corner of the window
        * 8. bl: character to be used for the bottom left corner of the window
        * 9. br: character to be used for the bottom right corner of the window
        */
       wrefresh(local_win);
       delwin(local_win);
     }
   #+END_SRC

** 9.3. Explanation

   Don't scream. I know it's a big example. But I have to explain some
   important things here :-). This program creates a rectangular
   window that can be moved with left, right, up, down arrow keys. It
   repeatedly creates and destroys windows as user press a key. Don't
   go beyond the screen limits. Checking for those limits is left as
   an exercise for the reader. Let's dissect it by line by line.

   The =create_newwin()= function creates a window with =newwin()= and
   displays a border around it with =box()=. The function
   =destroy_win()= first erases the window from screen by painting a
   border with ' ' character and then calling =delwin()= to deallocate
   memory related to it. Depending on the key the user presses,
   =starty= or =startx= is changed and a new window is created.

   In the =destroy_win=, as you can see, I used =wborder= instead of
   box. The reason is written in the comments (You missed it. I
   know. Read the code :-)). =wborder= draws a border around the
   window with the characters given to it as the 4 corner points and
   the 4 lines. To put it clearly, if you have called =wborder= as
   below:

   #+BEGIN_SRC c
     wborder(win, '|', '|', '-', '-', '+', '+', '+', '+');
   #+END_SRC

   it produces some thing like

   #+BEGIN_EXAMPLE
     +------------+
     |            |
     |            |
     |            |
     |            |
     |            |
     |            |
     +------------+
   #+END_EXAMPLE

** 9.4. The other stuff in the example

   You can also see in the above examples, that I have used the
   variables =COLS=, =LINES= which are initialized to the screen sizes
   after =initscr()=.  They can be useful in finding screen dimensions
   and finding the center co-ordinate of the screen as above. The
   function =getch()= as usual gets the key from keyboard and
   according to the key it does the corresponding work. This type of
   switch-case is very common in any GUI based programs.

