NCURSES-Programming-HOWTO.html

<div id="outline-container-sec-10-2" class="outline-3">
<h3 id="sec-10-2">9.2. Let there be a Window !!!</h3>
<div class="outline-text-3" id="text-10-2">
<p>
What fun is it, if a window is created and we can't see it. So the
fun part begins by displaying the window. The function <code>box()</code> can
be used to draw a border around the window. Let's explore these
functions in more detail in this example.
</p>

<p>
<a href="ncurses_programs/basics/win_border.c"><b>Example 7. Window Border example</b></a>
</p>

<div class="org-src-container">

<pre class="src src-c">#include &lt;ncurses.h&gt;

WINDOW *create_newwin(int height, int width, int starty, int startx);
void destroy_win(WINDOW *local_win);

int main(int argc, char *argv[])
{ WINDOW *my_win;
  int startx, starty, width, height;
  int ch;

  initscr();                      /* Start curses mode                  */
  cbreak();                       /* Line buffering disabled, Pass on
                                   * everty thing to me                 */
  keypad(stdscr, TRUE);           /* I need that nifty F1               */

  height = 3;
  width = 10;
  starty = (LINES - height) / 2;  /* Calculating for a center placement */
  startx = (COLS - width) / 2;    /* of the window                      */
  printw("Press F1 to exit");
  refresh();
  my_win = create_newwin(height, width, starty, startx);

  while((ch = getch()) != KEY_F(1))
    {   switch(ch)
        {   case KEY_LEFT:
            destroy_win(my_win);
            my_win = create_newwin(height, width, starty,--startx);
            break;
        case KEY_RIGHT:
          destroy_win(my_win);
          my_win = create_newwin(height, width, starty,++startx);
          break;
        case KEY_UP:
          destroy_win(my_win);
          my_win = create_newwin(height, width, --starty,startx);
          break;
        case KEY_DOWN:
          destroy_win(my_win);
          my_win = create_newwin(height, width, ++starty,startx);
          break;
        }
    }

  endwin();                       /* End curses mode                    */
  return 0;
}

WINDOW *create_newwin(int height, int width, int starty, int startx)
{ WINDOW *local_win;

  local_win = newwin(height, width, starty, startx);
  box(local_win, 0 , 0);          /* 0, 0 gives default characters
                                   * for the vertical and horizontal
                                   * lines                              */
  wrefresh(local_win);            /* Show that box                      */

  return local_win;
}

void destroy_win(WINDOW *local_win)
{
  /* box(local_win, ' ', ' '); : This won't produce the desired
   * result of erasing the window. It will leave it's four corners
   * and so an ugly remnant of window.
   */
  wborder(local_win, ' ', ' ', ' ',' ',' ',' ',' ',' ');
  /* The parameters taken are
   * 1. win: the window on which to operate
   * 2. ls: character to be used for the left side of the window
   * 3. rs: character to be used for the right side of the window
   * 4. ts: character to be used for the top side of the window
   * 5. bs: character to be used for the bottom side of the window
   * 6. tl: character to be used for the top left corner of the window
   * 7. tr: character to be used for the top right corner of the window
   * 8. bl: character to be used for the bottom left corner of the window
   * 9. br: character to be used for the bottom right corner of the window
   */
  wrefresh(local_win);
  delwin(local_win);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-10-3" class="outline-3">
<h3 id="sec-10-3">9.3. Explanation</h3>
<div class="outline-text-3" id="text-10-3">
<p>
Don't scream. I know it's a big example. But I have to explain some
important things here :-). This program creates a rectangular
window that can be moved with left, right, up, down arrow keys. It
repeatedly creates and destroys windows as user press a key. Don't
go beyond the screen limits. Checking for those limits is left as
an exercise for the reader. Let's dissect it by line by line.
</p>

<p>
The <code>create_newwin()</code> function creates a window with <code>newwin()</code> and
displays a border around it with <code>box()</code>. The function
<code>destroy_win()</code> first erases the window from screen by painting a
border with ' ' character and then calling <code>delwin()</code> to deallocate
memory related to it. Depending on the key the user presses,
<code>starty</code> or <code>startx</code> is changed and a new window is created.
</p>

<p>
In the <code>destroy_win</code>, as you can see, I used <code>wborder</code> instead of
box. The reason is written in the comments (You missed it. I
know. Read the code :-)). <code>wborder</code> draws a border around the
window with the characters given to it as the 4 corner points and
the 4 lines. To put it clearly, if you have called <code>wborder</code> as
below:
</p>

<div class="org-src-container">

<pre class="src src-c">wborder(win, '|', '|', '-', '-', '+', '+', '+', '+');
</pre>
</div>

<p>
it produces some thing like
</p>

<pre class="example">
+------------+
|            |
|            |
|            |
|            |
|            |
|            |
+------------+
</pre>
</div>
</div>

<div id="outline-container-sec-10-4" class="outline-3">
<h3 id="sec-10-4">9.4. The other stuff in the example</h3>
<div class="outline-text-3" id="text-10-4">
<p>
You can also see in the above examples, that I have used the
variables <code>COLS</code>, <code>LINES</code> which are initialized to the screen sizes
after <code>initscr()</code>.  They can be useful in finding screen dimensions
and finding the center co-ordinate of the screen as above. The
function <code>getch()</code> as usual gets the key from keyboard and
according to the key it does the corresponding work. This type of
switch-case is very common in any GUI based programs.
</p>
</div>
</div>
