NCURSES-Programming-HOWTO.html

<div id="outline-container-sec-10-5" class="outline-3">
<h3 id="sec-10-5">9.5. Other Border functions</h3>
<div class="outline-text-3" id="text-10-5">
<p>
Above program is grossly inefficient in that with each press of a
key, a window is destroyed and another is created. So let's write a
more efficient program which uses other border related functions.
</p>

<p>
The following program uses <code>mvhline()</code> and <code>mvvline()</code> to achieve
similar effect. These two functions are simple. They create a
horizontal or vertical line of the specified length at the
specified position.
</p>

<p>
<a href="ncurses_programs/basics/other_border.c"><b>Example 8. More border functions</b></a>
</p>

<div class="org-src-container">

<pre class="src src-c">#include &lt;ncurses.h&gt;

typedef struct _win_border_struct {
  chtype  ls, rs, ts, bs,
    tl, tr, bl, br;
} WIN_BORDER;

typedef struct _WIN_struct {
  int startx, starty;
  int height, width;
  WIN_BORDER border;
} WIN;

void init_win_params(WIN *p_win);
void print_win_params(WIN *p_win);
void create_box(WIN *win, bool flag);

int main(int argc, char *argv[])
{ WIN win;
  int ch;

  initscr();                      /* Start curses mode             */
  start_color();                  /* Start the color functionality */
  cbreak();                       /* Line buffering disabled, Pass on
                                   * everty thing to me            */
  keypad(stdscr, TRUE);           /* I need that nifty F1          */
  noecho();
  init_pair(1, COLOR_CYAN, COLOR_BLACK);

  /* Initialize the window parameters */
  init_win_params(&amp;win);
  print_win_params(&amp;win);

  attron(COLOR_PAIR(1));
  printw("Press F1 to exit");
  refresh();
  attroff(COLOR_PAIR(1));

  create_box(&amp;win, TRUE);
  while((ch = getch()) != KEY_F(1))
    {   switch(ch)
        {   case KEY_LEFT:
            create_box(&amp;win, FALSE);
            --win.startx;
            create_box(&amp;win, TRUE);
            break;
        case KEY_RIGHT:
          create_box(&amp;win, FALSE);
          ++win.startx;
          create_box(&amp;win, TRUE);
          break;
        case KEY_UP:
          create_box(&amp;win, FALSE);
          --win.starty;
          create_box(&amp;win, TRUE);
          break;
        case KEY_DOWN:
          create_box(&amp;win, FALSE);
          ++win.starty;
          create_box(&amp;win, TRUE);
          break;
        }
    }
  endwin();                       /* End curses mode               */
  return 0;
}
void init_win_params(WIN *p_win)
{
  p_win-&gt;height = 3;
  p_win-&gt;width = 10;
  p_win-&gt;starty = (LINES - p_win-&gt;height)/2;
  p_win-&gt;startx = (COLS - p_win-&gt;width)/2;

  p_win-&gt;border.ls = '|';
  p_win-&gt;border.rs = '|';
  p_win-&gt;border.ts = '-';
  p_win-&gt;border.bs = '-';
  p_win-&gt;border.tl = '+';
  p_win-&gt;border.tr = '+';
  p_win-&gt;border.bl = '+';
  p_win-&gt;border.br = '+';

}
void print_win_params(WIN *p_win)
{
#ifdef _DEBUG
  mvprintw(25, 0, "%d %d %d %d", p_win-&gt;startx, p_win-&gt;starty,
           p_win-&gt;width, p_win-&gt;height);
  refresh();
#endif
}
void create_box(WIN *p_win, bool flag)
{ int i, j;
  int x, y, w, h;

  x = p_win-&gt;startx;
  y = p_win-&gt;starty;
  w = p_win-&gt;width;
  h = p_win-&gt;height;

  if(flag == TRUE)
    { mvaddch(y, x, p_win-&gt;border.tl);
      mvaddch(y, x + w, p_win-&gt;border.tr);
      mvaddch(y + h, x, p_win-&gt;border.bl);
      mvaddch(y + h, x + w, p_win-&gt;border.br);
      mvhline(y, x + 1, p_win-&gt;border.ts, w - 1);
      mvhline(y + h, x + 1, p_win-&gt;border.bs, w - 1);
      mvvline(y + 1, x, p_win-&gt;border.ls, h - 1);
      mvvline(y + 1, x + w, p_win-&gt;border.rs, h - 1);

    }
  else
    for(j = y; j &lt;= y + h; ++j)
      for(i = x; i &lt;= x + w; ++i)
        mvaddch(j, i, ' ');

  refresh();

}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">10. Colors                                                          <a id="color" name="color"></a></h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1">10.1. The basics</h3>
<div class="outline-text-3" id="text-11-1">
<p>
Life seems dull with no colors. Curses has a nice mechanism to
handle colors. Let's get into the thick of the things with a small
program.
</p>

<p>
<a href="ncurses_programs/basics/simple_color.c"><b>Example 9. A Simple Color example</b></a>
</p>

<div class="org-src-container">

<pre class="src src-c">#include &lt;ncurses.h&gt;

void print_in_middle(WINDOW *win, int starty, int startx, int width, char *string);
int main(int argc, char *argv[])
{ initscr();                /* Start curses mode        */
  if(has_colors() == FALSE)
    { endwin();
      printf("Your terminal does not support color\n");
      exit(1);
    }
  start_color();            /* Start color              */
  init_pair(1, COLOR_RED, COLOR_BLACK);

  attron(COLOR_PAIR(1));
  print_in_middle(stdscr, LINES / 2, 0, 0, "Viola !!! In color ...");
  attroff(COLOR_PAIR(1));
  getch();
  endwin();
}
void print_in_middle(WINDOW *win, int starty, int startx, int width, char *string)
{ int length, x, y;
  float temp;

  if(win == NULL)
    win = stdscr;
  getyx(win, y, x);
  if(startx != 0)
    x = startx;
  if(starty != 0)
    y = starty;
  if(width == 0)
    width = 80;

  length = strlen(string);
  temp = (width - length)/ 2;
  x = startx + (int)temp;
  mvwprintw(win, y, x, "%s", string);
  refresh();
}
</pre>
</div>

<p>
As you can see, to start using color, you should first call the
function <code>start_color()</code>. After that, you can use color
capabilities of your terminals using various functions. To find out
whether a terminal has color capabilities or not, you can use
<code>has_colors()</code> function, which returns <code>FALSE</code> if the terminal does
not support color.
</p>

<p>
Curses initializes all the colors supported by terminal when
<code>start_color()</code> is called. These can be accessed by the define
constants like <code>COLOR_BLACK</code> etc. Now to actually start using
colors, you have to define pairs. Colors are always used in
pairs. That means you have to use the function <code>init_pair()</code> to
define the foreground and background for the pair number you
give. After that that pair number can be used as a normal attribute
with <code>COLOR_PAIR()</code> function. This may seem to be cumbersome at
first. But this elegant solution allows us to manage color pairs
very easily. To appreciate it, you have to look into the the source
code of "dialog", a utility for displaying dialog boxes from shell
scripts. The developers have defined foreground and background
combinations for all the colors they might need and initialized at
the beginning. This makes it very easy to set attributes just by
accessing a pair which we already have defined as a constant.
</p>

<p>
The following colors are defined in <code>curses.h</code>. You can use these
as parameters for various color functions.
</p>

<pre class="example">
COLOR_BLACK   0
COLOR_RED     1
COLOR_GREEN   2
COLOR_YELLOW  3
COLOR_BLUE    4
COLOR_MAGENTA 5
COLOR_CYAN    6
COLOR_WHITE   7
</pre>
</div>
</div>
