NCURSES-Programming-HOWTO.org
** 13.1. =getyx()= functions

   The function =getyx()= can be used to find out the present cursor
   co-ordinates. It will fill the values of x and y co-ordinates in
   the arguments given to it. Since =getyx()= is a macro you don't
   have to pass the address of the variables. It can be called as

   #+BEGIN_SRC c
     getyx(win, y, x);
     /*   win : window pointer
      *   y, x: y, x co-ordinates will be put into this variables
      */
   #+END_SRC

   The function =getparyx()= gets the beginning co-ordinates of the
   sub window relative to the main window. This is some times useful
   to update a sub window. When designing fancy stuff like writing
   multiple menus, it becomes difficult to store the menu positions,
   their first option co-ordinates etc. A simple solution to this
   problem, is to create menus in sub windows and later find the
   starting co-ordinates of the menus by using =getparyx()=.

   The functions =getbegyx()= and =getmaxyx()= store current window's
   beginning and maximum co-ordinates. These functions are useful in
   the same way as above in managing the windows and sub windows
   effectively.

** 13.2. Screen Dumping

   While writing games, some times it becomes necessary to store the
   state of the screen and restore it back to the same state. The
   function =scr_dump()= can be used to dump the screen contents to a
   file given as an argument. Later it can be restored by
   =scr_restore= function. These two simple functions can be used
   effectively to maintain a fast moving game with changing scenarios.

** 13.3. Window Dumping

   To store and restore windows, the functions =putwin()= and
   =getwin()= can be used. =putwin()= puts the present window state
   into a file, which can be later restored by =getwin()=.

   The function =copywin()= can be used to copy a window completely
   onto another window. It takes the source and destination windows as
   parameters and according to the rectangle specified, it copies the
   rectangular region from source to destination window. It's last
   parameter specifies whether to overwrite or just overlay the
   contents on to the destination window. If this argument is true,
   then the copying is non-destructive.

* 14. Miscellaneous features

  Now you know enough features to write a good curses program, with
  all bells and whistles. There are some miscellaneous functions which
  are useful in various cases. Let's go headlong into some of those.

** 14.1. =curs_set()=

   This function can be used to make the cursor invisible. The
   parameter to this function should be

   #+BEGIN_EXAMPLE
     0 : invisible  or
     1 : normal     or
     2 : very visible.
   #+END_EXAMPLE

** 14.2. Temporarily Leaving Curses mode

   Some times you may want to get back to cooked mode (normal line
   buffering mode) temporarily. In such a case you will first need to
   save the tty modes with a call to =def_prog_mode()= and then call
   =endwin()= to end the curses mode. This will leave you in the
   original tty mode. To get back to curses once you are done, call
   =reset_prog_mode()=. This function returns the tty to the state
   stored by =def_prog_mode()=. Then do =refresh()=, and you are back
   to the curses mode. Here is an example showing the sequence of
   things to be done.

   [[file:ncurses_programs/basics/temp_leave.c][*Example 12. Temporarily Leaving Curses Mode*]]

   #+BEGIN_SRC c
     #include <ncurses.h>
     #include <stdlib.h>

     int main()
     {
       initscr();                      /* Start curses mode                   */
       printw("Hello World !!!\n");    /* Print Hello World                   */
       refresh();                      /* Print it on to the real screen      */
       getch();                        /* Wait                                */
       def_prog_mode();                /* Save the tty modes                  */
       endwin();                       /* End curses mode temporarily         */
       system("/bin/sh");              /* Do whatever you like in cooked mode */
       reset_prog_mode();              /* Return to the previous tty mode     */
                                       /* stored by def_prog_mode()           */
       refresh();                      /* Do refresh() to restore the         */
                                       /* Screen contents                     */
       printw("Another String\n");     /* Back to curses use the full         */
       refresh();                      /* capabilities of curses              */
       getch();                        /* Wait                                */
       endwin();                       /* End curses mode                     */

       return 0;
     }
   #+END_SRC

