NCURSES-Programming-HOWTO.html

<div id="outline-container-sec-14-1" class="outline-3">
<h3 id="sec-14-1">13.1. <code>getyx()</code> functions</h3>
<div class="outline-text-3" id="text-14-1">
<p>
The function <code>getyx()</code> can be used to find out the present cursor
co-ordinates. It will fill the values of x and y co-ordinates in
the arguments given to it. Since <code>getyx()</code> is a macro you don't
have to pass the address of the variables. It can be called as
</p>

<div class="org-src-container">

<pre class="src src-c">getyx(win, y, x);
/*   win : window pointer
 *   y, x: y, x co-ordinates will be put into this variables
 */
</pre>
</div>

<p>
The function <code>getparyx()</code> gets the beginning co-ordinates of the
sub window relative to the main window. This is some times useful
to update a sub window. When designing fancy stuff like writing
multiple menus, it becomes difficult to store the menu positions,
their first option co-ordinates etc. A simple solution to this
problem, is to create menus in sub windows and later find the
starting co-ordinates of the menus by using <code>getparyx()</code>.
</p>

<p>
The functions <code>getbegyx()</code> and <code>getmaxyx()</code> store current window's
beginning and maximum co-ordinates. These functions are useful in
the same way as above in managing the windows and sub windows
effectively.
</p>
</div>
</div>

<div id="outline-container-sec-14-2" class="outline-3">
<h3 id="sec-14-2">13.2. Screen Dumping</h3>
<div class="outline-text-3" id="text-14-2">
<p>
While writing games, some times it becomes necessary to store the
state of the screen and restore it back to the same state. The
function <code>scr_dump()</code> can be used to dump the screen contents to a
file given as an argument. Later it can be restored by
<code>scr_restore</code> function. These two simple functions can be used
effectively to maintain a fast moving game with changing scenarios.
</p>
</div>
</div>

<div id="outline-container-sec-14-3" class="outline-3">
<h3 id="sec-14-3">13.3. Window Dumping</h3>
<div class="outline-text-3" id="text-14-3">
<p>
To store and restore windows, the functions <code>putwin()</code> and
<code>getwin()</code> can be used. <code>putwin()</code> puts the present window state
into a file, which can be later restored by <code>getwin()</code>.
</p>

<p>
The function <code>copywin()</code> can be used to copy a window completely
onto another window. It takes the source and destination windows as
parameters and according to the rectangle specified, it copies the
rectangular region from source to destination window. It's last
parameter specifies whether to overwrite or just overlay the
contents on to the destination window. If this argument is true,
then the copying is non-destructive.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15">14. Miscellaneous features</h2>
<div class="outline-text-2" id="text-15">
<p>
Now you know enough features to write a good curses program, with
all bells and whistles. There are some miscellaneous functions which
are useful in various cases. Let's go headlong into some of those.
</p>
</div>

<div id="outline-container-sec-15-1" class="outline-3">
<h3 id="sec-15-1">14.1. <code>curs_set()</code></h3>
<div class="outline-text-3" id="text-15-1">
<p>
This function can be used to make the cursor invisible. The
parameter to this function should be
</p>

<pre class="example">
0 : invisible  or
1 : normal     or
2 : very visible.
</pre>
</div>
</div>

<div id="outline-container-sec-15-2" class="outline-3">
<h3 id="sec-15-2">14.2. Temporarily Leaving Curses mode</h3>
<div class="outline-text-3" id="text-15-2">
<p>
Some times you may want to get back to cooked mode (normal line
buffering mode) temporarily. In such a case you will first need to
save the tty modes with a call to <code>def_prog_mode()</code> and then call
<code>endwin()</code> to end the curses mode. This will leave you in the
original tty mode. To get back to curses once you are done, call
<code>reset_prog_mode()</code>. This function returns the tty to the state
stored by <code>def_prog_mode()</code>. Then do <code>refresh()</code>, and you are back
to the curses mode. Here is an example showing the sequence of
things to be done.
</p>

<p>
<a href="ncurses_programs/basics/temp_leave.c"><b>Example 12. Temporarily Leaving Curses Mode</b></a>
</p>

<div class="org-src-container">

<pre class="src src-c">#include &lt;ncurses.h&gt;
#include &lt;stdlib.h&gt;

int main()
{
  initscr();                      /* Start curses mode                   */
  printw("Hello World !!!\n");    /* Print Hello World                   */
  refresh();                      /* Print it on to the real screen      */
  getch();                        /* Wait                                */
  def_prog_mode();                /* Save the tty modes                  */
  endwin();                       /* End curses mode temporarily         */
  system("/bin/sh");              /* Do whatever you like in cooked mode */
  reset_prog_mode();              /* Return to the previous tty mode     */
                                  /* stored by def_prog_mode()           */
  refresh();                      /* Do refresh() to restore the         */
                                  /* Screen contents                     */
  printw("Another String\n");     /* Back to curses use the full         */
  refresh();                      /* capabilities of curses              */
  getch();                        /* Wait                                */
  endwin();                       /* End curses mode                     */

  return 0;
}
</pre>
</div>
</div>
</div>
