NCURSES-Programming-HOWTO.html

<div id="outline-container-sec-15-3" class="outline-3">
<h3 id="sec-15-3">14.3. <code>ACS_</code> variables</h3>
<div class="outline-text-3" id="text-15-3">
<p>
If you have ever programmed in DOS, you know about those nifty
characters in extended character set. They are printable only on
some terminals. NCURSES functions like <code>box()</code> use these
characters. All these variables start with <b>ACS</b> meaning
alternative character set. You might have noticed me using these
characters in some of the programs above. Here's an example showing
all the characters.
</p>

<p>
<a href="ncurses_programs/basics/acs_vars.c"><b>Example 13. ACS Variables Example</b></a>
</p>

<div class="org-src-container">

<pre class="src src-c">#include &lt;ncurses.h&gt;

int main()
{
  initscr();

  printw("Upper left corner           "); addch(ACS_ULCORNER); printw("\n");
  printw("Lower left corner           "); addch(ACS_LLCORNER); printw("\n");
  printw("Lower right corner          "); addch(ACS_LRCORNER); printw("\n");
  printw("Tee pointing right          "); addch(ACS_LTEE); printw("\n");
  printw("Tee pointing left           "); addch(ACS_RTEE); printw("\n");
  printw("Tee pointing up             "); addch(ACS_BTEE); printw("\n");
  printw("Tee pointing down           "); addch(ACS_TTEE); printw("\n");
  printw("Horizontal line             "); addch(ACS_HLINE); printw("\n");
  printw("Vertical line               "); addch(ACS_VLINE); printw("\n");
  printw("Large Plus or cross over    "); addch(ACS_PLUS); printw("\n");
  printw("Scan Line 1                 "); addch(ACS_S1); printw("\n");
  printw("Scan Line 3                 "); addch(ACS_S3); printw("\n");
  printw("Scan Line 7                 "); addch(ACS_S7); printw("\n");
  printw("Scan Line 9                 "); addch(ACS_S9); printw("\n");
  printw("Diamond                     "); addch(ACS_DIAMOND); printw("\n");
  printw("Checker board (stipple)     "); addch(ACS_CKBOARD); printw("\n");
  printw("Degree Symbol               "); addch(ACS_DEGREE); printw("\n");
  printw("Plus/Minus Symbol           "); addch(ACS_PLMINUS); printw("\n");
  printw("Bullet                      "); addch(ACS_BULLET); printw("\n");
  printw("Arrow Pointing Left         "); addch(ACS_LARROW); printw("\n");
  printw("Arrow Pointing Right        "); addch(ACS_RARROW); printw("\n");
  printw("Arrow Pointing Down         "); addch(ACS_DARROW); printw("\n");
  printw("Arrow Pointing Up           "); addch(ACS_UARROW); printw("\n");
  printw("Board of squares            "); addch(ACS_BOARD); printw("\n");
  printw("Lantern Symbol              "); addch(ACS_LANTERN); printw("\n");
  printw("Solid Square Block          "); addch(ACS_BLOCK); printw("\n");
  printw("Less/Equal sign             "); addch(ACS_LEQUAL); printw("\n");
  printw("Greater/Equal sign          "); addch(ACS_GEQUAL); printw("\n");
  printw("Pi                          "); addch(ACS_PI); printw("\n");
  printw("Not equal                   "); addch(ACS_NEQUAL); printw("\n");
  printw("UK pound sign               "); addch(ACS_STERLING); printw("\n");

  refresh();
  getch();
  endwin();

  return 0;
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16">15. Other libraries</h2>
<div class="outline-text-2" id="text-16">
<p>
Apart from the curses library, there are few text mode libraries,
which provide more functionality and a lot of features. The
following sections explain three standard libraries which are
usually distributed along with curses.
</p>
</div>
</div>

<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17">16. Panel Library</h2>
<div class="outline-text-2" id="text-17">
<p>
Now that you are proficient in curses, you wanted to do some thing
big.  You created a lot of overlapping windows to give a
professional windows-type look. Unfortunately, it soon becomes
difficult to manage these. The multiple refreshes, updates plunge
you into a nightmare. The overlapping windows create blotches,
whenever you forget to refresh the windows in the proper order.
</p>

<p>
Don't despair. There's an elegant solution provided in panels
library.  In the words of developers of ncurses
</p>

<div class="italic">
<p>
When your interface design is such that windows may dive deeper
into the visibility stack or pop to the top at runtime, the
resulting book-keeping can be tedious and difficult to get
right. Hence the panels library.
</p>

</div>

<p>
If you have lot of overlapping windows, then panels library is the
way to go. It obviates the need of doing series of <code>wnoutrefresh()</code>,
<code>doupdate()</code> and relieves the burden of doing it correctly(bottom
up). The library maintains information about the order of windows,
their overlapping and update the screen properly. So why wait? Let's
take a close peek into panels.
</p>
</div>

<div id="outline-container-sec-17-1" class="outline-3">
<h3 id="sec-17-1">16.1. The Basics</h3>
<div class="outline-text-3" id="text-17-1">
<p>
Panel object is a window that is implicitly treated as part of a
deck including all other panel objects. The deck is treated as a
stack with the top panel being completely visible and the other
panels may or may not be obscured according to their positions. So
the basic idea is to create a stack of overlapping panels and use
panels library to display them correctly. There is a function
similar to <code>refresh()</code> which, when called , displays panels in the
correct order. Functions are provided to hide or show panels, move
panels, change its size etc.. The overlapping problem is managed by
the panels library during all the calls to these functions.
</p>

<p>
The general flow of a panel program goes like this:
</p>

<ol class="org-ol">
<li>Create the windows (with <code>newwin()</code>) to be attached to the
panels.
</li>

<li>Create panels with the chosen visibility order. Stack them up
according to the desired visibility. The function <code>new_panel()</code>
is used to created panels.
</li>

<li>Call <code>update_panels()</code> to write the panels to the virtual screen
in correct visibility order. Do a <code>doupdate()</code> to show it on the
screen.
</li>

<li>Manipulate the panels with <code>show_panel()</code>, <code>hide_panel()</code>,
<code>move_panel()</code> etc. Make use of helper functions like
<code>panel_hidden()</code> and <code>panel_window()</code>. Make use of user pointer
to store custom data for a panel. Use the functions
<code>set_panel_userptr()</code> and <code>panel_userptr()</code> to set and get the
user pointer for a panel.
</li>

<li>When you are done with the panel use <code>del_panel()</code> to delete the
panel.
</li>
</ol>


<p>
Let's make the concepts clear, with some programs. The following is
a simple program which creates 3 overlapping panels and shows them
on the screen.
</p>
</div>
</div>
