NCURSES-Programming-HOWTO.html

<div id="outline-container-sec-17-2" class="outline-3">
<h3 id="sec-17-2">16.2. Compiling With the Panels Library</h3>
<div class="outline-text-3" id="text-17-2">
<p>
To use panels library functions, you have to include <code>panel.h</code> and
to link the program with panels library the flag <code>-lpanel</code> should
be added along with <code>-lncurses</code> in that order.
</p>

<pre class="example">
#include &lt;panel.h&gt;
.
.
.

compile and link: gcc &lt;program file&gt; -lpanel -lncurses
</pre>

<p>
<a href="ncurses_programs/panels/panel_simple.c"><b>Example 14. Panel basics</b></a>
</p>

<div class="org-src-container">

<pre class="src src-c">#include &lt;panel.h&gt;

int main()
{ WINDOW *my_wins[3];
  PANEL  *my_panels[3];
  int lines = 10, cols = 40, y = 2, x = 4, i;

  initscr();
  cbreak();
  noecho();

  /* Create windows for the panels */
  my_wins[0] = newwin(lines, cols, y, x);
  my_wins[1] = newwin(lines, cols, y + 1, x + 5);
  my_wins[2] = newwin(lines, cols, y + 2, x + 10);

  /*
   * Create borders around the windows so that you can see the effect
   * of panels
   */
  for(i = 0; i &lt; 3; ++i)
    box(my_wins[i], 0, 0);

  /* Attach a panel to each window */     /* Order is bottom up          */
  my_panels[0] = new_panel(my_wins[0]);   /* Push 0, order: stdscr-0     */
  my_panels[1] = new_panel(my_wins[1]);   /* Push 1, order: stdscr-0-1   */
  my_panels[2] = new_panel(my_wins[2]);   /* Push 2, order: stdscr-0-1-2 */

  /* Update the stacking order. 2nd panel will be on top */
  update_panels();

  /* Show it on the screen */
  doupdate();

  getch();
  endwin();
}
</pre>
</div>

<p>
As you can see, above program follows a simple flow as
explained. The windows are created with <code>newwin()</code> and then they
are attached to panels with <code>new_panel()</code>. As we attach one panel
after another, the stack of panels gets updated. To put them on
screen <code>update_panels()</code> and <code>doupdate()</code> are called.
</p>
</div>
</div>

<div id="outline-container-sec-17-3" class="outline-3">
<h3 id="sec-17-3">16.3. Panel Window Browsing</h3>
<div class="outline-text-3" id="text-17-3">
<p>
A slightly complicated example is given below. This program creates
3 windows which can be cycled through using tab. Have a look at the
code.
</p>

<p>
<a href="ncurses_programs/panels/panel_browse.c"><b>Example 15. Panel Window Browsing Example</b></a>
</p>

<div class="org-src-container">

<pre class="src src-c">#include &lt;panel.h&gt;
#include &lt;string.h&gt;

#define NLINES 10
#define NCOLS 40

void init_wins(WINDOW **wins, int n);
void win_show(WINDOW *win, char *label, int label_color);
void print_in_middle(WINDOW *win, int starty, int startx, int width, char *string, chtype color);

int main()
{ WINDOW *my_wins[3];
  PANEL  *my_panels[3];
  PANEL  *top;
  int ch;

  /* Initialize curses */
  initscr();
  start_color();
  cbreak();
  noecho();
  keypad(stdscr, TRUE);

  /* Initialize all the colors */
  init_pair(1, COLOR_RED,   COLOR_BLACK);
  init_pair(2, COLOR_GREEN, COLOR_BLACK);
  init_pair(3, COLOR_BLUE,  COLOR_BLACK);
  init_pair(4, COLOR_CYAN,  COLOR_BLACK);

  init_wins(my_wins, 3);

  /* Attach a panel to each window */     /* Order is bottom up          */
  my_panels[0] = new_panel(my_wins[0]);   /* Push 0, order: stdscr-0     */
  my_panels[1] = new_panel(my_wins[1]);   /* Push 1, order: stdscr-0-1   */
  my_panels[2] = new_panel(my_wins[2]);   /* Push 2, order: stdscr-0-1-2 */

  /* Set up the user pointers to the next panel */
  set_panel_userptr(my_panels[0], my_panels[1]);
  set_panel_userptr(my_panels[1], my_panels[2]);
  set_panel_userptr(my_panels[2], my_panels[0]);

  /* Update the stacking order. 2nd panel will be on top */
  update_panels();

  /* Show it on the screen */
  attron(COLOR_PAIR(4));
  mvprintw(LINES - 2, 0, "Use tab to browse through the windows (F1 to Exit)");
  attroff(COLOR_PAIR(4));
  doupdate();

  top = my_panels[2];
  while((ch = getch()) != KEY_F(1))
    {   switch(ch)
        {   case 9:
            top = (PANEL *)panel_userptr(top);
            top_panel(top);
            break;
        }
      update_panels();
      doupdate();
    }
  endwin();
  return 0;
}

/* Put all the windows */
void init_wins(WINDOW **wins, int n)
{ int x, y, i;
  char label[80];

  y = 2;
  x = 10;
  for(i = 0; i &lt; n; ++i)
    { wins[i] = newwin(NLINES, NCOLS, y, x);
      sprintf(label, "Window Number %d", i + 1);
      win_show(wins[i], label, i + 1);
      y += 3;
      x += 7;
    }
}

/* Show the window with a border and a label */
void win_show(WINDOW *win, char *label, int label_color)
{ int startx, starty, height, width;

  getbegyx(win, starty, startx);
  getmaxyx(win, height, width);

  box(win, 0, 0);
  mvwaddch(win, 2, 0, ACS_LTEE);
  mvwhline(win, 2, 1, ACS_HLINE, width - 2);
  mvwaddch(win, 2, width - 1, ACS_RTEE);

  print_in_middle(win, 1, 0, width, label, COLOR_PAIR(label_color));
}

void print_in_middle(WINDOW *win, int starty, int startx, int width, char *string, chtype color)
{ int length, x, y;
  float temp;

  if(win == NULL)
    win = stdscr;
  getyx(win, y, x);
  if(startx != 0)
    x = startx;
  if(starty != 0)
    y = starty;
  if(width == 0)
    width = 80;

  length = strlen(string);
  temp = (width - length)/ 2;
  x = startx + (int)temp;
  wattron(win, color);
  mvwprintw(win, y, x, "%s", string);
  wattroff(win, color);
  refresh();
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17-4" class="outline-3">
<h3 id="sec-17-4">16.4. Using User Pointers</h3>
<div class="outline-text-3" id="text-17-4">
<p>
In the above example I used user pointers to find out the next
window in the cycle. We can attach custom information to the panel
by specifying a user pointer, which can point to any information
you want to store. In this case I stored the pointer to the next
panel in the cycle. User pointer for a panel can be set with the
function <code>set_panel_userptr()</code>.  It can be accessed using the
function <code>panel_userptr()</code> which will return the user pointer for
the panel given as argument. After finding the next panel in the
cycle It's brought to the top by the function <code>top_panel()</code>. This
function brings the panel given as argument to the top of the panel
stack.
</p>
</div>
</div>
