NCURSES-Programming-HOWTO.html

<div id="outline-container-sec-17-5" class="outline-3">
<h3 id="sec-17-5">16.5. Moving and Resizing Panels</h3>
<div class="outline-text-3" id="text-17-5">
<p>
The function <code>move_panel()</code> can be used to move a panel to the
desired location. It does not change the position of the panel in
the stack.  Make sure that you use <code>move_panel()</code> instead <code>mvwin()</code>
on the window associated with the panel.
</p>

<p>
Resizing a panel is slightly complex. There is no straight forward
function just to resize the window associated with a panel. A
solution to resize a panel is to create a new window with the
desired sizes, change the window associated with the panel using
<code>replace_panel()</code>.  Don't forget to delete the old window. The
window associated with a panel can be found by using the function
<code>panel_window()</code>.
</p>

<p>
The following program shows these concepts, in supposedly simple
program. You can cycle through the window with &lt;TAB&gt; as usual. To
resize or move the active panel press 'r' for resize 'm' for
moving. Then use arrow keys to resize or move it to the desired way
and press enter to end your resizing or moving. This example makes
use of user data to get the required data to do the operations.
</p>

<p>
<a href="ncurses_programs/panels/panel_resize.c"><b>Example 16. Panel Moving and Resizing example</b></a>
</p>

<div class="org-src-container">

<pre class="src src-c">#include &lt;panel.h&gt;
#include &lt;stdlib.h&gt;
#include &lt;string.h&gt;

typedef struct _PANEL_DATA {
  int x, y, w, h;
  char label[80];
  int label_color;
  PANEL *next;
} PANEL_DATA;

#define NLINES 10
#define NCOLS 40

void init_wins(WINDOW **wins, int n);
void win_show(WINDOW *win, char *label, int label_color);
void print_in_middle(WINDOW *win, int starty, int startx, int width, char *string, chtype color);
void set_user_ptrs(PANEL **panels, int n);

int main()
{ WINDOW *my_wins[3];
  PANEL  *my_panels[3];
  PANEL_DATA  *top;
  PANEL *stack_top;
  WINDOW *temp_win, *old_win;
  int ch;
  int newx, newy, neww, newh;
  int size = FALSE, move = FALSE;

  /* Initialize curses */
  initscr();
  start_color();
  cbreak();
  noecho();
  keypad(stdscr, TRUE);

  /* Initialize all the colors */
  init_pair(1, COLOR_RED, COLOR_BLACK);
  init_pair(2, COLOR_GREEN, COLOR_BLACK);
  init_pair(3, COLOR_BLUE, COLOR_BLACK);
  init_pair(4, COLOR_CYAN, COLOR_BLACK);

  init_wins(my_wins, 3);

  /* Attach a panel to each window */     /* Order is bottom up          */
  my_panels[0] = new_panel(my_wins[0]);   /* Push 0, order: stdscr-0     */
  my_panels[1] = new_panel(my_wins[1]);   /* Push 1, order: stdscr-0-1   */
  my_panels[2] = new_panel(my_wins[2]);   /* Push 2, order: stdscr-0-1-2 */

  set_user_ptrs(my_panels, 3);
  /* Update the stacking order. 2nd panel will be on top */
  update_panels();

  /* Show it on the screen */
  attron(COLOR_PAIR(4));
  mvprintw(LINES - 3, 0, "Use 'm' for moving, 'r' for resizing");
  mvprintw(LINES - 2, 0, "Use tab to browse through the windows (F1 to Exit)");
  attroff(COLOR_PAIR(4));
  doupdate();

  stack_top = my_panels[2];
  top = (PANEL_DATA *)panel_userptr(stack_top);
  newx = top-&gt;x;
  newy = top-&gt;y;
  neww = top-&gt;w;
  newh = top-&gt;h;
  while((ch = getch()) != KEY_F(1))
    {   switch(ch)
        {   case 9:     /* Tab */
            top = (PANEL_DATA *)panel_userptr(stack_top);
            top_panel(top-&gt;next);
            stack_top = top-&gt;next;
            top = (PANEL_DATA *)panel_userptr(stack_top);
            newx = top-&gt;x;
            newy = top-&gt;y;
            neww = top-&gt;w;
            newh = top-&gt;h;
            break;
        case 'r':   /* Re-Size */
          size = TRUE;
          attron(COLOR_PAIR(4));
          mvprintw(LINES - 4, 0, "Entered Resizing: Use Arrow Keys to resize and press &lt;ENTER&gt; to end resizing");
          refresh();
          attroff(COLOR_PAIR(4));
          break;
        case 'm':   /* Move */
          attron(COLOR_PAIR(4));
          mvprintw(LINES - 4, 0, "Entered Moving: Use Arrow Keys to Move and press &lt;ENTER&gt; to end moving");
          refresh();
          attroff(COLOR_PAIR(4));
          move = TRUE;
          break;
        case KEY_LEFT:
          if(size == TRUE)
            { --newx;
              ++neww;
            }
          if(move == TRUE)
            --newx;
          break;
        case KEY_RIGHT:
          if(size == TRUE)
            { ++newx;
              --neww;
            }
          if(move == TRUE)
            ++newx;
          break;
        case KEY_UP:
          if(size == TRUE)
            { --newy;
              ++newh;
            }
          if(move == TRUE)
            --newy;
          break;
        case KEY_DOWN:
          if(size == TRUE)
            { ++newy;
              --newh;
            }
          if(move == TRUE)
            ++newy;
          break;
        case 10:    /* Enter */
          move(LINES - 4, 0);
          clrtoeol();
          refresh();
          if(size == TRUE)
            { old_win = panel_window(stack_top);
              temp_win = newwin(newh, neww, newy, newx);
              replace_panel(stack_top, temp_win);
              win_show(temp_win, top-&gt;label, top-&gt;label_color);
              delwin(old_win);
              size = FALSE;
            }
          if(move == TRUE)
            { move_panel(stack_top, newy, newx);
              move = FALSE;
            }
          break;

        }
      attron(COLOR_PAIR(4));
      mvprintw(LINES - 3, 0, "Use 'm' for moving, 'r' for resizing");
      mvprintw(LINES - 2, 0, "Use tab to browse through the windows (F1 to Exit)");
      attroff(COLOR_PAIR(4));
      refresh();
      update_panels();
      doupdate();
    }
  endwin();
  return 0;
}

/* Put all the windows */
void init_wins(WINDOW **wins, int n)
{ int x, y, i;
  char label[80];

  y = 2;
  x = 10;
  for(i = 0; i &lt; n; ++i)
    { wins[i] = newwin(NLINES, NCOLS, y, x);
      sprintf(label, "Window Number %d", i + 1);
      win_show(wins[i], label, i + 1);
      y += 3;
      x += 7;
    }
}

/* Set the PANEL_DATA structures for individual panels */
void set_user_ptrs(PANEL **panels, int n)
{ PANEL_DATA *ptrs;
  WINDOW *win;
  int x, y, w, h, i;
  char temp[80];

  ptrs = (PANEL_DATA *)calloc(n, sizeof(PANEL_DATA));

  for(i = 0;i &lt; n; ++i)
    { win = panel_window(panels[i]);
      getbegyx(win, y, x);
      getmaxyx(win, h, w);
      ptrs[i].x = x;
      ptrs[i].y = y;
      ptrs[i].w = w;
      ptrs[i].h = h;
      sprintf(temp, "Window Number %d", i + 1);
      strcpy(ptrs[i].label, temp);
      ptrs[i].label_color = i + 1;
      if(i + 1 == n)
        ptrs[i].next = panels[0];
      else
        ptrs[i].next = panels[i + 1];
      set_panel_userptr(panels[i], &amp;ptrs[i]);
    }
}

/* Show the window with a border and a label */
void win_show(WINDOW *win, char *label, int label_color)
{ int startx, starty, height, width;

  getbegyx(win, starty, startx);
  getmaxyx(win, height, width);

  box(win, 0, 0);
  mvwaddch(win, 2, 0, ACS_LTEE);
  mvwhline(win, 2, 1, ACS_HLINE, width - 2);
  mvwaddch(win, 2, width - 1, ACS_RTEE);

  print_in_middle(win, 1, 0, width, label, COLOR_PAIR(label_color));
}

void print_in_middle(WINDOW *win, int starty, int startx, int width, char *string, chtype color)
{ int length, x, y;
  float temp;

  if(win == NULL)
    win = stdscr;
  getyx(win, y, x);
  if(startx != 0)
    x = startx;
  if(starty != 0)
    y = starty;
  if(width == 0)
    width = 80;

  length = strlen(string);
  temp = (width - length)/ 2;
  x = startx + (int)temp;
  wattron(win, color);
  mvwprintw(win, y, x, "%s", string);
  wattroff(win, color);
  refresh();
}
</pre>
</div>

<p>
Concentrate on the main while loop. Once it finds out the type of
key pressed, it takes appropriate action. If 'r' is pressed
resizing mode is started. After this the new sizes are updated as
the user presses the arrow keys. When the user presses &lt;ENTER&gt;
present selection ends and panel is resized by using the concept
explained. While in resizing mode the program doesn't show how the
window is getting resized. It's left as an exercise to the reader
to print a dotted border while it gets resized to a new position.
</p>

<p>
When the user presses 'm' the move mode starts. This is a bit
simpler than resizing. As the arrow keys are pressed the new
position is updated and pressing of &lt;ENTER&gt; causes the panel to be
moved by calling the function <code>move_panel()</code>.
</p>

<p>
In this program the user data which is represented as <code>PANEL_DATA</code>,
plays very important role in finding the associated information
with a panel.  As written in the comments, the <code>PANEL_DATA</code> stores
the panel sizes, label, label color and a pointer to the next panel
in the cycle.
</p>
</div>
</div>
