NCURSES-Programming-HOWTO.html

<div id="outline-container-sec-17-6" class="outline-3">
<h3 id="sec-17-6">16.6. Hiding and Showing Panels</h3>
<div class="outline-text-3" id="text-17-6">
<p>
A Panel can be hidden by using the function <code>hide_panel()</code>. This
function merely removes it form the stack of panels, thus hiding it
on the screen once you do <code>update_panels()</code> and <code>doupdate()</code>. It
doesn't destroy the <code>PANEL</code> structure associated with the hidden
panel. It can be shown again by using the <code>show_panel()</code> function.
</p>

<p>
The following program shows the hiding of panels. Press 'a' or 'b'
or 'c' to show or hide first, second and third windows
respectively. It uses a user data with a small variable <code>hide</code>,
which keeps track of whether the window is hidden or not. For some
reason the function <code>panel_hidden()</code> which tells whether a panel is
hidden or not is not working. A bug report was also presented by
Michael Andres <a href="http://www.geocrawler.com/archives/3/344/1999/9/0/2643549/">here</a>
</p>

<p>
<a href="ncurses_programs/panels/panel_hide.c"><b>Example 17. Panel Hiding and Showing example</b></a>
</p>

<div class="org-src-container">

<pre class="src src-c">#include &lt;panel.h&gt;
#include &lt;string.h&gt;

typedef struct _PANEL_DATA {
  int hide;   /* TRUE if panel is hidden */
}PANEL_DATA;

#define NLINES 10
#define NCOLS 40

void init_wins(WINDOW **wins, int n);
void win_show(WINDOW *win, char *label, int label_color);
void print_in_middle(WINDOW *win, int starty, int startx, int width, char *string, chtype color);

int main()
{ WINDOW *my_wins[3];
  PANEL  *my_panels[3];
  PANEL_DATA panel_datas[3];
  PANEL_DATA *temp;
  int ch;

  /* Initialize curses */
  initscr();
  start_color();
  cbreak();
  noecho();
  keypad(stdscr, TRUE);

  /* Initialize all the colors */
  init_pair(1, COLOR_RED, COLOR_BLACK);
  init_pair(2, COLOR_GREEN, COLOR_BLACK);
  init_pair(3, COLOR_BLUE, COLOR_BLACK);
  init_pair(4, COLOR_CYAN, COLOR_BLACK);

  init_wins(my_wins, 3);

  /* Attach a panel to each window */     /* Order is bottom up          */
  my_panels[0] = new_panel(my_wins[0]);   /* Push 0, order: stdscr-0     */
  my_panels[1] = new_panel(my_wins[1]);   /* Push 1, order: stdscr-0-1   */
  my_panels[2] = new_panel(my_wins[2]);   /* Push 2, order: stdscr-0-1-2 */

  /* Initialize panel datas saying that nothing is hidden */
  panel_datas[0].hide = FALSE;
  panel_datas[1].hide = FALSE;
  panel_datas[2].hide = FALSE;

  set_panel_userptr(my_panels[0], &amp;panel_datas[0]);
  set_panel_userptr(my_panels[1], &amp;panel_datas[1]);
  set_panel_userptr(my_panels[2], &amp;panel_datas[2]);

  /* Update the stacking order. 2nd panel will be on top */
  update_panels();

  /* Show it on the screen */
  attron(COLOR_PAIR(4));
  mvprintw(LINES - 3, 0, "Show or Hide a window with 'a'(first window)  'b'(Second Window)  'c'(Third Window)");
  mvprintw(LINES - 2, 0, "F1 to Exit");

  attroff(COLOR_PAIR(4));
  doupdate();

  while((ch = getch()) != KEY_F(1))
    {   switch(ch)
        {   case 'a':
            temp = (PANEL_DATA *)panel_userptr(my_panels[0]);
            if(temp-&gt;hide == FALSE)
              { hide_panel(my_panels[0]);
                temp-&gt;hide = TRUE;
              }
            else
              { show_panel(my_panels[0]);
                temp-&gt;hide = FALSE;
              }
            break;
        case 'b':
          temp = (PANEL_DATA *)panel_userptr(my_panels[1]);
          if(temp-&gt;hide == FALSE)
            { hide_panel(my_panels[1]);
              temp-&gt;hide = TRUE;
            }
          else
            { show_panel(my_panels[1]);
              temp-&gt;hide = FALSE;
            }
          break;
        case 'c':
          temp = (PANEL_DATA *)panel_userptr(my_panels[2]);
          if(temp-&gt;hide == FALSE)
            { hide_panel(my_panels[2]);
              temp-&gt;hide = TRUE;
            }
          else
            {   show_panel(my_panels[2]);
              temp-&gt;hide = FALSE;
            }
          break;
        }
      update_panels();
      doupdate();
    }
  endwin();
  return 0;
}

/* Put all the windows */
void init_wins(WINDOW **wins, int n)
{ int x, y, i;
  char label[80];

  y = 2;
  x = 10;
  for(i = 0; i &lt; n; ++i)
    { wins[i] = newwin(NLINES, NCOLS, y, x);
      sprintf(label, "Window Number %d", i + 1);
      win_show(wins[i], label, i + 1);
      y += 3;
      x += 7;
    }
}

/* Show the window with a border and a label */
void win_show(WINDOW *win, char *label, int label_color)
{ int startx, starty, height, width;

  getbegyx(win, starty, startx);
  getmaxyx(win, height, width);

  box(win, 0, 0);
  mvwaddch(win, 2, 0, ACS_LTEE);
  mvwhline(win, 2, 1, ACS_HLINE, width - 2);
  mvwaddch(win, 2, width - 1, ACS_RTEE);

  print_in_middle(win, 1, 0, width, label, COLOR_PAIR(label_color));
}

void print_in_middle(WINDOW *win, int starty, int startx, int width, char *string, chtype color)
{ int length, x, y;
  float temp;

  if(win == NULL)
    win = stdscr;
  getyx(win, y, x);
  if(startx != 0)
    x = startx;
  if(starty != 0)
    y = starty;
  if(width == 0)
    width = 80;

  length = strlen(string);
  temp = (width - length)/ 2;
  x = startx + (int)temp;
  wattron(win, color);
  mvwprintw(win, y, x, "%s", string);
  wattroff(win, color);
  refresh();
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17-7" class="outline-3">
<h3 id="sec-17-7">16.7. <code>panel_above()</code> and <code>panel_below()</code> Functions</h3>
<div class="outline-text-3" id="text-17-7">
<p>
The functions <code>panel_above()</code> and <code>panel_below()</code> can be used to
find out the panel above and below a panel. If the argument to
these functions is <code>NULL</code>, then they return a pointer to bottom
panel and top panel respectively.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18">17. Menus Library</h2>
<div class="outline-text-2" id="text-18">
<p>
The menus library provides a nice extension to basic curses, through
which you can create menus. It provides a set of functions to create
menus. But they have to be customized to give a nicer look, with
colors etc. Let's get into the details.
</p>

<p>
A menu is a screen display that assists the user to choose some
subset of a given set of items. To put it simple, a menu is a
collection of items from which one or more items can be chosen. Some
readers might not be aware of multiple item selection
capability. Menu library provides functionality to write menus from
which the user can chose more than one item as the preferred
choice. This is dealt with in a later section. Now it is time for
some rudiments.
</p>
</div>

<div id="outline-container-sec-18-1" class="outline-3">
<h3 id="sec-18-1">17.1. The Basics</h3>
<div class="outline-text-3" id="text-18-1">
<p>
To create menus, you first create items, and then post the menu to
the display. After that, all the processing of user responses is
done in an elegant function <code>menu_driver()</code> which is the work horse
of any menu program.
</p>

<p>
The general flow of control of a menu program looks like this.
</p>

<ol class="org-ol">
<li>Initialize curses
</li>

<li>Create items using <code>new_item()</code>. You can specify a name and
description for the items.
</li>

<li>Create the menu with <code>new_menu()</code> by specifying the items to be
attached with.
</li>

<li>Post the menu with <code>menu_post()</code> and refresh the screen.
</li>

<li>Process the user requests with a loop and do necessary updates
to menu with <code>menu_driver</code>.
</li>

<li>Unpost the menu with <code>menu_unpost()</code>
</li>

<li>Free the memory allocated to menu by <code>free_menu()</code>
</li>

<li>Free the memory allocated to the items with <code>free_item()</code>
</li>

<li>End curses
</li>
</ol>


<p>
Let's see a program which prints a simple menu and updates the
current selection with up, down arrows.
</p>
</div>
</div>
