NCURSES-Programming-HOWTO.org
** 17.2. Compiling With the Menu Library

   To use menu library functions, you have to include =menu.h= and to
   link the program with menu library the flag =-lmenu= should be
   added along with =-lncurses= in that order.

   #+BEGIN_EXAMPLE
     #include <menu.h>
     .
     .
     .

     compile and link: gcc <program file> -lmenu -lncurses
   #+END_EXAMPLE

   [[file:ncurses_programs/menus/menu_simple.c][*Example 18. Menu Basics*]]

   #+BEGIN_SRC c
     #include <stdlib.h>
     #include <curses.h>
     #include <menu.h>

     #define ARRAY_SIZE(a) (sizeof(a) / sizeof(a[0]))
     #define CTRLD   4

     char *choices[] = {
       "Choice 1",
       "Choice 2",
       "Choice 3",
       "Choice 4",
       "Exit",
     };

     int main()
     { ITEM **my_items;
       int c;
       MENU *my_menu;
       int n_choices, i;
       ITEM *cur_item;


       initscr();
       cbreak();
       noecho();
       keypad(stdscr, TRUE);

       n_choices = ARRAY_SIZE(choices);
       my_items = (ITEM **)calloc(n_choices + 1, sizeof(ITEM *));

       for(i = 0; i < n_choices; ++i)
         my_items[i] = new_item(choices[i], choices[i]);
       my_items[n_choices] = (ITEM *)NULL;

       my_menu = new_menu((ITEM **)my_items);
       mvprintw(LINES - 2, 0, "F1 to Exit");
       post_menu(my_menu);
       refresh();

       while((c = getch()) != KEY_F(1))
         {   switch(c)
             {   case KEY_DOWN:
                 menu_driver(my_menu, REQ_DOWN_ITEM);
                 break;
             case KEY_UP:
               menu_driver(my_menu, REQ_UP_ITEM);
               break;
             }
         }

       free_item(my_items[0]);
       free_item(my_items[1]);
       free_menu(my_menu);
       endwin();
     }
   #+END_SRC

   This program demonstrates the basic concepts involved in creating a
   menu using menus library. First we create the items using
   =new_item()= and then attach them to the menu with =new_menu()=
   function. After posting the menu and refreshing the screen, the
   main processing loop starts. It reads user input and takes
   corresponding action. The function =menu_driver()= is the main work
   horse of the menu system. The second parameter to this function
   tells what's to be done with the menu.  According to the parameter,
   =menu_driver()= does the corresponding task.  The value can be
   either a menu navigational request, an ascii character, or a
   =KEY_MOUSE= special key associated with a mouse event.

   The =menu_driver= accepts following navigational requests.

   #+BEGIN_EXAMPLE
     REQ_LEFT_ITEM       Move left to an item.
     REQ_RIGHT_ITEM      Move right to an item.
     REQ_UP_ITEM         Move up to an item.
     REQ_DOWN_ITEM       Move down to an item.
     REQ_SCR_ULINE       Scroll up a line.
     REQ_SCR_DLINE       Scroll down a line.
     REQ_SCR_DPAGE       Scroll down a page.
     REQ_SCR_UPAGE       Scroll up a page.
     REQ_FIRST_ITEM      Move to the first item.
     REQ_LAST_ITEM       Move to the last item.
     REQ_NEXT_ITEM       Move to the next item.
     REQ_PREV_ITEM       Move to the previous item.
     REQ_TOGGLE_ITEM     Select/deselect an item.
     REQ_CLEAR_PATTERN   Clear the menu pattern buffer.
     REQ_BACK_PATTERN    Delete the previous character from the pattern buffer.
     REQ_NEXT_MATCH      Move to the next item matching the pattern match.
     REQ_PREV_MATCH      Move to the previous item matching the pattern match.
   #+END_EXAMPLE

   Don't get overwhelmed by the number of options. We will see them
   slowly one after another. The options of interest in this example
   are =REQ_UP_ITEM= and =REQ_DOWN_ITEM=. These two options when
   passed to =menu_driver=, menu driver updates the current item to
   one item up or down respectively.

** 17.3. Menu Driver: The work horse of the menu system

   As you have seen in the above example, =menu_driver= plays an
   important role in updating the menu. It is very important to
   understand various options it takes and what they do. As explained
   above, the second parameter to =menu_driver()= can be either a
   navigational request, a printable character or a =KEY_MOUSE=
   key. Let's dissect the different navigational requests.

   - =REQ_LEFT_ITEM= and =REQ_RIGHT_ITEM=

     A Menu can be displayed with multiple columns for more than one
     item.  This can be done by using the =menu_format()=
     function. When a multi columnar menu is displayed these requests
     cause the menu driver to move the current selection to left or
     right.

   - =REQ_UP_ITEM= and =REQ_DOWN_ITEM=

     These two options you have seen in the above example. These
     options when given, makes the =menu_driver= to move the current
     selection to an item up or down.

   - =REQ_SCR_*= options

     The four options =REQ_SCR_ULINE=, =REQ_SCR_DLINE=,
     =REQ_SCR_DPAGE=, =REQ_SCR_UPAGE= are related to scrolling. If all
     the items in the menu cannot be displayed in the menu sub window,
     then the menu is scrollable. These requests can be given to the
     =menu_driver= to do the scrolling either one line up, down or one
     page down or up respectively.

   - =REQ_FIRST_ITEM=, =REQ_LAST_ITEM=, =REQ_NEXT_ITEM= and
     =REQ_PREV_ITEM=

     These requests are self explanatory.

   - =REQ_TOGGLE_ITEM=

     This request when given, toggles the present selection. This
     option is to be used only in a multi valued menu. So to use this
     request the option =O_ONEVALUE= must be off. This option can be
     made off or on with =set_menu_opts()=.

   - /Pattern Requests/

     Every menu has an associated pattern buffer, which is used to
     find the nearest match to the ascii characters entered by the
     user.  Whenever ascii characters are given to =menu_driver=, it
     puts in to the pattern buffer. It also tries to find the nearest
     match to the pattern in the items list and moves current
     selection to that item.  The request =REQ_CLEAR_PATTERN= clears
     the pattern buffer. The request =REQ_BACK_PATTERN= deletes the
     previous character in the pattern buffer. In case the pattern
     matches more than one item then the matched items can be cycled
     through =REQ_NEXT_MATCH= and =REQ_PREV_MATCH= which move the
     current selection to the next and previous matches respectively.

   - /Mouse Requests/

     In case of =KEY_MOUSE= requests, according to the mouse position
     an action is taken accordingly. The action to be taken is
     explained in the man page as,

     #+BEGIN_QUOTE
       If the second argument is the =KEY_MOUSE= special key, the
       associated mouse event is translated into one of the above
       pre-defined requests.  Currently only clicks in the user window
       (e.g. inside the menu display area or the decoration window)
       are handled. If you click above the display region of the menu,
       a =REQ_SCR_ULINE= is generated, if you doubleclick a
       =REQ_SCR_UPAGE= is generated and if you tripleclick a
       =REQ_FIRST_ITEM= is generated.  If you click below the display
       region of the menu, a =REQ_SCR_DLINE= is generated, if you
       doubleclick a =REQ_SCR_DPAGE= is generated and if you
       tripleclick a =REQ_LAST_ITEM= is generated. If you click at an
       item inside the display area of the menu, the menu cursor is
       positioned to that item.
     #+END_QUOTE


   Each of the above requests will be explained in the following lines
   with several examples whenever appropriate.

