NCURSES-Programming-HOWTO.html

<div id="outline-container-sec-18-2" class="outline-3">
<h3 id="sec-18-2">17.2. Compiling With the Menu Library</h3>
<div class="outline-text-3" id="text-18-2">
<p>
To use menu library functions, you have to include <code>menu.h</code> and to
link the program with menu library the flag <code>-lmenu</code> should be
added along with <code>-lncurses</code> in that order.
</p>

<pre class="example">
#include &lt;menu.h&gt;
.
.
.

compile and link: gcc &lt;program file&gt; -lmenu -lncurses
</pre>

<p>
<a href="ncurses_programs/menus/menu_simple.c"><b>Example 18. Menu Basics</b></a>
</p>

<div class="org-src-container">

<pre class="src src-c">#include &lt;stdlib.h&gt;
#include &lt;curses.h&gt;
#include &lt;menu.h&gt;

#define ARRAY_SIZE(a) (sizeof(a) / sizeof(a[0]))
#define CTRLD   4

char *choices[] = {
  "Choice 1",
  "Choice 2",
  "Choice 3",
  "Choice 4",
  "Exit",
};

int main()
{ ITEM **my_items;
  int c;
  MENU *my_menu;
  int n_choices, i;
  ITEM *cur_item;


  initscr();
  cbreak();
  noecho();
  keypad(stdscr, TRUE);

  n_choices = ARRAY_SIZE(choices);
  my_items = (ITEM **)calloc(n_choices + 1, sizeof(ITEM *));

  for(i = 0; i &lt; n_choices; ++i)
    my_items[i] = new_item(choices[i], choices[i]);
  my_items[n_choices] = (ITEM *)NULL;

  my_menu = new_menu((ITEM **)my_items);
  mvprintw(LINES - 2, 0, "F1 to Exit");
  post_menu(my_menu);
  refresh();

  while((c = getch()) != KEY_F(1))
    {   switch(c)
        {   case KEY_DOWN:
            menu_driver(my_menu, REQ_DOWN_ITEM);
            break;
        case KEY_UP:
          menu_driver(my_menu, REQ_UP_ITEM);
          break;
        }
    }

  free_item(my_items[0]);
  free_item(my_items[1]);
  free_menu(my_menu);
  endwin();
}
</pre>
</div>

<p>
This program demonstrates the basic concepts involved in creating a
menu using menus library. First we create the items using
<code>new_item()</code> and then attach them to the menu with <code>new_menu()</code>
function. After posting the menu and refreshing the screen, the
main processing loop starts. It reads user input and takes
corresponding action. The function <code>menu_driver()</code> is the main work
horse of the menu system. The second parameter to this function
tells what's to be done with the menu.  According to the parameter,
<code>menu_driver()</code> does the corresponding task.  The value can be
either a menu navigational request, an ascii character, or a
<code>KEY_MOUSE</code> special key associated with a mouse event.
</p>

<p>
The <code>menu_driver</code> accepts following navigational requests.
</p>

<pre class="example">
REQ_LEFT_ITEM       Move left to an item.
REQ_RIGHT_ITEM      Move right to an item.
REQ_UP_ITEM         Move up to an item.
REQ_DOWN_ITEM       Move down to an item.
REQ_SCR_ULINE       Scroll up a line.
REQ_SCR_DLINE       Scroll down a line.
REQ_SCR_DPAGE       Scroll down a page.
REQ_SCR_UPAGE       Scroll up a page.
REQ_FIRST_ITEM      Move to the first item.
REQ_LAST_ITEM       Move to the last item.
REQ_NEXT_ITEM       Move to the next item.
REQ_PREV_ITEM       Move to the previous item.
REQ_TOGGLE_ITEM     Select/deselect an item.
REQ_CLEAR_PATTERN   Clear the menu pattern buffer.
REQ_BACK_PATTERN    Delete the previous character from the pattern buffer.
REQ_NEXT_MATCH      Move to the next item matching the pattern match.
REQ_PREV_MATCH      Move to the previous item matching the pattern match.
</pre>

<p>
Don't get overwhelmed by the number of options. We will see them
slowly one after another. The options of interest in this example
are <code>REQ_UP_ITEM</code> and <code>REQ_DOWN_ITEM</code>. These two options when
passed to <code>menu_driver</code>, menu driver updates the current item to
one item up or down respectively.
</p>
</div>
</div>

<div id="outline-container-sec-18-3" class="outline-3">
<h3 id="sec-18-3">17.3. Menu Driver: The work horse of the menu system</h3>
<div class="outline-text-3" id="text-18-3">
<p>
As you have seen in the above example, <code>menu_driver</code> plays an
important role in updating the menu. It is very important to
understand various options it takes and what they do. As explained
above, the second parameter to <code>menu_driver()</code> can be either a
navigational request, a printable character or a <code>KEY_MOUSE</code>
key. Let's dissect the different navigational requests.
</p>

<ul class="org-ul">
<li><code>REQ_LEFT_ITEM</code> and <code>REQ_RIGHT_ITEM</code>

<p>
A Menu can be displayed with multiple columns for more than one
item.  This can be done by using the <code>menu_format()</code>
function. When a multi columnar menu is displayed these requests
cause the menu driver to move the current selection to left or
right.
</p>
</li>

<li><code>REQ_UP_ITEM</code> and <code>REQ_DOWN_ITEM</code>

<p>
These two options you have seen in the above example. These
options when given, makes the <code>menu_driver</code> to move the current
selection to an item up or down.
</p>
</li>

<li><code>REQ_SCR_*</code> options

<p>
The four options <code>REQ_SCR_ULINE</code>, <code>REQ_SCR_DLINE</code>,
<code>REQ_SCR_DPAGE</code>, <code>REQ_SCR_UPAGE</code> are related to scrolling. If all
the items in the menu cannot be displayed in the menu sub window,
then the menu is scrollable. These requests can be given to the
<code>menu_driver</code> to do the scrolling either one line up, down or one
page down or up respectively.
</p>
</li>

<li><code>REQ_FIRST_ITEM</code>, <code>REQ_LAST_ITEM</code>, <code>REQ_NEXT_ITEM</code> and
<code>REQ_PREV_ITEM</code>

<p>
These requests are self explanatory.
</p>
</li>

<li><code>REQ_TOGGLE_ITEM</code>

<p>
This request when given, toggles the present selection. This
option is to be used only in a multi valued menu. So to use this
request the option <code>O_ONEVALUE</code> must be off. This option can be
made off or on with <code>set_menu_opts()</code>.
</p>
</li>

<li><i>Pattern Requests</i>

<p>
Every menu has an associated pattern buffer, which is used to
find the nearest match to the ascii characters entered by the
user.  Whenever ascii characters are given to <code>menu_driver</code>, it
puts in to the pattern buffer. It also tries to find the nearest
match to the pattern in the items list and moves current
selection to that item.  The request <code>REQ_CLEAR_PATTERN</code> clears
the pattern buffer. The request <code>REQ_BACK_PATTERN</code> deletes the
previous character in the pattern buffer. In case the pattern
matches more than one item then the matched items can be cycled
through <code>REQ_NEXT_MATCH</code> and <code>REQ_PREV_MATCH</code> which move the
current selection to the next and previous matches respectively.
</p>
</li>

<li><i>Mouse Requests</i>

<p>
In case of <code>KEY_MOUSE</code> requests, according to the mouse position
an action is taken accordingly. The action to be taken is
explained in the man page as,
</p>

<blockquote>
<p>
If the second argument is the <code>KEY_MOUSE</code> special key, the
associated mouse event is translated into one of the above
pre-defined requests.  Currently only clicks in the user window
(e.g. inside the menu display area or the decoration window)
are handled. If you click above the display region of the menu,
a <code>REQ_SCR_ULINE</code> is generated, if you doubleclick a
<code>REQ_SCR_UPAGE</code> is generated and if you tripleclick a
<code>REQ_FIRST_ITEM</code> is generated.  If you click below the display
region of the menu, a <code>REQ_SCR_DLINE</code> is generated, if you
doubleclick a <code>REQ_SCR_DPAGE</code> is generated and if you
tripleclick a <code>REQ_LAST_ITEM</code> is generated. If you click at an
item inside the display area of the menu, the menu cursor is
positioned to that item.
</p>
</blockquote>
</li>
</ul>


<p>
Each of the above requests will be explained in the following lines
with several examples whenever appropriate.
</p>
</div>
</div>
