NCURSES-Programming-HOWTO.org
** 17.4. Menu Windows

   Every menu created is associated with a window and a sub
   window. The menu window displays any title or border associated
   with the menu. The menu sub window displays the menu items
   currently available for selection. But we didn't specify any window
   or sub window in the simple example. When a window is not
   specified, =stdscr= is taken as the main window, and then menu system
   calculates the sub window size required for the display of
   items. Then items are displayed in the calculated sub window. So
   let's play with these windows and display a menu with a border and
   a title.

   [[file:ncurses_programs/menus/menu_win.c][*Example 19. Menu Windows Usage example*]]

   #+BEGIN_SRC c
     #include <menu.h>
     #include <stdlib.h>
     #include <string.h>

     #define ARRAY_SIZE(a) (sizeof(a) / sizeof(a[0]))
     #define CTRLD   4

     char *choices[] = {
       "Choice 1",
       "Choice 2",
       "Choice 3",
       "Choice 4",
       "Exit",
       (char *)NULL,
     };
     void print_in_middle(WINDOW *win, int starty, int startx, int width, char *string, chtype color);

     int main()
     { ITEM **my_items;
       int c;
       MENU *my_menu;
       WINDOW *my_menu_win;
       int n_choices, i;

       /* Initialize curses */
       initscr();
       start_color();
       cbreak();
       noecho();
       keypad(stdscr, TRUE);
       init_pair(1, COLOR_RED, COLOR_BLACK);

       /* Create items */
       n_choices = ARRAY_SIZE(choices);
       my_items = (ITEM **)calloc(n_choices, sizeof(ITEM *));
       for(i = 0; i < n_choices; ++i)
         my_items[i] = new_item(choices[i], choices[i]);

       /* Crate menu */
       my_menu = new_menu((ITEM **)my_items);

       /* Create the window to be associated with the menu */
       my_menu_win = newwin(10, 40, 4, 4);
       keypad(my_menu_win, TRUE);

       /* Set main window and sub window */
       set_menu_win(my_menu, my_menu_win);
       set_menu_sub(my_menu, derwin(my_menu_win, 6, 38, 3, 1));

       /* Set menu mark to the string " * " */
       set_menu_mark(my_menu, " * ");

       /* Print a border around the main window and print a title */
       box(my_menu_win, 0, 0);
       print_in_middle(my_menu_win, 1, 0, 40, "My Menu", COLOR_PAIR(1));
       mvwaddch(my_menu_win, 2, 0, ACS_LTEE);
       mvwhline(my_menu_win, 2, 1, ACS_HLINE, 38);
       mvwaddch(my_menu_win, 2, 39, ACS_RTEE);
       mvprintw(LINES - 2, 0, "F1 to exit");
       refresh();

       /* Post the menu */
       post_menu(my_menu);
       wrefresh(my_menu_win);

       while((c = wgetch(my_menu_win)) != KEY_F(1)){
         switch(c){
         case KEY_DOWN:
           menu_driver(my_menu, REQ_DOWN_ITEM);
           break;
         case KEY_UP:
           menu_driver(my_menu, REQ_UP_ITEM);
           break;
         }
         wrefresh(my_menu_win);
       }

       /* Unpost and free all the memory taken up */
       unpost_menu(my_menu);
       free_menu(my_menu);
       for(i = 0; i < n_choices; ++i)
         free_item(my_items[i]);
       endwin();
     }

     void print_in_middle(WINDOW *win, int starty, int startx, int width, char *string, chtype color)
     { int length, x, y;
       float temp;

       if(win == NULL)
         win = stdscr;
       getyx(win, y, x);
       if(startx != 0)
         x = startx;
       if(starty != 0)
         y = starty;
       if(width == 0)
         width = 80;

       length = strlen(string);
       temp = (width - length)/ 2;
       x = startx + (int)temp;
       wattron(win, color);
       mvwprintw(win, y, x, "%s", string);
       wattroff(win, color);
       refresh();
     }
   #+END_SRC

   This example creates a menu with a title, border, a fancy line
   separating title and the items. As you can see, in order to attach
   a window to a menu the function =set_menu_win()= has to be
   used. Then we attach the sub window also. This displays the items
   in the sub window.  You can also set the mark string which gets
   displayed to the left of the selected item with =set_menu_mark()=.

