NCURSES-Programming-HOWTO.html

<div id="outline-container-sec-18-6" class="outline-3">
<h3 id="sec-18-6">17.6. Multi Columnar Menus</h3>
<div class="outline-text-3" id="text-18-6">
<p>
In the above example you have seen how to use the function
<code>set_menu_format()</code>. I didn't mention what the <code>cols</code> variable
(third parameter) does. Well, If your sub window is wide enough,
you can opt to display more than one item per row. This can be
specified in the <code>cols</code> variable. To make things simpler, the
following example doesn't show descriptions for the items.
</p>

<p>
<a href="ncurses_programs/menus/menu_multi_column.c"><b>Example 21. Milt Columnar Menus Example</b></a>
</p>

<div class="org-src-container">

<pre class="src src-c">#include &lt;curses.h&gt;
#include &lt;menu.h&gt;
#include &lt;stdlib.h&gt;

#define ARRAY_SIZE(a) (sizeof(a) / sizeof(a[0]))
#define CTRLD   4

char *choices[] = {
  "Choice 1",  "Choice 2",  "Choice 3",  "Choice 4",  "Choice 5",
  "Choice 6",  "Choice 7",  "Choice 8",  "Choice 9",  "Choice 10",
  "Choice 11", "Choice 12", "Choice 13", "Choice 14", "Choice 15",
  "Choice 16", "Choice 17", "Choice 18", "Choice 19", "Choice 20",
  "Exit",
  (char *)NULL,
};

int main(){
  ITEM **my_items;
  int c;
  MENU *my_menu;
  WINDOW *my_menu_win;
  int n_choices, i;

  /* Initialize curses */
  initscr();
  start_color();
  cbreak();
  noecho();
  keypad(stdscr, TRUE);
  init_pair(1, COLOR_RED, COLOR_BLACK);
  init_pair(2, COLOR_CYAN, COLOR_BLACK);

  /* Create items */
  n_choices = ARRAY_SIZE(choices);
  my_items = (ITEM **)calloc(n_choices, sizeof(ITEM *));
  for(i = 0; i &lt; n_choices; ++i)
    my_items[i] = new_item(choices[i], choices[i]);

  /* Crate menu */
  my_menu = new_menu((ITEM **)my_items);

  /* Set menu option not to show the description */
  menu_opts_off(my_menu, O_SHOWDESC);

  /* Create the window to be associated with the menu */
  my_menu_win = newwin(10, 70, 4, 4);
  keypad(my_menu_win, TRUE);

  /* Set main window and sub window */
  set_menu_win(my_menu, my_menu_win);
  set_menu_sub(my_menu, derwin(my_menu_win, 6, 68, 3, 1));
  set_menu_format(my_menu, 5, 3);
  set_menu_mark(my_menu, " * ");

  /* Print a border around the main window and print a title */
  box(my_menu_win, 0, 0);

  attron(COLOR_PAIR(2));
  mvprintw(LINES - 3, 0, "Use PageUp and PageDown to scroll");
  mvprintw(LINES - 2, 0, "Use Arrow Keys to navigate (F1 to Exit)");
  attroff(COLOR_PAIR(2));
  refresh();

  /* Post the menu */
  post_menu(my_menu);
  wrefresh(my_menu_win);

  while((c = wgetch(my_menu_win)) != KEY_F(1)){
    switch(c){
    case KEY_DOWN:
      menu_driver(my_menu, REQ_DOWN_ITEM);
      break;
    case KEY_UP:
      menu_driver(my_menu, REQ_UP_ITEM);
      break;
    case KEY_LEFT:
      menu_driver(my_menu, REQ_LEFT_ITEM);
      break;
    case KEY_RIGHT:
      menu_driver(my_menu, REQ_RIGHT_ITEM);
      break;
    case KEY_NPAGE:
      menu_driver(my_menu, REQ_SCR_DPAGE);
      break;
    case KEY_PPAGE:
      menu_driver(my_menu, REQ_SCR_UPAGE);
      break;
    }
    wrefresh(my_menu_win);
  }

  /* Unpost and free all the memory taken up */
  unpost_menu(my_menu);
  free_menu(my_menu);
  for(i = 0; i &lt; n_choices; ++i)
    free_item(my_items[i]);
  endwin();
}
</pre>
</div>

<p>
Watch the function call to <code>set_menu_format()</code>. It specifies the
number of columns to be 3, thus displaying 3 items per row. We have
also switched off the showing descriptions with the function
<code>menu_opts_off()</code>. There are couple of functions <code>set_menu_opts()</code>,
<code>menu_opts_on()</code> and <code>menu_opts()</code> which can be used to manipulate
menu options. The following menu options can be specified.
</p>

<dl class="org-dl">
<dt> <code>O_ONEVALUE</code>   </dt><dd>Only one item can be selected for this menu.
</dd>

<dt> <code>O_SHOWDESC</code>   </dt><dd>Display the item descriptions when the menu is
posted.
</dd>

<dt> <code>O_ROWMAJOR</code>   </dt><dd>Display the menu in row-major order.
</dd>

<dt> <code>O_IGNORECASE</code> </dt><dd>Ignore the case when pattern-matching.
</dd>

<dt> <code>O_SHOWMATCH</code>  </dt><dd>Move the cursor to within the item name while
pattern-matching.
</dd>

<dt> <code>O_NONCYCLIC</code>  </dt><dd>Don't wrap around next-item and previous-item,
requests to the other end of the menu.
</dd>
</dl>


<p>
All options are on by default. You can switch specific attributes
on or off with <code>menu_opts_on()</code> and <code>menu_opts_off()</code>
functions. You can also use <code>set_menu_opts()</code> to directly specify
the options. The argument to this function should be a OR ed value
of some of those above constants.  The function <code>menu_opts()</code> can
be used to find out a menu's present options.
</p>
</div>
</div>
