NCURSES-Programming-HOWTO.html

<div id="outline-container-sec-18-7" class="outline-3">
<h3 id="sec-18-7">17.7. Multi Valued Menus</h3>
<div class="outline-text-3" id="text-18-7">
<p>
You might be wondering what if you switch off the option
<code>O_ONEVALUE</code>.  Then the menu becomes multi-valued. That means you
can select more than one item. This brings us to the request
<code>REQ_TOGGLE_ITEM</code>. Let's see it in action.
</p>

<p>
<a href="ncurses_programs/menus/menu_toggle.c"><b>Example 22. Multi Valued Menus example</b></a>
</p>

<div class="org-src-container">

<pre class="src src-c">#include &lt;curses.h&gt;
#include &lt;menu.h&gt;
#include &lt;stdlib.h&gt;
#include &lt;string.h&gt;

#define ARRAY_SIZE(a) (sizeof(a) / sizeof(a[0]))
#define CTRLD   4

char *choices[] = {
  "Choice 1",
  "Choice 2",
  "Choice 3",
  "Choice 4",
  "Choice 5",
  "Choice 6",
  "Choice 7",
  "Exit",
};

int main(){
  ITEM **my_items;
  int c;
  MENU *my_menu;
  int n_choices, i;
  ITEM *cur_item;

  /* Initialize curses */
  initscr();
  cbreak();
  noecho();
  keypad(stdscr, TRUE);

  /* Initialize items */
  n_choices = ARRAY_SIZE(choices);
  my_items = (ITEM **)calloc(n_choices + 1, sizeof(ITEM *));
  for(i = 0; i &lt; n_choices; ++i)
    my_items[i] = new_item(choices[i], choices[i]);
  my_items[n_choices] = (ITEM *)NULL;

  my_menu = new_menu((ITEM **)my_items);

  /* Make the menu multi valued */
  menu_opts_off(my_menu, O_ONEVALUE);

  mvprintw(LINES - 3, 0, "Use &lt;SPACE&gt; to select or unselect an item.");
  mvprintw(LINES - 2, 0, "&lt;ENTER&gt; to see presently selected items(F1 to Exit)");
  post_menu(my_menu);
  refresh();

  while((c = getch()) != KEY_F(1)){
    switch(c){
    case KEY_DOWN:
      menu_driver(my_menu, REQ_DOWN_ITEM);
      break;
    case KEY_UP:
      menu_driver(my_menu, REQ_UP_ITEM);
      break;
    case ' ':
      menu_driver(my_menu, REQ_TOGGLE_ITEM);
      break;
    case 10:    /* Enter */
      { char temp[200];
        ITEM **items;

        items = menu_items(my_menu);
        temp[0] = '\0';
        for(i = 0; i &lt; item_count(my_menu); ++i)
          if(item_value(items[i]) == TRUE){
            strcat(temp, item_name(items[i]));
            strcat(temp, " ");
          }
        move(20, 0);
        clrtoeol();
        mvprintw(20, 0, temp);
        refresh();
      }
      break;
    }
  }

  free_item(my_items[0]);
  free_item(my_items[1]);
  free_menu(my_menu);
  endwin();
}
</pre>
</div>

<p>
Whew, A lot of new functions. Let's take them one after another.
Firstly, the <code>REQ_TOGGLE_ITEM</code>. In a multi-valued menu, the user
should be allowed to select or un select more than one item. The
request <code>REQ_TOGGLE_ITEM</code> toggles the present selection. In this
case when space is pressed <code>REQ_TOGGLE_ITEM</code> request is sent to
<code>menu_driver</code> to achieve the result.
</p>

<p>
Now when the user presses &lt;ENTER&gt; we show the items he presently
selected. First we find out the items associated with the menu
using the function <code>menu_items()</code>. Then we loop through the items
to find out if the item is selected or not. The function
<code>item_value()</code> returns <code>TRUE</code> if an item is selected. The function
<code>item_count()</code> returns the number of items in the menu. The item
name can be found with <code>item_name()</code>. You can also find the
description associated with an item using <code>item_description()</code>.
</p>
</div>
</div>

<div id="outline-container-sec-18-8" class="outline-3">
<h3 id="sec-18-8">17.8. Menu Options</h3>
<div class="outline-text-3" id="text-18-8">
<p>
Well, by this time you must be itching for some difference in your
menu, with lots of functionality. I know. You want Colors !!!. You
want to create nice menus similar to those text mode <a href="http://www.jersey.net/~debinjoe/games/">dos games</a>. The
functions <code>set_menu_fore()</code> and <code>set_menu_back()</code> can be used to
change the attribute of the selected item and unselected item. The
names are misleading. They don't change menu's foreground or
background which would have been useless.
</p>

<p>
The function <code>set_menu_grey()</code> can be used to set the display
attribute for the non-selectable items in the menu. This brings us
to the interesting option for an item the one and only
<code>O_SELECTABLE</code>.  We can turn it off by the function
<code>item_opts_off()</code> and after that that item is not selectable. It's
like a grayed item in those fancy windows menus.  Let's put these
concepts in practice with this example
</p>

<p>
<a href="ncurses_programs/menus/menu_attrib.c"><b>Example 23. Menu Options example</b></a>
</p>

<div class="org-src-container">

<pre class="src src-c">#include &lt;menu.h&gt;
#include &lt;stdlib.h&gt;

#define ARRAY_SIZE(a) (sizeof(a) / sizeof(a[0]))
#define CTRLD   4

char *choices[] = {
  "Choice 1",
  "Choice 2",
  "Choice 3",
  "Choice 4",
  "Choice 5",
  "Choice 6",
  "Choice 7",
  "Exit",
};

int main(){
  ITEM **my_items;
  int c;
  MENU *my_menu;
  int n_choices, i;
  ITEM *cur_item;

  /* Initialize curses */
  initscr();
  start_color();
  cbreak();
  noecho();
  keypad(stdscr, TRUE);
  init_pair(1, COLOR_RED, COLOR_BLACK);
  init_pair(2, COLOR_GREEN, COLOR_BLACK);
  init_pair(3, COLOR_MAGENTA, COLOR_BLACK);

  /* Initialize items */
  n_choices = ARRAY_SIZE(choices);
  my_items = (ITEM **)calloc(n_choices + 1, sizeof(ITEM *));
  for(i = 0; i &lt; n_choices; ++i)
    my_items[i] = new_item(choices[i], choices[i]);
  my_items[n_choices] = (ITEM *)NULL;
  item_opts_off(my_items[3], O_SELECTABLE);
  item_opts_off(my_items[6], O_SELECTABLE);

  /* Create menu */
  my_menu = new_menu((ITEM **)my_items);

  /* Set fore ground and back ground of the menu */
  set_menu_fore(my_menu, COLOR_PAIR(1) | A_REVERSE);
  set_menu_back(my_menu, COLOR_PAIR(2));
  set_menu_grey(my_menu, COLOR_PAIR(3));

  /* Post the menu */
  mvprintw(LINES - 3, 0, "Press &lt;ENTER&gt; to see the option selected");
  mvprintw(LINES - 2, 0, "Up and Down arrow keys to naviage (F1 to Exit)");
  post_menu(my_menu);
  refresh();

  while((c = getch()) != KEY_F(1)){
    switch(c){
    case KEY_DOWN:
      menu_driver(my_menu, REQ_DOWN_ITEM);
      break;
    case KEY_UP:
      menu_driver(my_menu, REQ_UP_ITEM);
      break;
    case 10: /* Enter */
      move(20, 0);
      clrtoeol();
      mvprintw(20, 0, "Item selected is : %s",
               item_name(current_item(my_menu)));
      pos_menu_cursor(my_menu);
      break;
    }
  }

  unpost_menu(my_menu);
  for(i = 0; i &lt; n_choices; ++i)
    free_item(my_items[i]);
  free_menu(my_menu);
  endwin();
}
</pre>
</div>
</div>
</div>
