NCURSES-Programming-HOWTO.org
** 17.9. The useful User Pointer

   We can associate a user pointer with each item in the menu. It
   works the same way as user pointer in panels. It's not touched by
   menu system. You can store any thing you like in that. I usually
   use it to store the function to be executed when the menu option is
   chosen (It's selected and may be the user pressed <ENTER>);


   [[file:ncurses_programs/menus/menu_userptr.c][*Example 24. Menu User Pointer Usage*]]

   #+BEGIN_SRC c
     #include <curses.h>
     #include <menu.h>
     #include <stdlib.h>

     #define ARRAY_SIZE(a) (sizeof(a) / sizeof(a[0]))
     #define CTRLD   4

     char *choices[] = {
       "Choice 1",
       "Choice 2",
       "Choice 3",
       "Choice 4",
       "Choice 5",
       "Choice 6",
       "Choice 7",
       "Exit",
     };

     void func(char *name);

     int main(){
       ITEM **my_items;
       int c;
       MENU *my_menu;
       int n_choices, i;
       ITEM *cur_item;

       /* Initialize curses */
       initscr();
       start_color();
       cbreak();
       noecho();
       keypad(stdscr, TRUE);
       init_pair(1, COLOR_RED, COLOR_BLACK);
       init_pair(2, COLOR_GREEN, COLOR_BLACK);
       init_pair(3, COLOR_MAGENTA, COLOR_BLACK);

       /* Initialize items */
       n_choices = ARRAY_SIZE(choices);
       my_items = (ITEM **)calloc(n_choices + 1, sizeof(ITEM *));
       for(i = 0; i < n_choices; ++i){
         my_items[i] = new_item(choices[i], choices[i]);
         /* Set the user pointer */
         set_item_userptr(my_items[i], func);
       }
       my_items[n_choices] = (ITEM *)NULL;

       /* Create menu */
       my_menu = new_menu((ITEM **)my_items);

       /* Post the menu */
       mvprintw(LINES - 3, 0, "Press <ENTER> to see the option selected");
       mvprintw(LINES - 2, 0, "Up and Down arrow keys to naviage (F1 to Exit)");
       post_menu(my_menu);
       refresh();

       while((c = getch()) != KEY_F(1)){
         switch(c){
         case KEY_DOWN:
           menu_driver(my_menu, REQ_DOWN_ITEM);
           break;
         case KEY_UP:
           menu_driver(my_menu, REQ_UP_ITEM);
           break;
         case 10: /* Enter */
           { ITEM *cur;
             void (*p)(char *);

             cur = current_item(my_menu);
             p = item_userptr(cur);
             p((char *)item_name(cur));
             pos_menu_cursor(my_menu);
             break;
           }
           break;
         }
       }

       unpost_menu(my_menu);
       for(i = 0; i < n_choices; ++i)
         free_item(my_items[i]);
       free_menu(my_menu);
       endwin();
     }

     void func(char *name){
       move(20, 0);
       clrtoeol();
       mvprintw(20, 0, "Item selected is : %s", name);
     }
   #+END_SRC

* 18. Forms Library

  Well. If you have seen those forms on web pages which take input
  from users and do various kinds of things, you might be wondering
  how would any one create such forms in text mode display. It's quite
  difficult to write those nifty forms in plain ncurses. Forms library
  tries to provide a basic frame work to build and maintain forms with
  ease. It has lot of features(functions) which manage validation,
  dynamic expansion of fields etc.. Let's see it in full flow.

  A form is a collection of fields; each field can be either a
  label(static text) or a data-entry location. The forms also library
  provides functions to divide forms into multiple pages.

** 18.1. The Basics

   Forms are created in much the same way as menus. First the fields
   related to the form are created with =new_field()=. You can set
   options for the fields, so that they can be displayed with some
   fancy attributes, validated before the field looses focus
   etc.. Then the fields are attached to form. After this, the form
   can be posted to display and is ready to receive inputs. On the
   similar lines to =menu_driver()=, the form is manipulated with
   =form_driver()=. We can send requests to =form_driver= to move
   focus to a certain field, move cursor to end of the field
   etc.. After the user enters values in the fields and validation
   done, form can be unposted and memory allocated can be freed.

   The general flow of control of a forms program looks like this.

   1. Initialize curses

   2. Create fields using =new_field()=. You can specify the height and
      width of the field, and its position on the form.

   3. Create the forms with =new_form()= by specifying the fields to
      be attached with.

   4. Post the form with =form_post()= and refresh the screen.

   5. Process the user requests with a loop and do necessary updates
      to form with =form_driver=.

   6. Unpost the menu with =form_unpost()=

   7. Free the memory allocated to menu by =free_form()=

   8. Free the memory allocated to the items with =free_field()=

   9. End curses

   As you can see, working with forms library is much similar to
   handling menu library. The following examples will explore various
   aspects of form processing. Let's start the journey with a simple
   example. first.

