NCURSES-Programming-HOWTO.html

<div id="outline-container-sec-18-9" class="outline-3">
<h3 id="sec-18-9">17.9. The useful User Pointer</h3>
<div class="outline-text-3" id="text-18-9">
<p>
We can associate a user pointer with each item in the menu. It
works the same way as user pointer in panels. It's not touched by
menu system. You can store any thing you like in that. I usually
use it to store the function to be executed when the menu option is
chosen (It's selected and may be the user pressed &lt;ENTER&gt;);
</p>


<p>
<a href="ncurses_programs/menus/menu_userptr.c"><b>Example 24. Menu User Pointer Usage</b></a>
</p>

<div class="org-src-container">

<pre class="src src-c">#include &lt;curses.h&gt;
#include &lt;menu.h&gt;
#include &lt;stdlib.h&gt;

#define ARRAY_SIZE(a) (sizeof(a) / sizeof(a[0]))
#define CTRLD   4

char *choices[] = {
  "Choice 1",
  "Choice 2",
  "Choice 3",
  "Choice 4",
  "Choice 5",
  "Choice 6",
  "Choice 7",
  "Exit",
};

void func(char *name);

int main(){
  ITEM **my_items;
  int c;
  MENU *my_menu;
  int n_choices, i;
  ITEM *cur_item;

  /* Initialize curses */
  initscr();
  start_color();
  cbreak();
  noecho();
  keypad(stdscr, TRUE);
  init_pair(1, COLOR_RED, COLOR_BLACK);
  init_pair(2, COLOR_GREEN, COLOR_BLACK);
  init_pair(3, COLOR_MAGENTA, COLOR_BLACK);

  /* Initialize items */
  n_choices = ARRAY_SIZE(choices);
  my_items = (ITEM **)calloc(n_choices + 1, sizeof(ITEM *));
  for(i = 0; i &lt; n_choices; ++i){
    my_items[i] = new_item(choices[i], choices[i]);
    /* Set the user pointer */
    set_item_userptr(my_items[i], func);
  }
  my_items[n_choices] = (ITEM *)NULL;

  /* Create menu */
  my_menu = new_menu((ITEM **)my_items);

  /* Post the menu */
  mvprintw(LINES - 3, 0, "Press &lt;ENTER&gt; to see the option selected");
  mvprintw(LINES - 2, 0, "Up and Down arrow keys to naviage (F1 to Exit)");
  post_menu(my_menu);
  refresh();

  while((c = getch()) != KEY_F(1)){
    switch(c){
    case KEY_DOWN:
      menu_driver(my_menu, REQ_DOWN_ITEM);
      break;
    case KEY_UP:
      menu_driver(my_menu, REQ_UP_ITEM);
      break;
    case 10: /* Enter */
      { ITEM *cur;
        void (*p)(char *);

        cur = current_item(my_menu);
        p = item_userptr(cur);
        p((char *)item_name(cur));
        pos_menu_cursor(my_menu);
        break;
      }
      break;
    }
  }

  unpost_menu(my_menu);
  for(i = 0; i &lt; n_choices; ++i)
    free_item(my_items[i]);
  free_menu(my_menu);
  endwin();
}

void func(char *name){
  move(20, 0);
  clrtoeol();
  mvprintw(20, 0, "Item selected is : %s", name);
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19">18. Forms Library</h2>
<div class="outline-text-2" id="text-19">
<p>
Well. If you have seen those forms on web pages which take input
from users and do various kinds of things, you might be wondering
how would any one create such forms in text mode display. It's quite
difficult to write those nifty forms in plain ncurses. Forms library
tries to provide a basic frame work to build and maintain forms with
ease. It has lot of features(functions) which manage validation,
dynamic expansion of fields etc.. Let's see it in full flow.
</p>

<p>
A form is a collection of fields; each field can be either a
label(static text) or a data-entry location. The forms also library
provides functions to divide forms into multiple pages.
</p>
</div>

<div id="outline-container-sec-19-1" class="outline-3">
<h3 id="sec-19-1">18.1. The Basics</h3>
<div class="outline-text-3" id="text-19-1">
<p>
Forms are created in much the same way as menus. First the fields
related to the form are created with <code>new_field()</code>. You can set
options for the fields, so that they can be displayed with some
fancy attributes, validated before the field looses focus
etc.. Then the fields are attached to form. After this, the form
can be posted to display and is ready to receive inputs. On the
similar lines to <code>menu_driver()</code>, the form is manipulated with
<code>form_driver()</code>. We can send requests to <code>form_driver</code> to move
focus to a certain field, move cursor to end of the field
etc.. After the user enters values in the fields and validation
done, form can be unposted and memory allocated can be freed.
</p>

<p>
The general flow of control of a forms program looks like this.
</p>

<ol class="org-ol">
<li>Initialize curses
</li>

<li>Create fields using <code>new_field()</code>. You can specify the height and
width of the field, and its position on the form.
</li>

<li>Create the forms with <code>new_form()</code> by specifying the fields to
be attached with.
</li>

<li>Post the form with <code>form_post()</code> and refresh the screen.
</li>

<li>Process the user requests with a loop and do necessary updates
to form with <code>form_driver</code>.
</li>

<li>Unpost the menu with <code>form_unpost()</code>
</li>

<li>Free the memory allocated to menu by <code>free_form()</code>
</li>

<li>Free the memory allocated to the items with <code>free_field()</code>
</li>

<li>End curses
</li>
</ol>

<p>
As you can see, working with forms library is much similar to
handling menu library. The following examples will explore various
aspects of form processing. Let's start the journey with a simple
example. first.
</p>
</div>
</div>
