NCURSES-Programming-HOWTO.html

<div id="outline-container-sec-19-2" class="outline-3">
<h3 id="sec-19-2">18.2. Compiling With the Forms Library</h3>
<div class="outline-text-3" id="text-19-2">
<p>
To use forms library functions, you have to include <code>form.h</code> and to
link the program with forms library the flag <code>-lform</code> should be
added along with <code>-lncurses</code> in that order.
</p>

<pre class="example">
#include &lt;form.h&gt;
.
.
.

compile and link: gcc &lt;program file&gt; -lform -lncurses
</pre>

<p>
<a href="ncurses_programs/forms/form_simple.c"><b>Example 25. Forms Basics</b></a>
</p>

<div class="org-src-container">

<pre class="src src-c">#include &lt;form.h&gt;

int main(){
  FIELD *field[3];
  FORM  *my_form;
  int ch;

  /* Initialize curses */
  initscr();
  cbreak();
  noecho();
  keypad(stdscr, TRUE);

  /* Initialize the fields */
  field[0] = new_field(1, 10, 4, 18, 0, 0);
  field[1] = new_field(1, 10, 6, 18, 0, 0);
  field[2] = NULL;

  /* Set field options */
  set_field_back(field[0], A_UNDERLINE);  /* Print a line for the option      */
  field_opts_off(field[0], O_AUTOSKIP);   /* Don't go to next field when this */
                                          /* Field is filled up               */
  set_field_back(field[1], A_UNDERLINE);
  field_opts_off(field[1], O_AUTOSKIP);

  /* Create the form and post it */
  my_form = new_form(field);
  post_form(my_form);
  refresh();

  mvprintw(4, 10, "Value 1:");
  mvprintw(6, 10, "Value 2:");
  refresh();

  /* Loop through to get user requests */
  while((ch = getch()) != KEY_F(1)){
    switch(ch){
    case KEY_DOWN:
      /* Go to next field */
      form_driver(my_form, REQ_NEXT_FIELD);
      /* Go to the end of the present buffer */
      /* Leaves nicely at the last character */
      form_driver(my_form, REQ_END_LINE);
      break;
    case KEY_UP:
      /* Go to previous field */
      form_driver(my_form, REQ_PREV_FIELD);
      form_driver(my_form, REQ_END_LINE);
      break;
    default:
      /* If this is a normal character, it gets */
      /* Printed                */
      form_driver(my_form, ch);
      break;
    }
  }

  /* Un post form and free the memory */
  unpost_form(my_form);
  free_form(my_form);
  free_field(field[0]);
  free_field(field[1]);

  endwin();
  return 0;
}
</pre>
</div>

<p>
Above example is pretty straight forward. It creates two fields
with <code>new_field()</code>. <code>new_field()</code> takes height, width, starty,
startx, number of offscreen rows and number of additional working
buffers. The fifth argument number of offscreen rows specifies how
much of the field to be shown. If it is zero, the entire field is
always displayed otherwise the form will be scrollable when the
user accesses not displayed parts of the field. The forms library
allocates one buffer per field to store the data user enters. Using
the last parameter to <code>new_field()</code> we can specify it to allocate
some additional buffers. These can be used for any purpose you
like.
</p>

<p>
After creating the fields, back ground attribute of both of them is
set to an underscore with <code>set_field_back()</code>. The <code>AUTOSKIP</code> option
is turned off using <code>field_opts_off()</code>. If this option is turned
on, focus will move to the next field in the form once the active
field is filled up completely.
</p>

<p>
After attaching the fields to the form, it is posted. Here on, user
inputs are processed in the while loop, by making corresponding
requests to <code>form_driver</code>. The details of all the requests to the
<code>form_driver()</code> are explained later.
</p>
</div>
</div>

<div id="outline-container-sec-19-3" class="outline-3">
<h3 id="sec-19-3">18.3. Playing with Fields</h3>
<div class="outline-text-3" id="text-19-3">
<p>
Each form field is associated with a lot of attributes. They can be
manipulated to get the required effect and to have fun !!!. So why
wait?
</p>
</div>

<div id="outline-container-sec-19-3-1" class="outline-4">
<h4 id="sec-19-3-1">18.3.1. Fetching Size and Location of Field</h4>
<div class="outline-text-4" id="text-19-3-1">
<p>
The parameters we have given at the time of creation of a field
can be retrieved with <code>field_info()</code>. It returns height, width,
starty, startx, number of offscreen rows, and number of additional
buffers into the parameters given to it. It is a sort of inverse
of <code>new_field()</code>.
</p>

<div class="org-src-container">

<pre class="src src-c">int field_info(     FIELD *field,              /* field from which to fetch */
                    int *height, *int width,   /* field size                */
                    int *top, int *left,       /* upper left corner         */
                    int *offscreen,            /* number of offscreen rows  */
                    int *nbuf);                /* number of working buffers */
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-19-3-2" class="outline-4">
<h4 id="sec-19-3-2">18.3.2. Moving the field</h4>
<div class="outline-text-4" id="text-19-3-2">
<p>
The location of the field can be moved to a different position
with <code>move_field()</code>.
</p>

<div class="org-src-container">

<pre class="src src-c">int move_field(    FIELD *field,              /* field to alter */
                   int top, int left);        /* new upper-left corner */
</pre>
</div>

<p>
As usual, the changed position can be queried with
<code>field_info()</code>.
</p>
</div>
</div>

<div id="outline-container-sec-19-3-3" class="outline-4">
<h4 id="sec-19-3-3">18.3.3. Field Justification</h4>
<div class="outline-text-4" id="text-19-3-3">
<p>
The justification to be done for the field can be fixed using the
function <code>set_field_just()</code>.
</p>

<div class="org-src-container">

<pre class="src src-c">int set_field_just(FIELD *field,       /* field to alter              */
                   int justmode);      /* mode to set                 */
int field_just(FIELD *field);          /* fetch justify mode of field */
</pre>
</div>

<p>
The justification mode valued accepted and returned by these
functions are <code>NO_JUSTIFICATION</code>, <code>JUSTIFY_RIGHT</code>, <code>JUSTIFY_LEFT</code>,
or <code>JUSTIFY_CENTER</code>.
</p>
</div>
</div>
