NCURSES-Programming-HOWTO.org
*** 18.3.4. Field Display Attributes

    As you have seen, in the above example, display attribute for the
    fields can be set with =set_field_fore()= and =set_field_back()=.
    These functions set foreground and background attribute of the
    fields. You can also specify a pad character which will be filled
    in the unfilled portion of the field. The pad character is set
    with a call to =set_field_pad()=.  Default pad value is a space.
    The functions =field_fore()=, =field_back=, =field_pad()= can be
    used to query the present foreground, background attributes and
    pad character for the field. The following list gives the usage of
    functions.

    #+BEGIN_SRC c
      int set_field_fore(FIELD *field,        /* field to alter                */
                         chtype attr);        /* attribute to set              */

      chtype field_fore(FIELD *field);        /* field to query                */
                                              /* returns foreground attribute  */

      int set_field_back(FIELD *field,        /* field to alter                */
                         chtype attr);        /* attribute to set              */

      chtype field_back(FIELD *field);        /* field to query                */
                                              /* returns background attribute  */

      int set_field_pad(FIELD *field,         /* field to alter                */
                        int pad);             /* pad character to set          */

      chtype field_pad(FIELD *field);         /* field to query                */
                                              /* returns present pad character */
    #+END_SRC

    Though above functions seem quite simple, using colors with
    =set_field_fore()= may be frustrating in the beginning. Let me
    first explain about foreground and background attributes of a
    field. The foreground attribute is associated with the
    character. That means a character in the field is printed with the
    attribute you have set with =set_field_fore()=. Background
    attribute is the attribute used to fill background of field,
    whether any character is there or not. So what about colors? Since
    colors are always defined in pairs, what is the right way to
    display colored fields? Here's an example clarifying color
    attributes.

    [[file:ncurses_programs/forms/form_attrib.c][*Example 26. Form Attributes example*]]

    #+BEGIN_SRC c
      #include <form.h>

      int main(){
        FIELD *field[3];
        FORM  *my_form;
        int ch;

        /* Initialize curses */
        initscr();
        start_color();
        cbreak();
        noecho();
        keypad(stdscr, TRUE);

        /* Initialize few color pairs */
        init_pair(1, COLOR_WHITE, COLOR_BLUE);
        init_pair(2, COLOR_WHITE, COLOR_BLUE);

        /* Initialize the fields */
        field[0] = new_field(1, 10, 4, 18, 0, 0);
        field[1] = new_field(1, 10, 6, 18, 0, 0);
        field[2] = NULL;

        /* Set field options */
        set_field_fore(field[0], COLOR_PAIR(1));     /* Put the field with blue background */
        set_field_back(field[0], COLOR_PAIR(2));     /* and white foreground (characters   */
                                                     /* are printed in white               */
        field_opts_off(field[0], O_AUTOSKIP);        /* Don't go to next field when this   */
                                                     /* Field is filled up                 */
        set_field_back(field[1], A_UNDERLINE);
        field_opts_off(field[1], O_AUTOSKIP);

        /* Create the form and post it */
        my_form = new_form(field);
        post_form(my_form);
        refresh();

        set_current_field(my_form, field[0]);        /* Set focus to the colored field     */
        mvprintw(4, 10, "Value 1:");
        mvprintw(6, 10, "Value 2:");
        mvprintw(LINES - 2, 0, "Use UP, DOWN arrow keys to switch between fields");
        refresh();

        /* Loop through to get user requests */
        while( (ch = getch()) != KEY_F(1) ){
          switch( ch ){
          case KEY_DOWN:
            /* Go to next field */
            form_driver(my_form, REQ_NEXT_FIELD);
            /* Go to the end of the present buffer */
            /* Leaves nicely at the last character */
            form_driver(my_form, REQ_END_LINE);
            break;
          case KEY_UP:
            /* Go to previous field */
            form_driver(my_form, REQ_PREV_FIELD);
            form_driver(my_form, REQ_END_LINE);
            break;
          default:
            /* If this is a normal character, it gets */
            /* Printed                */
            form_driver(my_form, ch);
            break;
          }
        }

        /* Un post form and free the memory */
        unpost_form(my_form);
        free_form(my_form);
        free_field(field[0]);
        free_field(field[1]);

        endwin();
        return 0;
      }
    #+END_SRC

    Play with the color pairs and try to understand the foreground and
    background attributes. In my programs using color attributes, I
    usually set only the background with =set_field_back()=. Curses
    simply doesn't allow defining individual color attributes.

