NCURSES-Programming-HOWTO.org
*** 18.3.6. Field Status

    The field status specifies whether the field has got edited or
    not. It is initially set to =FALSE= and when user enters something
    and the data buffer gets modified it becomes =TRUE=. So a field's
    status can be queried to find out whether it has been modified or
    not. The following functions can assist in those operations.

    #+BEGIN_SRC c
      int set_field_status(FIELD *field,      /* field to alter */
                           int status);       /* status to set  */

      int field_status(FIELD *field);         /* fetch status of field */
    #+END_SRC

    It's better to check the field's status only after after leaving
    the field, as data buffer might not have been updated yet as the
    validation is still due. To guarantee that right status is
    returned, call =field_status()= either (1) in the field's exit
    validation check routine, (2) from the field's or form's
    initialization or termination hooks, or (3) just after a
    =REQ_VALIDATION= request has been processed by the forms driver

*** 18.3.7. Field User Pointer

    Every field structure contains one pointer that can be used by the
    user for various purposes. It is not touched by forms library and
    can be used for any purpose by the user. The following functions
    set and fetch user pointer.

    #+BEGIN_SRC c
      int set_field_userptr(FIELD *field,
                            char *userptr);   /* the user pointer you wish to associate */
                                              /* with the field                         */

      char *field_userptr(FIELD *field);      /* fetch user pointer of the field        */
    #+END_SRC

*** 18.3.8. Variable-Sized Fields

    If you want a dynamically changing field with variable width, this
    is the feature you want to put to full use. This will allow the
    user to enter more data than the original size of the field and
    let the field grow. According to the field orientation it will
    scroll horizontally or vertically to incorporate the new data.

    To make a field dynamically growable, the option =O_STATIC= should
    be turned off. This can be done with a

    #+BEGIN_SRC c
      field_opts_off(field_pointer, O_STATIC);
    #+END_SRC

    But it's usually not advisable to allow a field to grow
    infinitely. You can set a maximum limit to the growth of the field
    with

    #+BEGIN_SRC c
      int set_max_field(FIELD *field,    /* Field on which to operate            */
                        int max_growth); /* maximum growth allowed for the field */
    #+END_SRC

    The field info for a dynamically growable field can be retrieved
    by

    #+BEGIN_SRC c
      int dynamic_field_info( FIELD *field,     /* Field on which to operate                */
                              int   *prows,     /* number of rows will be filled in this    */
                              int   *pcols,     /* number of columns will be filled in this */
                              int   *pmax)      /* maximum allowable growth will be filled  */
                                                /* in this                                  */
    #+END_SRC

    Though =field_info= work as usual, it is advisable to use this
    function to get the proper attributes of a dynamically growable
    field.  Recall the library routine =new_field=; a new field
    created with height set to one will be defined to be a one line
    field. A new field created with height greater than one will be
    defined to be a multi line field.

    A one line field with =O_STATIC= turned off (dynamically growable
    field) will contain a single fixed row, but the number of columns
    can increase if the user enters more data than the initial field
    will hold. The number of columns displayed will remain fixed and
    the additional data will scroll horizontally.

    A multi line field with =O_STATIC= turned off (dynamically
    growable field) will contain a fixed number of columns, but the
    number of rows can increase if the user enters more data than the
    initial field will hold. The number of rows displayed will remain
    fixed and the additional data will scroll vertically.

    The above two paragraphs pretty much describe a dynamically
    growable field's behavior. The way other parts of forms library
    behaves is described below:

   1. The field option =O_AUTOSKIP= will be ignored if the option
      =O_STATIC= is off and there is no maximum growth specified for
      the field.  Currently, =O_AUTOSKIP= generates an automatic
      =REQ_NEXT_FIELD= form driver request when the user types in the
      last character position of a field. On a growable field with no
      maximum growth specified, there is no last character
      position. If a maximum growth is specified, the =O_AUTOSKIP=
      option will work as normal if the field has grown to its maximum
      size.

   2. The field justification will be ignored if the option =O_STATIC=
      is off. Currently, =set_field_just= can be used to
      =JUSTIFY_LEFT=, =JUSTIFY_RIGHT=, =JUSTIFY_CENTER= the contents
      of a one line field. A growable one line field will, by
      definition, grow and scroll horizontally and may contain more
      data than can be justified. The return from =field_just= will be
      unchanged.

   3. The overloaded form driver request =REQ_NEW_LINE= will operate
      the same way regardless of the =O_NL_OVERLOAD= form option if
      the field option =O_STATIC= is off and there is no maximum
      growth specified for the field. Currently, if the form option
      =O_NL_OVERLOAD= is on, =REQ_NEW_LINE= implicitly generates a
      =REQ_NEXT_FIELD= if called from the last line of a field. If a
      field can grow without bound, there is no last line, so
      =REQ_NEW_LINE= will never implicitly generate a
      =REQ_NEXT_FIELD=. If a maximum growth limit is specified and the
      =O_NL_OVERLOAD= form option is on, =REQ_NEW_LINE= will only
      implicitly generate =REQ_NEXT_FIELD= if the field has grown to
      its maximum size and the user is on the last line.

   4. The library call =dup_field= will work as usual; it will
      duplicate the field, including the current buffer size and
      contents of the field being duplicated. Any specified maximum
      growth will also be duplicated.

   5. The library call =link_field= will work as usual; it will
      duplicate all field attributes and share buffers with the field
      being linked.  If the =O_STATIC= field option is subsequently
      changed by a field sharing buffers, how the system reacts to an
      attempt to enter more data into the field than the buffer will
      currently hold will depend on the setting of the option in the
      current field.

   6. The library call =field_info= will work as usual; the variable
      nrow will contain the value of the original call to
      =new_field=. The user should use =dynamic_field_info=, described
      above, to query the current size of the buffer.


   Some of the above points make sense only after explaining form
   driver.  We will be looking into that in next few sections.

