NCURSES-Programming-HOWTO.html

<div id="outline-container-sec-19-3-6" class="outline-4">
<h4 id="sec-19-3-6">18.3.6. Field Status</h4>
<div class="outline-text-4" id="text-19-3-6">
<p>
The field status specifies whether the field has got edited or
not. It is initially set to <code>FALSE</code> and when user enters something
and the data buffer gets modified it becomes <code>TRUE</code>. So a field's
status can be queried to find out whether it has been modified or
not. The following functions can assist in those operations.
</p>

<div class="org-src-container">

<pre class="src src-c">int set_field_status(FIELD *field,      /* field to alter */
                     int status);       /* status to set  */

int field_status(FIELD *field);         /* fetch status of field */
</pre>
</div>

<p>
It's better to check the field's status only after after leaving
the field, as data buffer might not have been updated yet as the
validation is still due. To guarantee that right status is
returned, call <code>field_status()</code> either (1) in the field's exit
validation check routine, (2) from the field's or form's
initialization or termination hooks, or (3) just after a
<code>REQ_VALIDATION</code> request has been processed by the forms driver
</p>
</div>
</div>

<div id="outline-container-sec-19-3-7" class="outline-4">
<h4 id="sec-19-3-7">18.3.7. Field User Pointer</h4>
<div class="outline-text-4" id="text-19-3-7">
<p>
Every field structure contains one pointer that can be used by the
user for various purposes. It is not touched by forms library and
can be used for any purpose by the user. The following functions
set and fetch user pointer.
</p>

<div class="org-src-container">

<pre class="src src-c">int set_field_userptr(FIELD *field,
                      char *userptr);   /* the user pointer you wish to associate */
                                        /* with the field                         */

char *field_userptr(FIELD *field);      /* fetch user pointer of the field        */
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-19-3-8" class="outline-4">
<h4 id="sec-19-3-8">18.3.8. Variable-Sized Fields</h4>
<div class="outline-text-4" id="text-19-3-8">
<p>
If you want a dynamically changing field with variable width, this
is the feature you want to put to full use. This will allow the
user to enter more data than the original size of the field and
let the field grow. According to the field orientation it will
scroll horizontally or vertically to incorporate the new data.
</p>

<p>
To make a field dynamically growable, the option <code>O_STATIC</code> should
be turned off. This can be done with a
</p>

<div class="org-src-container">

<pre class="src src-c">field_opts_off(field_pointer, O_STATIC);
</pre>
</div>

<p>
But it's usually not advisable to allow a field to grow
infinitely. You can set a maximum limit to the growth of the field
with
</p>

<div class="org-src-container">

<pre class="src src-c">int set_max_field(FIELD *field,    /* Field on which to operate            */
                  int max_growth); /* maximum growth allowed for the field */
</pre>
</div>

<p>
The field info for a dynamically growable field can be retrieved
by
</p>

<div class="org-src-container">

<pre class="src src-c">int dynamic_field_info( FIELD *field,     /* Field on which to operate                */
                        int   *prows,     /* number of rows will be filled in this    */
                        int   *pcols,     /* number of columns will be filled in this */
                        int   *pmax)      /* maximum allowable growth will be filled  */
                                          /* in this                                  */
</pre>
</div>

<p>
Though <code>field_info</code> work as usual, it is advisable to use this
function to get the proper attributes of a dynamically growable
field.  Recall the library routine <code>new_field</code>; a new field
created with height set to one will be defined to be a one line
field. A new field created with height greater than one will be
defined to be a multi line field.
</p>

<p>
A one line field with <code>O_STATIC</code> turned off (dynamically growable
field) will contain a single fixed row, but the number of columns
can increase if the user enters more data than the initial field
will hold. The number of columns displayed will remain fixed and
the additional data will scroll horizontally.
</p>

<p>
A multi line field with <code>O_STATIC</code> turned off (dynamically
growable field) will contain a fixed number of columns, but the
number of rows can increase if the user enters more data than the
initial field will hold. The number of rows displayed will remain
fixed and the additional data will scroll vertically.
</p>

<p>
The above two paragraphs pretty much describe a dynamically
growable field's behavior. The way other parts of forms library
behaves is described below:
</p>

<ol class="org-ol">
<li>The field option <code>O_AUTOSKIP</code> will be ignored if the option
<code>O_STATIC</code> is off and there is no maximum growth specified for
the field.  Currently, <code>O_AUTOSKIP</code> generates an automatic
<code>REQ_NEXT_FIELD</code> form driver request when the user types in the
last character position of a field. On a growable field with no
maximum growth specified, there is no last character
position. If a maximum growth is specified, the <code>O_AUTOSKIP</code>
option will work as normal if the field has grown to its maximum
size.
</li>

<li>The field justification will be ignored if the option <code>O_STATIC</code>
is off. Currently, <code>set_field_just</code> can be used to
<code>JUSTIFY_LEFT</code>, <code>JUSTIFY_RIGHT</code>, <code>JUSTIFY_CENTER</code> the contents
of a one line field. A growable one line field will, by
definition, grow and scroll horizontally and may contain more
data than can be justified. The return from <code>field_just</code> will be
unchanged.
</li>

<li>The overloaded form driver request <code>REQ_NEW_LINE</code> will operate
the same way regardless of the <code>O_NL_OVERLOAD</code> form option if
the field option <code>O_STATIC</code> is off and there is no maximum
growth specified for the field. Currently, if the form option
<code>O_NL_OVERLOAD</code> is on, <code>REQ_NEW_LINE</code> implicitly generates a
<code>REQ_NEXT_FIELD</code> if called from the last line of a field. If a
field can grow without bound, there is no last line, so
<code>REQ_NEW_LINE</code> will never implicitly generate a
<code>REQ_NEXT_FIELD</code>. If a maximum growth limit is specified and the
<code>O_NL_OVERLOAD</code> form option is on, <code>REQ_NEW_LINE</code> will only
implicitly generate <code>REQ_NEXT_FIELD</code> if the field has grown to
its maximum size and the user is on the last line.
</li>

<li>The library call <code>dup_field</code> will work as usual; it will
duplicate the field, including the current buffer size and
contents of the field being duplicated. Any specified maximum
growth will also be duplicated.
</li>

<li>The library call <code>link_field</code> will work as usual; it will
duplicate all field attributes and share buffers with the field
being linked.  If the <code>O_STATIC</code> field option is subsequently
changed by a field sharing buffers, how the system reacts to an
attempt to enter more data into the field than the buffer will
currently hold will depend on the setting of the option in the
current field.
</li>

<li>The library call <code>field_info</code> will work as usual; the variable
nrow will contain the value of the original call to
<code>new_field</code>. The user should use <code>dynamic_field_info</code>, described
above, to query the current size of the buffer.
</li>
</ol>


<p>
Some of the above points make sense only after explaining form
driver.  We will be looking into that in next few sections.
</p>
</div>
</div>
</div>
