NCURSES-Programming-HOWTO.org
*** =TYPE_ENUM=

    This type allows you to restrict a field's values to be among a
    specified set of string values (for example, the two-letter postal
    codes for U.S. states). It is set up with:

    #+BEGIN_SRC c
      int set_field_type(FIELD *field,          /* field to alter          */
                         TYPE_ENUM,             /* type to associate       */
                         char **valuelist;      /* list of possible values */
                         int checkcase;         /* case-sensitive?         */
                         int checkunique);      /* must specify uniquely?  */
    #+END_SRC

    The =valuelist= parameter must point at a NULL-terminated list of
    valid strings. The =checkcase= argument, if true, makes comparison
    with the string case-sensitive.

    When the user exits a =TYPE_ENUM= field, the validation procedure
    tries to complete the data in the buffer to a valid entry. If a
    complete choice string has been entered, it is of course valid.
    But it is also possible to enter a prefix of a valid string and
    have it completed for you.

    By default, if you enter such a prefix and it matches more than
    one value in the string list, the prefix will be completed to the
    first matching value. But the =checkunique= argument, if true,
    requires prefix matches to be unique in order to be valid.

    The =REQ_NEXT_CHOICE= and =REQ_PREV_CHOICE= input requests can be
    particularly useful with these fields.

*** =TYPE_INTEGER=

    This field type accepts an integer. It is set up as follows:

    #+BEGIN_SRC c
      int set_field_type(FIELD *field,          /* field to alter          */
                         TYPE_INTEGER,          /* type to associate       */
                         int padding,           /* # places to zero-pad to */
                         int vmin, int vmax);   /* valid range             */
    #+END_SRC

    Valid characters consist of an optional leading minus and digits.
    The range check is performed on exit. If the range maximum is less
    than or equal to the minimum, the range is ignored.

    If the value passes its range check, it is padded with as many
    leading zero digits as necessary to meet the =padding= argument.

    A =TYPE_INTEGER= value buffer can conveniently be interpreted with
    the C library function atoi(3).

*** =TYPE_NUMERIC=

    This field type accepts a decimal number. It is set up as follows:

    #+BEGIN_SRC c
      int set_field_type(FIELD *field,          /* field to alter        */
                         TYPE_NUMERIC,          /* type to associate     */
                         int padding,           /* # places of precision */
                         int vmin, int vmax);   /* valid range           */
    #+END_SRC

    Valid characters consist of an optional leading minus and digits.
    possibly including a decimal point. The range check is performed
    on exit. If the range maximum is less than or equal to the
    minimum, the range is ignored.

    If the value passes its range check, it is padded with as many
    trailing zero digits as necessary to meet the =padding= argument.

    A =TYPE_NUMERIC= value buffer can conveniently be interpreted with
    the C library function atof(3).

*** =TYPE_REGEXP=

    This field type accepts data matching a regular expression. It is
    set up as follows:

    #+BEGIN_SRC c
      int set_field_type(FIELD *field,          /* field to alter      */
                         TYPE_REGEXP,           /* type to associate   */
                         char *regexp);         /* expression to match */
    #+END_SRC

    The syntax for regular expressions is that of regcomp(3). The
    check for regular-expression match is performed on exit.

** 18.6. Form Driver: The work horse of the forms system

   As in the menu system, =form_driver()= plays a very important role
   in forms system. All types of requests to forms system should be
   funneled through =form_driver()=.

   #+BEGIN_SRC c
     int form_driver(FORM *form,     /* form on which to operate     */
                     int request)    /* form request code         */
   #+END_SRC

   As you have seen some of the examples above, you have to be in a
   loop looking for user input and then decide whether it's a field
   data or a form request. The form requests are then passed to
   =form_driver()= to do the work.

   The requests roughly can be divided into following categories.
   Different requests and their usage is explained below:

*** 18.6.1. Page Navigation Requests

    These requests cause page-level moves through the form, triggering
    display of a new form screen. A form can be made of multiple
    pages. If you have a big form with lot of fields and logical
    sections, then you can divide the form into pages. The function
    =set_new_page()= to set a new page at the field specified.

    #+BEGIN_SRC c
      int set_new_page(FIELD *field,        /* Field at which page break to be set or unset */
                       bool new_page_flag); /* should be TRUE to put a break                */
    #+END_SRC

    The following requests allow you to move to different pages

    - =REQ_NEXT_PAGE= Move to the next form page.

    - =REQ_PREV_PAGE= Move to the previous form page.

    - =REQ_FIRST_PAGE= Move to the first form page.

    - =REQ_LAST_PAGE= Move to the last form page.


    These requests treat the list as cyclic; that is, =REQ_NEXT_PAGE=
    from the last page goes to the first, and =REQ_PREV_PAGE= from the
    first page goes to the last.

