NCURSES-Programming-HOWTO.html

<div id="outline-container-sec-19-5-3" class="outline-4">
<h4 id="sec-19-5-3"><code>TYPE_ENUM</code></h4>
<div class="outline-text-4" id="text-19-5-3">
<p>
This type allows you to restrict a field's values to be among a
specified set of string values (for example, the two-letter postal
codes for U.S. states). It is set up with:
</p>

<div class="org-src-container">

<pre class="src src-c">int set_field_type(FIELD *field,          /* field to alter          */
                   TYPE_ENUM,             /* type to associate       */
                   char **valuelist;      /* list of possible values */
                   int checkcase;         /* case-sensitive?         */
                   int checkunique);      /* must specify uniquely?  */
</pre>
</div>

<p>
The <code>valuelist</code> parameter must point at a NULL-terminated list of
valid strings. The <code>checkcase</code> argument, if true, makes comparison
with the string case-sensitive.
</p>

<p>
When the user exits a <code>TYPE_ENUM</code> field, the validation procedure
tries to complete the data in the buffer to a valid entry. If a
complete choice string has been entered, it is of course valid.
But it is also possible to enter a prefix of a valid string and
have it completed for you.
</p>

<p>
By default, if you enter such a prefix and it matches more than
one value in the string list, the prefix will be completed to the
first matching value. But the <code>checkunique</code> argument, if true,
requires prefix matches to be unique in order to be valid.
</p>

<p>
The <code>REQ_NEXT_CHOICE</code> and <code>REQ_PREV_CHOICE</code> input requests can be
particularly useful with these fields.
</p>
</div>
</div>

<div id="outline-container-sec-19-5-4" class="outline-4">
<h4 id="sec-19-5-4"><code>TYPE_INTEGER</code></h4>
<div class="outline-text-4" id="text-19-5-4">
<p>
This field type accepts an integer. It is set up as follows:
</p>

<div class="org-src-container">

<pre class="src src-c">int set_field_type(FIELD *field,          /* field to alter          */
                   TYPE_INTEGER,          /* type to associate       */
                   int padding,           /* # places to zero-pad to */
                   int vmin, int vmax);   /* valid range             */
</pre>
</div>

<p>
Valid characters consist of an optional leading minus and digits.
The range check is performed on exit. If the range maximum is less
than or equal to the minimum, the range is ignored.
</p>

<p>
If the value passes its range check, it is padded with as many
leading zero digits as necessary to meet the <code>padding</code> argument.
</p>

<p>
A <code>TYPE_INTEGER</code> value buffer can conveniently be interpreted with
the C library function atoi(3).
</p>
</div>
</div>

<div id="outline-container-sec-19-5-5" class="outline-4">
<h4 id="sec-19-5-5"><code>TYPE_NUMERIC</code></h4>
<div class="outline-text-4" id="text-19-5-5">
<p>
This field type accepts a decimal number. It is set up as follows:
</p>

<div class="org-src-container">

<pre class="src src-c">int set_field_type(FIELD *field,          /* field to alter        */
                   TYPE_NUMERIC,          /* type to associate     */
                   int padding,           /* # places of precision */
                   int vmin, int vmax);   /* valid range           */
</pre>
</div>

<p>
Valid characters consist of an optional leading minus and digits.
possibly including a decimal point. The range check is performed
on exit. If the range maximum is less than or equal to the
minimum, the range is ignored.
</p>

<p>
If the value passes its range check, it is padded with as many
trailing zero digits as necessary to meet the <code>padding</code> argument.
</p>

<p>
A <code>TYPE_NUMERIC</code> value buffer can conveniently be interpreted with
the C library function atof(3).
</p>
</div>
</div>

<div id="outline-container-sec-19-5-6" class="outline-4">
<h4 id="sec-19-5-6"><code>TYPE_REGEXP</code></h4>
<div class="outline-text-4" id="text-19-5-6">
<p>
This field type accepts data matching a regular expression. It is
set up as follows:
</p>

<div class="org-src-container">

<pre class="src src-c">int set_field_type(FIELD *field,          /* field to alter      */
                   TYPE_REGEXP,           /* type to associate   */
                   char *regexp);         /* expression to match */
</pre>
</div>

<p>
The syntax for regular expressions is that of regcomp(3). The
check for regular-expression match is performed on exit.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-19-6" class="outline-3">
<h3 id="sec-19-6">18.6. Form Driver: The work horse of the forms system</h3>
<div class="outline-text-3" id="text-19-6">
<p>
As in the menu system, <code>form_driver()</code> plays a very important role
in forms system. All types of requests to forms system should be
funneled through <code>form_driver()</code>.
</p>

<div class="org-src-container">

<pre class="src src-c">int form_driver(FORM *form,     /* form on which to operate     */
                int request)    /* form request code         */
</pre>
</div>

<p>
As you have seen some of the examples above, you have to be in a
loop looking for user input and then decide whether it's a field
data or a form request. The form requests are then passed to
<code>form_driver()</code> to do the work.
</p>

<p>
The requests roughly can be divided into following categories.
Different requests and their usage is explained below:
</p>
</div>

<div id="outline-container-sec-19-6-1" class="outline-4">
<h4 id="sec-19-6-1">18.6.1. Page Navigation Requests</h4>
<div class="outline-text-4" id="text-19-6-1">
<p>
These requests cause page-level moves through the form, triggering
display of a new form screen. A form can be made of multiple
pages. If you have a big form with lot of fields and logical
sections, then you can divide the form into pages. The function
<code>set_new_page()</code> to set a new page at the field specified.
</p>

<div class="org-src-container">

<pre class="src src-c">int set_new_page(FIELD *field,        /* Field at which page break to be set or unset */
                 bool new_page_flag); /* should be TRUE to put a break                */
</pre>
</div>

<p>
The following requests allow you to move to different pages
</p>

<ul class="org-ul">
<li><code>REQ_NEXT_PAGE</code> Move to the next form page.
</li>

<li><code>REQ_PREV_PAGE</code> Move to the previous form page.
</li>

<li><code>REQ_FIRST_PAGE</code> Move to the first form page.
</li>

<li><code>REQ_LAST_PAGE</code> Move to the last form page.
</li>
</ul>


<p>
These requests treat the list as cyclic; that is, <code>REQ_NEXT_PAGE</code>
from the last page goes to the first, and <code>REQ_PREV_PAGE</code> from the
first page goes to the last.
</p>
</div>
</div>
