NCURSES-Programming-HOWTO.html

<div id="outline-container-sec-19-6-2" class="outline-4">
<h4 id="sec-19-6-2">18.6.2. Inter-Field Navigation Requests</h4>
<div class="outline-text-4" id="text-19-6-2">
<p>
These requests handle navigation between fields on the same page.
</p>

<ul class="org-ul">
<li><code>REQ_NEXT_FIELD</code> Move to next field.
</li>

<li><code>REQ_PREV_FIELD</code> Move to previous field.
</li>

<li><code>REQ_FIRST_FIELD</code> Move to the first field.
</li>

<li><code>REQ_LAST_FIELD</code> Move to the last field.
</li>

<li><code>REQ_SNEXT_FIELD</code> Move to sorted next field.
</li>

<li><code>REQ_SPREV_FIELD</code> Move to sorted previous field.
</li>

<li><code>REQ_SFIRST_FIELD</code> Move to the sorted first field.
</li>

<li><code>REQ_SLAST_FIELD</code> Move to the sorted last field.
</li>

<li><code>REQ_LEFT_FIELD</code> Move left to field.
</li>

<li><code>REQ_RIGHT_FIELD</code> Move right to field.
</li>

<li><code>REQ_UP_FIELD</code> Move up to field.
</li>

<li><code>REQ_DOWN_FIELD</code> Move down to field.
</li>
</ul>


<p>
These requests treat the list of fields on a page as cyclic; that
is, <code>REQ_NEXT_FIELD</code> from the last field goes to the first, and
<code>REQ_PREV_FIELD</code> from the first field goes to the last. The order
of the fields for these (and the <code>REQ_FIRST_FIELD</code> and
<code>REQ_LAST_FIELD</code> requests) is simply the order of the field
pointers in the form array (as set up by <code>new_form()</code> or
<code>set_form_fields()</code>)
</p>

<p>
It is also possible to traverse the fields as if they had been
sorted in screen-position order, so the sequence goes
left-to-right and top-to-bottom. To do this, use the second group
of four sorted-movement requests.
</p>

<p>
Finally, it is possible to move between fields using visual
directions up, down, right, and left. To accomplish this, use the
third group of four requests. Note, however, that the position of
a form for purposes of these requests is its upper-left corner.
</p>

<p>
For example, suppose you have a multi-line field B, and two
single-line fields A and C on the same line with B, with A to the
left of B and C to the right of B. A <code>REQ_MOVE_RIGHT</code> from A will
go to B only if A, B, and C all share the same first line;
otherwise it will skip over B to C.
</p>
</div>
</div>

<div id="outline-container-sec-19-6-3" class="outline-4">
<h4 id="sec-19-6-3">18.6.3. Intra-Field Navigation Requests</h4>
<div class="outline-text-4" id="text-19-6-3">
<p>
These requests drive movement of the edit cursor within the
currently selected field.
</p>

<ul class="org-ul">
<li><code>REQ_NEXT_CHAR</code> Move to next character.
</li>

<li><code>REQ_PREV_CHAR</code> Move to previous character.
</li>

<li><code>REQ_NEXT_LINE</code> Move to next line.
</li>

<li><code>REQ_PREV_LINE</code> Move to previous line.
</li>

<li><code>REQ_NEXT_WORD</code> Move to next word.
</li>

<li><code>REQ_PREV_WORD</code> Move to previous word.
</li>

<li><code>REQ_BEG_FIELD</code> Move to beginning of field.
</li>

<li><code>REQ_END_FIELD</code> Move to end of field.
</li>

<li><code>REQ_BEG_LINE</code> Move to beginning of line.
</li>

<li><code>REQ_END_LINE</code> Move to end of line.
</li>

<li><code>REQ_LEFT_CHAR</code> Move left in field.
</li>

<li><code>REQ_RIGHT_CHAR</code> Move right in field.
</li>

<li><code>REQ_UP_CHAR</code> Move up in field.
</li>

<li><code>REQ_DOWN_CHAR</code> Move down in field.
</li>
</ul>


<p>
Each word is separated from the previous and next characters by
whitespace. The commands to move to beginning and end of line or
field look for the first or last non-pad character in their
ranges.
</p>
</div>
</div>

<div id="outline-container-sec-19-6-4" class="outline-4">
<h4 id="sec-19-6-4">18.6.4. Scrolling Requests</h4>
<div class="outline-text-4" id="text-19-6-4">
<p>
Fields that are dynamic and have grown and fields explicitly
created with offscreen rows are scrollable. One-line fields scroll
horizontally; multi-line fields scroll vertically. Most scrolling
is triggered by editing and intra-field movement (the library
scrolls the field to keep the cursor visible). It is possible to
explicitly request scrolling with the following requests:
</p>

<ul class="org-ul">
<li><code>REQ_SCR_FLINE</code> Scroll vertically forward a line.
</li>

<li><code>REQ_SCR_BLINE</code> Scroll vertically backward a line.
</li>

<li><code>REQ_SCR_FPAGE</code> Scroll vertically forward a page.
</li>

<li><code>REQ_SCR_BPAGE</code> Scroll vertically backward a page.
</li>

<li><code>REQ_SCR_FHPAGE</code> Scroll vertically forward half a page.
</li>

<li><code>REQ_SCR_BHPAGE</code> Scroll vertically backward half a page.
</li>

<li><code>REQ_SCR_FCHAR</code> Scroll horizontally forward a character.
</li>

<li><code>REQ_SCR_BCHAR</code> Scroll horizontally backward a character.
</li>

<li><code>REQ_SCR_HFLINE</code> Scroll horizontally one field width forward.
</li>

<li><code>REQ_SCR_HBLINE</code> Scroll horizontally one field width backward.
</li>

<li><code>REQ_SCR_HFHALF</code> Scroll horizontally one half field width
forward.
</li>

<li><code>REQ_SCR_HBHALF</code> Scroll horizontally one half field width
backward.
</li>
</ul>


<p>
For scrolling purposes, a page of a field is the height of its
visible part.
</p>
</div>
</div>

<div id="outline-container-sec-19-6-5" class="outline-4">
<h4 id="sec-19-6-5">18.6.5. Editing Requests</h4>
<div class="outline-text-4" id="text-19-6-5">
<p>
When you pass the forms driver an ASCII character, it is treated
as a request to add the character to the field's data
buffer. Whether this is an insertion or a replacement depends on
the field's edit mode (insertion is the default).
</p>

<p>
The following requests support editing the field and changing the
edit mode:
</p>

<ul class="org-ul">
<li><code>REQ_INS_MODE</code> Set insertion mode.
</li>

<li><code>REQ_OVL_MODE</code> Set overlay mode.
</li>

<li><code>REQ_NEW_LINE</code> New line request (see below for explanation).
</li>

<li><code>REQ_INS_CHAR</code> Insert space at character location.
</li>

<li><code>REQ_INS_LINE</code> Insert blank line at character location.
</li>

<li><code>REQ_DEL_CHAR</code> Delete character at cursor.
</li>

<li><code>REQ_DEL_PREV</code> Delete previous word at cursor.
</li>

<li><code>REQ_DEL_LINE</code> Delete line at cursor.
</li>

<li><code>REQ_DEL_WORD</code> Delete word at cursor.
</li>

<li><code>REQ_CLR_EOL</code> Clear to end of line.
</li>

<li><code>REQ_CLR_EOF</code> Clear to end of field.
</li>

<li><code>REQ_CLR_FIELD</code> Clear entire field.
</li>
</ul>


<p>
The behavior of the <code>REQ_NEW_LINE</code> and <code>REQ_DEL_PREV</code> requests is
complicated and partly controlled by a pair of forms options. The
special cases are triggered when the cursor is at the beginning of
a field, or on the last line of the field.
</p>

<p>
First, we consider <code>REQ_NEW_LINE</code>:
</p>

<p>
The normal behavior of <code>REQ_NEW_LINE</code> in insert mode is to break
the current line at the position of the edit cursor, inserting the
portion of the current line after the cursor as a new line
following the current and moving the cursor to the beginning of
that new line (you may think of this as inserting a newline in the
field buffer).
</p>

<p>
The normal behavior of <code>REQ_NEW_LINE</code> in overlay mode is to clear
the current line from the position of the edit cursor to end of
line. The cursor is then moved to the beginning of the next line.
</p>

<p>
However, <code>REQ_NEW_LINE</code> at the beginning of a field, or on the
last line of a field, instead does a <code>REQ_NEXT_FIELD</code>.
<code>O_NL_OVERLOAD</code> option is off, this special action is disabled.
</p>

<p>
Now, let us consider <code>REQ_DEL_PREV</code>:
</p>

<p>
The normal behavior of <code>REQ_DEL_PREV</code> is to delete the previous
character. If insert mode is on, and the cursor is at the start of
a line, and the text on that line will fit on the previous one, it
instead appends the contents of the current line to the previous
one and deletes the current line (you may think of this as
deleting a newline from the field buffer).
</p>

<p>
However, <code>REQ_DEL_PREV</code> at the beginning of a field is instead
treated as a <code>REQ_PREV_FIELD</code>.
</p>

<p>
If the <code>O_BS_OVERLOAD</code> option is off, this special action is
disabled and the forms driver just returns <code>E_REQUEST_DENIED</code>.
</p>
</div>
</div>
