NCURSES-Programming-HOWTO.html

<div id="outline-container-sec-19-6-6" class="outline-4">
<h4 id="sec-19-6-6">18.6.6. Order Requests</h4>
<div class="outline-text-4" id="text-19-6-6">
<p>
If the type of your field is ordered, and has associated functions
for getting the next and previous values of the type from a given
value, there are requests that can fetch that value into the field
buffer:
</p>

<ul class="org-ul">
<li><code>REQ_NEXT_CHOICE</code> Place the successor value of the current value
in the buffer.
</li>

<li><code>REQ_PREV_CHOICE</code> Place the predecessor value of the current
value in the buffer.
</li>
</ul>


<p>
Of the built-in field types, only <code>TYPE_ENUM</code> has built-in
successor and predecessor functions. When you define a field type
of your own (see Custom Validation Types), you can associate our
own ordering functions.
</p>
</div>
</div>

<div id="outline-container-sec-19-6-7" class="outline-4">
<h4 id="sec-19-6-7">18.6.7. Application Commands</h4>
<div class="outline-text-4" id="text-19-6-7">
<p>
Form requests are represented as integers above the curses value
greater than <code>KEY_MAX</code> and less than or equal to the constant
<code>MAX_COMMAND</code>. A value within this range gets ignored by
<code>form_driver()</code>. So this can be used for any purpose by the
application. It can be treated as an application specific action
and take corresponding action.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-20" class="outline-2">
<h2 id="sec-20">19. Tools and Widget Libraries</h2>
<div class="outline-text-2" id="text-20">
<p>
Now that you have seen the capabilities of ncurses and its sister
libraries, you are rolling your sleeves up and gearing for a project
that heavily manipulates screen. But wait.. It can be pretty
difficult to write and maintain complex GUI widgets in plain ncurses
or even with the additional libraries. There are some ready-to-use
tools and widget libraries that can be used instead of writing your
own widgets. You can use some of them, get ideas from the code, or
even extend them.
</p>
</div>

<div id="outline-container-sec-20-1" class="outline-3">
<h3 id="sec-20-1">19.1. CDK (Curses Development Kit)</h3>
<div class="outline-text-3" id="text-20-1">
<p>
In the author's words
</p>

<div class="italic">
<p>
CDK stands for 'Curses Development Kit' and it currently contains
21 ready to use widgets which facilitate the speedy development
of full screen curses programs.
</p>

</div>

<p>
The kit provides some useful widgets, which can be used in your
programs directly. It's pretty well written and the documentation
is very good.  The examples in the examples directory can be a good
place to start for beginners. The CDK can be downloaded from
<a href="http://invisible-island.net/cdk/">http://invisible-island.net/cdk/</a> . Follow the instructions in
README file to install it.
</p>
</div>

<div id="outline-container-sec-20-1-1" class="outline-4">
<h4 id="sec-20-1-1">19.1.1. Widget List</h4>
<div class="outline-text-4" id="text-20-1-1">
<p>
The following is the list of widgets provided with cdk and their
description.
</p>

<pre class="example">
Widget Type           Quick Description
===========================================================================
Alphalist             Allows a user to select from a list of words, with
                      the ability to narrow the search list by typing in a
                      few characters of the desired word.
Buttonbox             This creates a multiple button widget.
Calendar              Creates a little simple calendar widget.
Dialog                Prompts the user with a message, and the user
                      can pick an answer from the buttons provided.
Entry                 Allows the user to enter various types of information.
File Selector         A file selector built from Cdk base widgets. This
                      example shows how to create more complicated widgets
                      using the Cdk widget library.
Graph                 Draws a graph.
Histogram             Draws a histogram.
Item List             Creates a pop up field which allows the user to select
                      one of several choices in a small field. Very useful
                      for things like days of the week or month names.
Label                 Displays messages in a pop up box, or the label can be
                      considered part of the screen.
Marquee               Displays a message in a scrolling marquee.
Matrix                Creates a complex matrix with lots of options.
Menu                  Creates a pull-down menu interface.
Multiple Line Entry   A multiple line entry field. Very useful
                      for long fields. (like a description
                      field)
Radio List            Creates a radio button list.
Scale                 Creates a numeric scale. Used for allowing a user to
                      pick a numeric value and restrict them to a range of
                      values.
Scrolling List        Creates a scrolling list/menu list.
Scrolling Window      Creates a scrolling log file viewer. Can add
                      information into the window while its running.
                      A good widget for displaying the progress of
                      something. (akin to a console window)
Selection List        Creates a multiple option selection list.
Slider                Akin to the scale widget, this widget provides a
                      visual slide bar to represent the numeric value.
Template              Creates a entry field with character sensitive
                      positions. Used for pre-formatted fields like
                      dates and phone numbers.
Viewer                This is a file/information viewer. Very useful
                      when you need to display loads of information.
===========================================================================
</pre>

<p>
A few of the widgets are modified by Thomas Dickey in recent
versions.
</p>
</div>
</div>

<div id="outline-container-sec-20-1-2" class="outline-4">
<h4 id="sec-20-1-2">19.1.2. Some Attractive Features</h4>
<div class="outline-text-4" id="text-20-1-2">
<p>
Apart from making our life easier with readily usable widgets, cdk
solves one frustrating problem with printing multi colored
strings, justified strings elegantly. Special formatting tags can
be embedded in the strings which are passed to CDK functions. For
Example
</p>

<p>
If the string
</p>

<pre class="example">
"&lt;/B/1&gt;This line should have a yellow foreground and a blue
background.&lt;!1&gt;"
</pre>

<p>
given as a parameter to <code>newCDKLabel()</code>, it prints the line with
yellow foreground and blue background. There are other tags
available for justifying string, embedding special drawing
characters etc.. Please refer to the man page <code>cdk_display(3X)</code>
for details. The man page explains the usage with nice examples.
</p>
</div>
</div>

<div id="outline-container-sec-20-1-3" class="outline-4">
<h4 id="sec-20-1-3">19.1.3. Conclusion</h4>
<div class="outline-text-4" id="text-20-1-3">
<p>
All in all, CDK is a well-written package of widgets, which if
used properly can form a strong frame work for developing complex
GUI.
</p>
</div>
</div>
</div>
