NCURSES-Programming-HOWTO.org
** 19.2. The dialog

   Long long ago, in September 1994, when few people knew linux, Jeff
   Tranter wrote an [[http://www2.linuxjournal.com/lj-issues/issue5/2807.html][article]] on dialog in Linux Journal. He starts the
   article with these words..

   #+BEGIN_ITALIC
     Linux is based on the Unix operating system, but also features a
     number of unique and useful kernel features and application
     programs that often go beyond what is available under Unix. One
     little-known gem is "dialog", a utility for creating
     professional-looking dialog boxes from within shell scripts. This
     article presents a tutorial introduction to the dialog utility,
     and shows examples of how and where it can be used
   #+END_ITALIC

   As he explains, dialog is a real gem in making professional-looking
   dialog boxes with ease. It creates a variety of dialog boxes,
   menus, check lists etc.. It is usually installed by default. If
   not, you can download it from [[http://invisible-island.net/dialog/][Thomas Dickey]]'s site.

   The above-mentioned article gives a very good overview of its uses
   and capabilites. The man page has more details. It can be used in
   variety of situations. One good example is building of linux kernel
   in text mode.  Linux kernel uses a modified version of dialog
   tailored for its needs.

   dialog was initially designed to be used with shell scripts. If you
   want to use its functionality in a c program, then you can use
   libdialog. The documentation regarding this is sparse. Definitive
   reference is the dialog.h header file which comes with the
   library. You may need to hack here and there to get the required
   output. The source is easily customizable. I have used it on a
   number of occasions by modifying the code.

** 19.3. Perl Curses Modules CURSES::FORM and CURSES::WIDGETS

   The perl module Curses, Curses::Form and Curses::Widgets give
   access to curses from perl. If you have curses and basic perl is
   installed, you can get these modules from [[http://www.cpan.org/modules/01modules.index.html][CPAN All Modules page]].
   Get the three zipped modules in the Curses category. Once installed
   you can use these modules from perl scripts like any other
   module. For more information on perl modules see perlmod man
   page. The above modules come with good documentation and they have
   some demo scripts to test the functionality. Though the widgets
   provided are very rudimentary, these modules provide good access to
   curses library from [[file:ncurses_programs/perl][perl]].

   Some of my code examples are converted to perl by Anuradha
   Ratnaweera and they are available in the =perl= directory.

   For more information see man pages Curses(3), Curses::Form(3) and
   Curses::Widgets(3). These pages are installed only when the above
   modules are acquired and installed.

* 20. Just For Fun !!!

  This section contains few programs written by me just for fun. They
  don't signify a better programming practice or the best way of using
  ncurses. They are provided here so as to allow beginners to get
  ideas and add more programs to this section. If you have written a
  couple of nice, simple programs in curses and want them to included
  here, contact [[mailto:ppadala@gmail.com][me]].

** 20.1. The Game of Life

   Game of life is a wonder of math. In [[http://www.math.com/students/wonders/life/life.html][Paul Callahan]]'s words

   #+BEGIN_EXAMPLE
     The Game of Life (or simply Life) is not a game in the conventional sense. There
     are no players, and no winning or losing. Once the "pieces" are placed in the
     starting position, the rules determine everything that happens later.
     Nevertheless, Life is full of surprises! In most cases, it is impossible to look
     at a starting position (or pattern) and see what will happen in the future. The
     only way to find out is to follow the rules of the game.
   #+END_EXAMPLE

   This program starts with a simple inverted U pattern and shows how
   wonderful life works. There is a lot of room for improvement in the
   program. You can let the user enter pattern of his choice or even
   take input from a file. You can also change rules and play with a
   lot of variations. Search on [[http://www.google.com][google]] for interesting information on
   game of life.

   /File Path: JustForFun/life.c/

** 20.2. Magic Square

   Magic Square, another wonder of math, is very simple to understand
   but very difficult to make. In a magic square sum of the numbers in
   each row, each column is equal. Even diagnol sum can be
   equal. There are many variations which have special properties.

   This program creates a simple magic square of odd order.

   File Path: [[file:ncurses_programs/JustForFun/magic.c][JustForFun/magic.c]]

** 20.3. Towers of Hanoi

   The famous towers of hanoi solver. The aim of the game is to move
   the disks on the first peg to last peg, using middle peg as a
   temporary stay. The catch is not to place a larger disk over a
   small disk at any time.

   File Path: [[file:ncurses_programs/JustForFun/hanoi.c][JustForFun/hanoi.c]]

** 20.4. Queens Puzzle

   The objective of the famous N-Queen puzzle is to put N queens on a
   N X N chess board without attacking each other.

   This program solves it with a simple backtracking technique.

   File Path: [[file:ncurses_programs/JustForFun/queens.c][JustForFun/queens.c]]

** 20.5. Shuffle

   A fun game, if you have time to kill.

   File Path: [[file:ncurses_programs/JustForFun/shuffle.c][JustForFun/shuffle.c]]

** 20.6. Typing Tutor

   A simple typing tutor, I created more out of need than for ease of
   use.  If you know how to put your fingers correctly on the
   keyboard, but lack practice, this can be helpful.

   File Path: [[file:ncurses_programs/JustForFun/tt.c][JustForFun/tt.c]]

* 21. References

  - NCURSES [[file:man/index.org][man pages]]

  - NCURSES FAQ at
    [[http://invisible-island.net/ncurses/ncurses.faq.html]]

  - Writing programs with NCURSES by Eric Raymond and Zeyd M. Ben-Halim
    at [[http://invisible-island.net/ncurses/ncurses-intro.html]] -
    somewhat obsolete. I was inspired by this document and the structure
    of this HOWTO follows from the original document
