NCURSES-Programming-HOWTO.html

<div id="outline-container-sec-20-2" class="outline-3">
<h3 id="sec-20-2">19.2. The dialog</h3>
<div class="outline-text-3" id="text-20-2">
<p>
Long long ago, in September 1994, when few people knew linux, Jeff
Tranter wrote an <a href="http://www2.linuxjournal.com/lj-issues/issue5/2807.html">article</a> on dialog in Linux Journal. He starts the
article with these words..
</p>

<div class="italic">
<p>
Linux is based on the Unix operating system, but also features a
number of unique and useful kernel features and application
programs that often go beyond what is available under Unix. One
little-known gem is "dialog", a utility for creating
professional-looking dialog boxes from within shell scripts. This
article presents a tutorial introduction to the dialog utility,
and shows examples of how and where it can be used
</p>

</div>

<p>
As he explains, dialog is a real gem in making professional-looking
dialog boxes with ease. It creates a variety of dialog boxes,
menus, check lists etc.. It is usually installed by default. If
not, you can download it from <a href="http://invisible-island.net/dialog/">Thomas Dickey</a>'s site.
</p>

<p>
The above-mentioned article gives a very good overview of its uses
and capabilites. The man page has more details. It can be used in
variety of situations. One good example is building of linux kernel
in text mode.  Linux kernel uses a modified version of dialog
tailored for its needs.
</p>

<p>
dialog was initially designed to be used with shell scripts. If you
want to use its functionality in a c program, then you can use
libdialog. The documentation regarding this is sparse. Definitive
reference is the dialog.h header file which comes with the
library. You may need to hack here and there to get the required
output. The source is easily customizable. I have used it on a
number of occasions by modifying the code.
</p>
</div>
</div>

<div id="outline-container-sec-20-3" class="outline-3">
<h3 id="sec-20-3">19.3. Perl Curses Modules CURSES::FORM and CURSES::WIDGETS</h3>
<div class="outline-text-3" id="text-20-3">
<p>
The perl module Curses, Curses::Form and Curses::Widgets give
access to curses from perl. If you have curses and basic perl is
installed, you can get these modules from <a href="http://www.cpan.org/modules/01modules.index.html">CPAN All Modules page</a>.
Get the three zipped modules in the Curses category. Once installed
you can use these modules from perl scripts like any other
module. For more information on perl modules see perlmod man
page. The above modules come with good documentation and they have
some demo scripts to test the functionality. Though the widgets
provided are very rudimentary, these modules provide good access to
curses library from <a href="ncurses_programs/perl">perl</a>.
</p>

<p>
Some of my code examples are converted to perl by Anuradha
Ratnaweera and they are available in the <code>perl</code> directory.
</p>

<p>
For more information see man pages Curses(3), Curses::Form(3) and
Curses::Widgets(3). These pages are installed only when the above
modules are acquired and installed.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21">20. Just For Fun !!!</h2>
<div class="outline-text-2" id="text-21">
<p>
This section contains few programs written by me just for fun. They
don't signify a better programming practice or the best way of using
ncurses. They are provided here so as to allow beginners to get
ideas and add more programs to this section. If you have written a
couple of nice, simple programs in curses and want them to included
here, contact <a href="mailto:ppadala@gmail.com">me</a>.
</p>
</div>

<div id="outline-container-sec-21-1" class="outline-3">
<h3 id="sec-21-1">20.1. The Game of Life</h3>
<div class="outline-text-3" id="text-21-1">
<p>
Game of life is a wonder of math. In <a href="http://www.math.com/students/wonders/life/life.html">Paul Callahan</a>'s words
</p>

<pre class="example">
The Game of Life (or simply Life) is not a game in the conventional sense. There
are no players, and no winning or losing. Once the "pieces" are placed in the
starting position, the rules determine everything that happens later.
Nevertheless, Life is full of surprises! In most cases, it is impossible to look
at a starting position (or pattern) and see what will happen in the future. The
only way to find out is to follow the rules of the game.
</pre>

<p>
This program starts with a simple inverted U pattern and shows how
wonderful life works. There is a lot of room for improvement in the
program. You can let the user enter pattern of his choice or even
take input from a file. You can also change rules and play with a
lot of variations. Search on <a href="http://www.google.com">google</a> for interesting information on
game of life.
</p>

<p>
<i>File Path: JustForFun/life.c</i>
</p>
</div>
</div>

<div id="outline-container-sec-21-2" class="outline-3">
<h3 id="sec-21-2">20.2. Magic Square</h3>
<div class="outline-text-3" id="text-21-2">
<p>
Magic Square, another wonder of math, is very simple to understand
but very difficult to make. In a magic square sum of the numbers in
each row, each column is equal. Even diagnol sum can be
equal. There are many variations which have special properties.
</p>

<p>
This program creates a simple magic square of odd order.
</p>

<p>
File Path: <a href="ncurses_programs/JustForFun/magic.c">JustForFun/magic.c</a>
</p>
</div>
</div>

<div id="outline-container-sec-21-3" class="outline-3">
<h3 id="sec-21-3">20.3. Towers of Hanoi</h3>
<div class="outline-text-3" id="text-21-3">
<p>
The famous towers of hanoi solver. The aim of the game is to move
the disks on the first peg to last peg, using middle peg as a
temporary stay. The catch is not to place a larger disk over a
small disk at any time.
</p>

<p>
File Path: <a href="ncurses_programs/JustForFun/hanoi.c">JustForFun/hanoi.c</a>
</p>
</div>
</div>

<div id="outline-container-sec-21-4" class="outline-3">
<h3 id="sec-21-4">20.4. Queens Puzzle</h3>
<div class="outline-text-3" id="text-21-4">
<p>
The objective of the famous N-Queen puzzle is to put N queens on a
N X N chess board without attacking each other.
</p>

<p>
This program solves it with a simple backtracking technique.
</p>

<p>
File Path: <a href="ncurses_programs/JustForFun/queens.c">JustForFun/queens.c</a>
</p>
</div>
</div>

<div id="outline-container-sec-21-5" class="outline-3">
<h3 id="sec-21-5">20.5. Shuffle</h3>
<div class="outline-text-3" id="text-21-5">
<p>
A fun game, if you have time to kill.
</p>

<p>
File Path: <a href="ncurses_programs/JustForFun/shuffle.c">JustForFun/shuffle.c</a>
</p>
</div>
</div>

<div id="outline-container-sec-21-6" class="outline-3">
<h3 id="sec-21-6">20.6. Typing Tutor</h3>
<div class="outline-text-3" id="text-21-6">
<p>
A simple typing tutor, I created more out of need than for ease of
use.  If you know how to put your fingers correctly on the
keyboard, but lack practice, this can be helpful.
</p>

<p>
File Path: <a href="ncurses_programs/JustForFun/tt.c">JustForFun/tt.c</a>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-22" class="outline-2">
<h2 id="sec-22">21. References</h2>
<div class="outline-text-2" id="text-22">
<ul class="org-ul">
<li>NCURSES <a href="man/index.html">man pages</a>
</li>

<li>NCURSES FAQ at
<a href="http://invisible-island.net/ncurses/ncurses.faq.html">http://invisible-island.net/ncurses/ncurses.faq.html</a>
</li>

<li>Writing programs with NCURSES by Eric Raymond and Zeyd M. Ben-Halim
at <a href="http://invisible-island.net/ncurses/ncurses-intro.html">http://invisible-island.net/ncurses/ncurses-intro.html</a> -
somewhat obsolete. I was inspired by this document and the structure
of this HOWTO follows from the original document
</li>
</ul>
</div>
</div>
</div>
</body>
</html>
